[
  {
    "content": "An abstract is a small summary – typically around 150-200 words – of a substantial piece of written work. You will encounter abstracts in published articles and reports. The purpose of an abstract is to outline the main themes and findings of a piece of work, but not every detail and complexity. An abstract will help a reader decide whether they should read a piece of work. When completing assessed work, you may be required to submit an abstract of your own as part of your reports or long essays. Abstracts should be written once a report or essay have been completed, so you can provide the most accurate summary of your work.",
    "metadata": {
      "term": "Abstract",
      "category": "Academic Writing"
    }
  },
  {
    "content": "Imperial College London has over 400 academic representatives across both undergraduate and postgraduate courses and research groups. Representatives collect invaluable feedback from students about all aspects of their academic experience, which is then followed up with relevant staff. They are often the first point of contact for course-specific issues. You can talk to them if you are unhappy about your course, research or facilities.",
    "metadata": {
      "term": "Academic Representatives",
      "category": "Student Support"
    }
  },
  {
    "content": "Similar to a Personal Tutor, some departments will allocate you an Academic Tutor instead or as well as a Personal Tutor. The Academic Tutor has more emphasis on your academic progress and performance whereas a Personal Tutor will help with all aspects of university life.",
    "metadata": {
      "term": "Academic Tutor",
      "category": "Student Support"
    }
  },
  {
    "content": "Imperial's most widely-used Virtual Learning Environment (VLE). Departments use it to host materials such as lecture notes and reading lists, alongside discussion forums and the means for students to submit assignments online. While different departments might use alternative VLEs, most students will encounter Blackboard during their time at the College.",
    "metadata": {
      "term": "Blackboard",
      "category": "Learning Resources"
    }
  },
  {
    "content": "This is the person with overall responsibility for the development and delivery of a course within your department. They will have developed the teaching resources, and will be the main point of contact for any questions you have about the course content and structure. You will usually be able to contact them through Blackboard, email or in person.",
    "metadata": {
      "term": "Course Organiser or Convenor",
      "category": "Academic Staff"
    }
  },
  {
    "content": "GTAs or graduate teaching assistants are usually PhD students with departmental teaching responsibilities. They provide academic and administrative support to course lecturers and contribute greatly to the quality of each course by teaching, tutoring, and supervising projects. GTAs have already completed an undergraduate and often a postgraduate degree, and are now undertaking their own research in a specific field.",
    "metadata": {
      "term": "GTA",
      "category": "Academic Staff"
    }
  },
  {
    "content": "Plagiarism is the presentation of another person's thoughts, words or images and diagrams as though they were your own and which is a form of cheating, must be avoided, with particular care in coursework, essays, reports and projects written in your own time and also in open and closed book written examinations.",
    "metadata": {
      "term": "Plagiarism",
      "category": "Academic Integrity"
    }
  },
  {
    "content": "Degree courses are broken down into a series of smaller units known as modules. 'Core' modules are compulsory components of each course, while 'elective' (or 'optional') modules can be chosen from a wider group, allowing you to tailor your learning to your own academic interests.",
    "metadata": {
      "term": "Module",
      "category": "Course Structure"
    }
  }
]