[
  {
    "content": "Home Imperial students Fees and funding Contact We're here to help with any questions you may have about tuition fees and student funding. We have different teams for different types of queries so explore below which team is best placed to help you. Student Financial Support team For information on scholarships, please see our Scholarships pages. Each scholarship will include a contact email for specific questions. For all general enquiries relating to scholarships and student funding at Imperial College London, please contact student.hub@imperial.ac.uk. For specific enquiries relating to your bursary or financial support (including the Student Support Fund for hardship assistance), please contact us at: student.funding@imperial.ac.uk. Tuition fees enquiries For questions about tuition fees, please use the relevant details below to ensure your query is dealt with by the right team: Visa and CAS enquiries: admissions-cas@imperial.ac.uk Request a formal receipt for payment of fees: studentpay.queries@imperial.ac.uk Request a tuition fee refund: tuition.fees@imperial.ac.uk Ask about paying your fees in instalments: student.lending@imperial.ac.uk General enquiries about tuition fees: tuition.fees@imperial.ac.uk If you wish to book a call with the Student Fees and Credit Control teams, you can use our online booking system. By phone You can contact the Finance teams or Student Financial Support by phone on the one number: +44 (0)20 7594 7777",
    "metadata": {
      "title": "Contact",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/contact",
      "category": "Fees and Funding",
      "subcategory": "Contact",
      "key_points": [
        "Different teams handle different types of queries related to tuition fees and student funding",
        "Contact information for the Student Financial Support team and Tuition Fees enquiries",
        "Ability to book a call with the Student Fees and Credit Control teams",
        "Contact number for Finance teams and Student Financial Support"
      ]
    }
  },
  {
    "content": "Home, Imperial students, Fees and funding, Financial Assistance, Financial Assistance, Financial Assistance, Student Support Fund, Student Global Relief Fund",
    "metadata": {
      "title": "Financial Assistance",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/financial-assistance",
      "categories": [
        "Fees and funding",
        "Financial Assistance"
      ],
      "key_points": [
        "Student Support Fund provides emergency financial help for students in financial difficulties or experiencing unexpected changes in circumstances",
        "Student Global Relief Fund provides emergency financial help for students who have lost their funding due to social, political, environmental, or economic crises, or where banks have stopped money leaving the country or withdrawals from certain nationalities"
      ]
    }
  },
  {
    "content": "Imperial College London offers the Student Global Relief Fund to help current students who lose their funding and experience genuine financial hardship. All registered students can apply, and the Fund aims to subsidize tuition fees and long-term costs associated with studying. Awards are based on the applicant's financial situation, and documentation is required. The application process involves completing the 'Budgeting 101' pathway on the Blackbullion platform. The assessment considers the applicant's income, expenses, and potential for academic success. Decisions are made within 10 working days, and students may need to reapply annually if their situation has not changed.",
    "metadata": {
      "title": "Student Global Relief Fund",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/financial-assistance/global-fund",
      "category": "Fees and Funding",
      "subcategory": "Financial Assistance",
      "key_points": [
        "The Student Global Relief Fund helps students who lose their funding and experience financial hardship",
        "All registered students can apply for assistance with tuition fees and long-term study costs",
        "Applications are assessed based on financial situation and academic potential",
        "The application process involves completing a budgeting course on Blackbullion",
        "Decisions are made within 10 working days, and annual reapplication may be required"
      ]
    }
  },
  {
    "content": "The Student Support Fund is a discretional hardship fund available to all enrolled Imperial College London students facing unexpected financial hardship with their cost of living. The Fund provides short-term assistance up to £5,000 in the form of grants or interest-free loans. Students are expected to have appropriate funding in place, utilize available resources, and demonstrate financial planning. Applications are assessed based on individual circumstances, with a focus on ensuring students can pay for rent and food. The Fund is supported by the College and generous donations. Students can apply via the Blackbullion platform and may receive a decision within 10 working days.",
    "metadata": {
      "title": "Student Support Fund",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/financial-assistance/student-support-fund",
      "category": "Fees and Funding",
      "subcategory": "Financial Assistance",
      "key_points": [
        "Discretional hardship fund for all enrolled Imperial students",
        "Provides short-term assistance up to £5,000 in grants or loans",
        "Expects students to have appropriate funding and demonstrate financial planning",
        "Applications assessed based on individual circumstances and need",
        "Supported by the College and donations, apply via Blackbullion"
      ]
    }
  },
  {
    "content": "The Student Support Fund is administered by the Student Financial Support team in the Registry. General enquiries can be emailed to student.funding@imperial.ac.uk. To repay a loan from the Student Support Fund, or pay for fines, DBS checks or transcripts, go to the Student Support Fund repayments and charges page. If you wish to donate to the Student Support Fund, see the information on the College Giving page and select 'Student Hardship Fund' as the Designation.",
    "metadata": {
      "title": "Payments & donations",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/financial-assistance/student-support-fund/payments--donations",
      "category": "Fees and Funding",
      "subcategory": "Financial Assistance",
      "key_points": [
        "Student Support Fund is administered by Student Financial Support team",
        "Repay loans or pay for fines, DBS checks, transcripts through Student Support Fund repayments and charges page",
        "Donate to Student Support Fund through College Giving page, selecting 'Student Hardship Fund' as the Designation"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding General support Student Support Fund Funding for placements",
    "metadata": {
      "title": "General support",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support",
      "categories": [
        "Home",
        "Imperial students",
        "Fees and funding",
        "General support",
        "Student Support Fund",
        "Funding for placements"
      ]
    }
  },
  {
    "content": "Imperial College London provides support for students with children, including policies on maternity, adoptive, and paternity leave. Undergraduate and postgraduate students can interrupt their studies for up to one year to take maternity leave. Research students may be eligible for paid parental leave through an expanded College central fund. International students should contact the International Student Support Team regarding visa implications. Financial support is also available, such as the Childcare Grant for full-time undergraduate students and the Student Support Fund for childcare costs.",
    "metadata": {
      "title": "Students with children",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/childcare",
      "category": "student support",
      "subcategory": "parental leave and childcare",
      "key_points": [
        "Policies on maternity, adoptive, and paternity leave for students",
        "Interruption of studies for up to one year for maternity leave",
        "Paid parental leave available for research students through College fund",
        "Visa implications for international students",
        "Financial support for childcare costs"
      ]
    }
  },
  {
    "content": "The IC Trust General Fund provides grants to students invited to attend academic conferences. Students who have been invited to present at an academic conference can apply to the IC Trust General Fund for a conference grant.",
    "metadata": {
      "title": "Conference Funding",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/conference-funding",
      "category": "Fees and Funding",
      "subcategory": "General Support",
      "key_points": [
        "The IC Trust General Fund provides conference grants",
        "Grants are available for students invited to present at academic conferences"
      ]
    }
  },
  {
    "content": "Imperial students can apply for emergency financial help through the Student Support Fund if they're in financial difficulties or have experienced unexpected changes in circumstances. The Student Global Relief Fund also provides assistance if students' existing awards have been affected by social, political, environmental, or economic crises.",
    "metadata": {
      "title": "Financial Assistance",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/financial-assistance",
      "category": "Fees and Funding",
      "subcategory": "Financial Assistance",
      "key_points": [
        "Student Support Fund provides emergency financial help",
        "Student Global Relief Fund assists with loss of existing awards",
        "Eligibility includes financial difficulties or unexpected changes in circumstances",
        "Crises that can affect awards include social, political, environmental, or economic events"
      ]
    }
  },
  {
    "content": "University life different from previous experiences. Live with people from around the world. Take responsibility for education and self-care. Be aware of expectations and opportunities.",
    "metadata": {
      "title": "Student Global Relief Fund",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/financial-assistance/global-fund",
      "category": "Fees and Funding",
      "subcategory": "Financial Assistance",
      "key_points": [
        "University life is different from previous experiences",
        "You'll live with people from around the world",
        "Take responsibility for your education and self-care",
        "Be aware of expectations and opportunities"
      ]
    }
  },
  {
    "content": "The Student Support Fund is a discretionary hardship fund available to all enrolled Imperial College London students who face unexpected financial hardship with their cost of living, excluding tuition fees or visa costs. The fund provides grants up to £5,000 or interest-free loans up to £5,000, based on assessment of the student's financial situation. Applicants are expected to have appropriate funding in place, utilize all available resources, and make realistic financial plans. The application process involves submitting supporting documents and completing the 'Budgeting 101' pathway on the Blackbullion platform. Awards are typically made within 10 working days. The fund also provides assistance with graduation costs and subsidized needs assessments through the Disability Advisory Service.",
    "metadata": {
      "title": "Student Support Fund",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/financial-assistance/student-support-fund",
      "categories": [
        "Financial Assistance",
        "Hardship Fund"
      ],
      "key_points": [
        "Discretionary hardship fund available to all enrolled students",
        "Provides grants up to £5,000 or interest-free loans up to £5,000",
        "Applicants must have appropriate funding, utilize available resources, and make realistic financial plans",
        "Application process involves submitting supporting documents and completing 'Budgeting 101' on Blackbullion",
        "Awards typically made within 10 working days",
        "Provides assistance with graduation costs and subsidized needs assessments"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding General support Financial Assistance Student Support Fund Payments & donations Payments & donations The Student Support Fund is administered by the Student Financial Support team in the Registry. General enquiries can be emailed to student.funding@imperial.ac.uk. Payments to the Student Support Fund for loan repayments and charges To repay a loan from the Student Support Fund, or pay for fines, DBS checks or transcripts please go to our Student Support Fund repayments and charges page. Donations to the Student Support Fund If you wish to donate to the Student Support Fund please see the information on our College Giving page, and select 'Student Hardship Fund' as the Designation. Thank you for your generous support.",
    "metadata": {
      "title": "Payments & donations",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/financial-assistance/student-support-fund/payments--donations",
      "category": "fees-and-funding",
      "subcategory": "financial-assistance",
      "key_points": [
        "The Student Support Fund is administered by the Student Financial Support team",
        "Repay loans or pay for fines, DBS checks, or transcripts on the Student Support Fund repayments and charges page",
        "Donate to the Student Hardship Fund through the College Giving page"
      ]
    }
  },
  {
    "content": "Imperial students can receive funding for various placements, including year abroad, year in industry, Erasmus grants, Turing Scheme funding, and Undergraduate Research Opportunities Programme. The details and eligibility criteria for these funding options vary.",
    "metadata": {
      "title": "Funding for placements",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/funding-for-placements",
      "categories": [
        "fees-and-funding",
        "general-support",
        "funding-for-placements"
      ],
      "key_points": [
        "Funding available for year abroad, year in industry, Erasmus grants, Turing Scheme, and Undergraduate Research Opportunities Programme",
        "Eligibility and details vary for different funding options",
        "Students should contact Student Financial Support for further information"
      ]
    }
  },
  {
    "content": "The Erasmus Student Charter contains the principles governing an Erasmus mobility period. General information about undertaking placements is available via the Placements webpage, including the Placements Abroad Handbook. Erasmus is the European Commission's mobility programme for higher education students, providing financial support to assist with additional expenses such as travel costs. The grant amount varies by country, with a higher rate for Nordic countries. Eligibility criteria include a minimum 3-month and maximum 12-month mobility, as part of your degree program. If your household income is below £25,000, you can apply for an additional 120 euros per month. Applications are considered on a first-come, first-served basis, with successful applicants having responsibilities such as submitting a signed grant contract, complying with the learning agreement, and completing various forms and surveys. Payments are made in two installments, primarily in Euros but can be paid into UK bank accounts.",
    "metadata": {
      "title": "Erasmus grants for 2021-22 study period",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/funding-for-placements/erasmus-grants-for-2021-22-study-period",
      "category": "Funding",
      "subcategory": "Erasmus Grants",
      "key_points": [
        "Erasmus provides financial support for study abroad",
        "Grant amounts vary by country, with higher rates for Nordic countries",
        "Eligibility includes minimum 3-month and maximum 12-month mobility",
        "Additional grant available for low-income students",
        "Application and reporting requirements for successful applicants"
      ]
    }
  },
  {
    "content": "The Turing Scheme is the UK government's global program to fund international opportunities in education and training across the world. It provides funding for study and work abroad, with enhanced funding for students from under-represented backgrounds. Applications for the 2023-24 and 2024-25 academic years are now open.",
    "metadata": {
      "title": "Turing Scheme",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/funding-for-placements/turing-scheme",
      "category": "Funding",
      "subcategory": "Turing Scheme",
      "key_points": [
        "The Turing Scheme provides funding for international education and training opportunities",
        "Funding is available for the 2023-24 and 2024-25 academic years",
        "Enhanced funding is offered to students from under-represented backgrounds"
      ]
    }
  },
  {
    "content": "The Turing Scheme is the UK government's global programme to study and work abroad. Imperial has been awarded funding to support students to take up international opportunities across several activities. Home (UK), EU and international students are all eligible to apply. The standard grant rate is calculated by the length of stay, location of the activity and cost of living at the destination. Enhanced funding is available for certain groups, including students with low household income, home students receiving the Imperial Bursary, students of Black heritage, students receiving Universal Credit, care experienced students, and students with disabilities. The enhanced funding includes a top-up to the standard grant rate and a travel grant. Dates and duration of the placements must be between 1 September 2023 and 31 August 2024, and the duration must be between one month and 12 months. The destinations are pre-arranged by Imperial, and students may have the opportunity to apply to alternative institutions in some cases.",
    "metadata": {
      "title": "Turing Scheme 2023-24",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/funding-for-placements/turing-scheme/turing-scheme-2023-24",
      "category": "Funding",
      "subcategory": "Turing Scheme",
      "key_points": [
        "The Turing Scheme provides funding for students to study or work abroad",
        "Home, EU, and international students at Imperial are eligible to apply",
        "Standard grant rates are based on length of stay, location, and cost of living",
        "Enhanced funding is available for certain groups, including low-income and underrepresented students",
        "Placements must be between 1 September 2023 and 31 August 2024, and 1-12 months in duration",
        "Destinations are pre-arranged by Imperial, with some flexibility in some cases"
      ]
    }
  },
  {
    "content": "The Turing Scheme is the UK government's global programme to study and work abroad. Imperial College has applied for 2024/25 Turing Scheme funding. Applications for Year Abroad placements have opened with the expectation the College will receive an adequate budget to support this activity. Eligibility criteria include being a Home (UK), EU or international student, and studying an undergraduate, postgraduate taught or postgraduate research degree at Imperial. Enhanced funding offers a top-up to the standard grant rate, plus a travel grant, and is available for certain groups. Dates and duration of placements must be between 1 September 2024 and 31 August 2025, with varying lengths. Destinations are based on Imperial's 2024-25 Turing Scheme bid.",
    "metadata": {
      "title": "Turing Scheme 2024-25",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/funding-for-placements/turing-scheme/turing-scheme-2024-25",
      "category": "Funding",
      "subcategory": "Turing Scheme",
      "key_points": [
        "The Turing Scheme is the UK government's global programme to study and work abroad",
        "Imperial has applied for 2024/25 Turing Scheme funding",
        "Eligibility criteria include being a student at Imperial",
        "Enhanced funding is available for certain groups",
        "Placements must be between 1 September 2024 and 31 August 2025",
        "Destinations are based on Imperial's 2024-25 Turing Scheme bid"
      ]
    }
  },
  {
    "content": "Imperial College offers various UROP bursaries for undergraduate students, including the Presidential UROP Bursary for Students of Black Heritage, the EPSRC Vacation Bursary, and the Faculty of Engineering and Natural Sciences UROP Awards. Students can apply for these bursaries to support their research experiences during the summer. The application process involves submitting an Expression of Interest, completing an application form, and providing a supporting statement from a supervisor. Deadlines and eligibility criteria vary across the different bursary schemes.",
    "metadata": {
      "title": "Undergraduate Research Opportunities Programme",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/funding-for-placements/urop",
      "category": "Funding",
      "subcategory": "Undergraduate Research Opportunities Programme",
      "key_points": [
        "Imperial College offers various UROP bursaries for undergraduate students",
        "The bursaries support research experiences during the summer",
        "Application process involves submitting an Expression of Interest, application form, and supervisor's supporting statement",
        "Deadlines and eligibility criteria vary across the different bursary schemes"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding General support Funding for placements Year Abroad UK Government Funding If you are a Home undergraduate student who is planning to spend a year abroad at an overseas University as part of your programme you are eligible to apply for the same funding as you would in the UK. Depending on the duration of your period of study abroad, you may also be entitled to an additional Travel Grant and the Study Abroad rate for your maintenance loan. You should apply to your funding authority as usual for your tuition fee loan as well as maintenance loans and grants. Tuition Fees Tuition fee information for your year abroad can be found on the tuition fees webpage. Imperial Bursary If you receive the Imperial Bursary you will continue to receive 15% of your assessed amount during your year abroad.",
    "metadata": {
      "title": "Year Abroad",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/funding-for-placements/year-abroad",
      "category": "fees-and-funding",
      "subcategory": "year-abroad",
      "key_points": [
        "Home undergraduate students can apply for the same funding as in the UK for a year abroad",
        "May be eligible for additional Travel Grant and Study Abroad rate for maintenance loan",
        "Apply to funding authority for tuition fee loan and maintenance loans/grants as usual",
        "Tuition fee information available on the tuition fees webpage",
        "If receiving Imperial Bursary, will continue to receive 15% of assessed amount during year abroad"
      ]
    }
  },
  {
    "content": "Home students undertaking a year in industry are eligible for partial government funding. Tuition fee information can be found on the tuition fees webpage. Imperial Bursaries are awarded based on household income assessments. Paid placements can earn £1,000 to £1,500 per month, while unpaid placements may qualify for 15% of the assessed Imperial Bursary.",
    "metadata": {
      "title": "Year in Industry",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/funding-for-placements/year-in-industry",
      "category": "Fees and Funding",
      "subcategory": "Funding for Placements",
      "key_points": [
        "Government funding available for year in industry",
        "Tuition fee information on dedicated webpage",
        "Imperial Bursaries based on household income",
        "Paid placements can earn £1,000 to £1,500 per month",
        "Unpaid placements may qualify for partial Imperial Bursary"
      ]
    }
  },
  {
    "content": "Imperial College London offers US Federal Direct Loans to eligible students. These include Subsidized Loans, Unsubsidized Loans, and PLUS Loans for parents or graduate students. Students must complete the FAFSA each year and meet certain eligibility requirements. The college has specific deadlines, disbursement dates, and policies around satisfactory academic progress and repayment that students must be aware of. Special circumstances may also be considered for adjustments to cost of attendance or dependency status.",
    "metadata": {
      "title": "US student loans",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/general-support/us-loans",
      "category": "Fees and Funding",
      "subcategory": "US Student Loans",
      "key_points": [
        "Imperial offers US Federal Direct Loans, including Subsidized, Unsubsidized, and PLUS Loans",
        "Students must complete the FAFSA and meet eligibility requirements",
        "Specific deadlines, disbursement dates, and policies on satisfactory academic progress and repayment",
        "Special circumstances may be considered for adjustments to cost of attendance or dependency status"
      ]
    }
  },
  {
    "content": "Imperial students can find information on fees, funding, and managing money as a student in London. This includes a guide to living costs, using Blackbullion for budgeting advice, and money-saving tips.",
    "metadata": {
      "title": "Managing your money",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/managing-your-money",
      "category": "Fees and Funding",
      "subcategory": "Money Management",
      "key_points": [
        "Guide to living costs in London",
        "Blackbullion for budgeting and financial education",
        "Money-saving tips for students in London"
      ]
    }
  },
  {
    "content": "Blackbullion is a digital financial education platform for Imperial students to manage their finances and build a better financial future. It provides learning pathways, budgeting tools, and student finance calculators. Students can access Blackbullion by signing up with their Imperial email and start using the platform at their own pace. The platform also includes the Student Support Fund application and a Money Manager app for students to connect their bank accounts and create a budget. It's important for students to stay alert and follow IT security guidelines.",
    "metadata": {
      "title": "Blackbullion",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/managing-your-money/blackbullion",
      "category": "Fees and Funding",
      "subcategory": "Managing Your Money",
      "key_points": [
        "Blackbullion is a digital financial education platform for Imperial students",
        "It provides learning pathways, budgeting tools, and student finance calculators",
        "Students can access Blackbullion by signing up with their Imperial email",
        "The platform includes the Student Support Fund application and a Money Manager app",
        "Students should stay alert and follow IT security guidelines"
      ]
    }
  },
  {
    "content": "Imperial students are becoming more aware of the growing Gambling and Gaming culture within the UK. Gambling and Gaming can have a detrimental effect on a person's health, relationships, and financial stability, as well as on their loved ones. A survey found that 71% of students have gambled at least once in the past year, with 24% having 'Problem Gambling' behavior. Imperial College London has trained welfare teams, departments, and the Student Financial Support team in Gambling and Gaming awareness to provide support and resources to students. Resources are available from YGAM and GamCare, and NHS treatment is now accessible for those affected by Gambling or Gaming addictions.",
    "metadata": {
      "title": "Gambling and Gaming Awareness",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/managing-your-money/gambling-and-gaming-awareness",
      "category": "Fees and Funding",
      "subcategory": "Managing Your Money",
      "key_points": [
        "Growing gambling and gaming culture among students",
        "Gambling and gaming can have detrimental effects",
        "Survey found 71% of students have gambled in the past year",
        "Imperial College London has trained staff to provide support",
        "Resources available from YGAM, GamCare, and NHS treatment"
      ]
    }
  },
  {
    "content": "Imperial students face ongoing financial pressures due to high inflation in the UK. The Student Financial Support team provides advice and assistance. Living expenses in London vary based on personal circumstances and lifestyle. The estimated weekly, monthly, and 9-month costs cover accommodation, food, travel, and personal/leisure expenses. Additional costs include visa, travel, start-up, and field trip/study visit expenses. Budgeting is crucial for students to manage their finances effectively.",
    "metadata": {
      "title": "Cost of living in London",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/managing-your-money/living-costs",
      "category": "Fees and Funding",
      "subcategory": "Managing your money",
      "key_points": [
        "Living expenses in London vary based on personal circumstances and lifestyle",
        "Estimated costs cover accommodation, food, travel, and personal/leisure expenses",
        "Additional costs include visa, travel, start-up, and field trip/study visit expenses",
        "Budgeting is crucial for students to manage their finances effectively",
        "Imperial's Student Financial Support team provides advice and assistance"
      ]
    }
  },
  {
    "content": "We recognise the ongoing financial pressures on students and their families as inflation remains high in the UK. Our Student Financial Support team are there to provide advice and assistance. Pricing figures represent the 25th, 50th and 75th percentiles of student spending data. Lower, median and upper figures are provided for rent, bills, food, travel, and personal/leisure costs. Accommodation, food, travel, and personal/leisure costs are explained in detail. Planning ahead and estimating costs is the best way to stay in control of your finances. The College provides financial education resources and budgeting tools.",
    "metadata": {
      "title": "Percentile Breakdown",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/managing-your-money/living-costs/percentile-breakdown",
      "category": "fees-and-funding",
      "subcategory": "Managing your money",
      "key_points": [
        "College provides financial advice and assistance",
        "Percentile breakdown of student spending data provided",
        "Detailed explanation of accommodation, food, travel, and personal/leisure costs",
        "College offers financial education and budgeting tools"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Managing your money Money saving tips Travel You can save on fare with a Student Oyster photocard. For transport outside of London, try booking in advance or explore other forms of travel. Walking around London can save fares. You can save on train and tube fares using a 16-25 Railcard. Part time work Part-time work is an option to boost your funds and meet new people. Aim for 10-15 hours per week. Overseas students need to check rules for working in the UK. Consider on-campus jobs or providing online tuition. Discounts Use your College ID for student discounts. Check sites like studentbeans.com and unidays.com. Apple has an Education Store for discounts. Exercise No need for expensive gym memberships. Imperial has on-campus gym options. Food shopping & Cooking Plan a weekly menu, make a list, and cook with friends. Take advantage of supermarket offers and visit local markets. Miscellaneous Buy second-hand books, get discounted haircuts, and look for free events and attractions around London.",
    "metadata": {
      "title": "Money saving tips",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/managing-your-money/money-saving-tips",
      "categories": [
        "Travel",
        "Part time work",
        "Discounts",
        "Exercise",
        "Food shopping & Cooking",
        "Miscellaneous"
      ],
      "key_points": [
        "Use Student Oyster photocard and 16-25 Railcard to save on fares",
        "Consider part-time work, including on-campus jobs and online tutoring",
        "Take advantage of student discounts and deals",
        "Access free or low-cost exercise facilities on campus",
        "Plan meals, cook together, and shop smart for groceries",
        "Buy second-hand books, get discounted haircuts, and explore free local activities"
      ]
    }
  },
  {
    "content": "Millions of people across the UK are scammed every year. Students are highly vulnerable for falling for scams due to them being newly independent, with a high income being paid in large sums from Student Loans and/or Scholarships. Scammers are aware of this information, meaning they will know the best times to target students, particularly at the start of an academic year. It is important for universities to create more awareness surrounding the resources available to not only help stop students from becoming a victim to scams and fraud, but also where to report these.",
    "metadata": {
      "title": "Scams and Fraud Awareness",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/managing-your-money/scams-and-fraud-awareness",
      "category": "Fees and Funding",
      "subcategory": "Managing Your Money",
      "key_points": [
        "Millions of people across the UK are scammed every year",
        "Students are highly vulnerable for falling for scams",
        "Scammers target students, especially at the start of the academic year",
        "Universities should create awareness about resources to prevent and report scams"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Postgraduate funding Postgraduate funding Important fees and funding information for continuing postgraduate students. Scholarships These pages are for applicants considering applying to study a Postgraduate course and are looking for financial support via a Scholarship. Loans and Grants Postgraduate students can apply for Loans and Grants whilst studying.",
    "metadata": {
      "title": "Postgraduate funding",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding",
      "category": "postgraduate",
      "subcategory": "Funding",
      "key_points": [
        "Information for continuing postgraduate students on fees and funding",
        "Scholarships available for postgraduate applicants",
        "Postgraduate students can apply for loans and grants"
      ]
    }
  },
  {
    "content": "Postgraduate students may consider applying for a loan to cover their study costs. Home and EU students can apply for postgraduate loans from the UK Government. You may be eligible to receive some funding for placements if you have chosen to undertake a placement as part of your study.",
    "metadata": {
      "title": "Loans and grants",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/loans-and-grants",
      "category": "Postgraduate",
      "subcategory": "Funding",
      "key_points": [
        "Postgraduate students can apply for loans to cover study costs",
        "Home and EU students can apply for government postgraduate loans",
        "Funding may be available for placements as part of study"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Postgraduate funding Loans and grants Canadian student loans and tax forms Canadian student loans and tax forms Student Loans for Canadian students are available for full-time and part-time study at designated schools, including Imperial. When you apply for a loan, you are considered for funding by both the Provincial and Federal Government, meaning you only have to apply once for funding for the year. Canadian Federal loans are processed via the National Student Loans Service Centre and provincial loans through the provincial governments and student aid branches. How to apply You should apply through your provincial student assistance office or website. The College is not involved in processing your application for a loan, however we can confirm your student status. Tax forms Canadian taxpayers who are studying full-time for a degree are eligible to claim the appropriate percentage of tuition fees paid (subject to certain restrictions) as a tax credit. The parent or guardian of the student is also eligible to claim the transferred portion of tuition fees allowed under the Canadian Income Tax Act. Students are required to submit the Canadian Tax form tl11a-fill-11e to the Canadian Revenue Agency by 30th April of the following year.",
    "metadata": {
      "title": "Canadian student loans and tax forms",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/loans-and-grants/canadian-loans",
      "category": "Postgraduate Funding",
      "subcategory": "Loans and Grants",
      "key_points": [
        "Canadian student loans are available for full-time and part-time study",
        "Funding is provided by both Provincial and Federal Government",
        "Loan applications are processed through the National Student Loans Service Centre and provincial governments",
        "The College can confirm student status but does not process loan applications",
        "Canadian taxpayers can claim tuition fees as a tax credit",
        "Students must submit Canadian Tax form tl11a-fill-11e by April 30th"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Postgraduate funding Loans and grants Funding for placements Turing Scheme funding",
    "metadata": {
      "title": "Funding for placements",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/loans-and-grants/funding-for-placements",
      "category": "postgraduate",
      "subcategory": "Funding",
      "key_points": [
        "Funding available for placements as part of your course",
        "Funding varies depending on your chosen route",
        "Turing Scheme funding also available"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Postgraduate funding Loans and grants Introduction to Postgraduate Borrowing Government backed loans Postgraduate Loan for Master's study Postgraduate Doctoral loans Checklist to ensure loans are affordable and suitable: work out how much you need, check for restrictions on use, availability for your course, who receives the money, repayment options, and any additional fees. Also be aware of guarantor loans and representative examples. If you have a complaint about your lender, contact the Financial Ombudsman Service.",
    "metadata": {
      "title": "Introduction to Postgraduate Borrowing",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/loans-and-grants/introduction-to-postgraduate-borrowing-",
      "category": "Postgraduate Funding",
      "subcategory": "Loans and Grants",
      "key_points": [
        "Understand different types of postgraduate loans and their terms",
        "Determine how much you need to borrow and for what purpose",
        "Check lender requirements and restrictions on loan usage",
        "Be aware of repayment options, fees, and impact on credit",
        "Know your options if you have complaints about your lender"
      ]
    }
  },
  {
    "content": "The Postgraduate Doctoral Loan (PDL) is a loan of up to £29,390 from the UK government for postgraduate doctoral courses beginning in 2024-25. It is not means-tested, so your household income does not matter. You will need to repay the loan based on your income after finishing or leaving your course. The loan can be used towards tuition fees or living costs. There are certain eligibility criteria, such as being a UK, Irish, or EU national with settled or pre-settled status, and being under 60 years old. The loan is paid in three installments during the academic year, and repayments typically start the April after you finish or leave your course.",
    "metadata": {
      "title": "Postgraduate Doctoral loans",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/loans-and-grants/phd-loans",
      "category": "Postgraduate",
      "subcategory": "Funding",
      "key_points": [
        "Loan of up to £29,390 for postgraduate doctoral courses",
        "Not means-tested, can be used for tuition or living costs",
        "Eligibility criteria include nationality, age, and residency",
        "Loan is paid in three installments, repayments start after finishing/leaving course"
      ]
    }
  },
  {
    "content": "The Postgraduate Master's Loan from the UK government is designed to support students who normally live in England, to contribute towards the cost of your postgraduate study. The maximum value of the loan for courses starting on or after 1 August 2024 is £12,471. The loan is not means-tested, and you will not repay it until your income is over a certain amount after you finish your course. The loan can be used towards tuition fees or living costs for all Master's degrees across taught and research programmes. Eligibility depends on your course, age, nationality, and residency status. If you normally live in Scotland, Wales, or Northern Ireland, funding for postgraduate loans is different. You apply through Student Finance England, either online or by post, and only need to apply once even if your Master's is longer than one year.",
    "metadata": {
      "title": "Postgraduate Loan for Master's study",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/loans-and-grants/postgraduate-loan-for-masters-study",
      "category": "Funding",
      "subcategory": "Postgraduate Loan",
      "key_points": [
        "Postgraduate Master's Loan from UK government",
        "Maximum loan value of £12,471 for courses starting after 1 August 2024",
        "Loan is not means-tested and repayment starts when income is over a certain amount",
        "Loan can be used for tuition fees or living costs for any Master's degree",
        "Eligibility depends on course, age, nationality, and residency",
        "Different funding for students in Scotland, Wales, and Northern Ireland",
        "Apply through Student Finance England, only need to apply once"
      ]
    }
  },
  {
    "content": "Home students Fees and funding Postgraduate funding Loans and grants US student loans US student loans Ineligible Courses Global Online MBA Weekend MBA Executive MBA MBBS (clinical medicine programmes) Global Innovation Design (MA/MSc) Healthcare and Design (2YPT) Postgraduate Certificates Postgraduate Diplomas Distance Learning Course Courses which involve study at an ineligible school Contact us if you would like more information. 2024/25 Information Federal Direct Loans are financed by the U.S. Department of Education and assist students with the cost of their studies. Undergraduate students may be eligible for the Subsidized Loan (no interest while in school), Unsubsidized Loan (interest accrues while in school) and the Parent PLUS Loan for parent borrowers. For students in a postgraduate program you have the option of the Unsubsidized Loan and Graduate PLUS Loan. Unfortunately, students studying at a foreign school such as Imperial College London are not eligible for need-based grants such as the Pell Grant. The first step is to complete the Department of Education's 2024-25 Free Application for Federal Student Aid (FAFSA). The School Code for Imperial College London is G11567. In addition to federal loans you may also wish to explore a private loan with Sallie Mae or Earnest.",
    "metadata": {
      "title": "US student loans",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/loans-and-grants/us-loans",
      "categories": [
        "Fees and funding",
        "Postgraduate funding",
        "Loans and grants"
      ],
      "key_points": [
        "Federal Direct Loans are available to assist students with the cost of their studies",
        "Undergraduate students may be eligible for Subsidized, Unsubsidized, and Parent PLUS Loans",
        "Postgraduate students may be eligible for Unsubsidized and Graduate PLUS Loans",
        "Students studying at Imperial College London are not eligible for need-based grants such as the Pell Grant",
        "The first step is to complete the FAFSA, using the Imperial College London school code G11567",
        "Private loans from Sallie Mae or Earnest may also be an option"
      ]
    }
  },
  {
    "content": "Imperial offers a wide range of scholarships to support postgraduate study, including the President's PhD Scholarships and Research Council funded studentships in specific research areas.",
    "metadata": {
      "title": "Scholarships",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/scholarships",
      "category": "Postgraduate Funding",
      "subcategory": "Scholarships",
      "key_points": [
        "Wide range of postgraduate scholarships available",
        "President's PhD Scholarships offer outstanding opportunity",
        "External organizations also offer awards for Imperial students",
        "Scholarships search tool to find all available awards",
        "Research Council funded PhD studentships in specific research areas"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Postgraduate funding Scholarships Further funding opportunities Further funding opportunities Financial Assistance Non- Imperial Scholarships Funding opportunities from external organisations More information Alternative Guide to Funding Funding opportunities from Charities and Trusts More information",
    "metadata": {
      "title": "Further funding opportunities",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/scholarships/further-funding-opportunities-",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Funding",
      "key_points": [
        "Scholarships",
        "Financial Assistance",
        "External Funding Opportunities",
        "Alternative Funding Sources"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Postgraduate funding Scholarships Further funding opportunities Alternative Guide to Funding Alternative Guide to Funding Scholarships Search Tool Register for the Alternative Guide to Postgraduate Funding Charities are an under- utilised source of funding for education but can be used by both undergraduates and postgraduates to top up the money you have already raised by £500- £2,000. Funding opportunities from charities are accessible by completing the form below to access the Alternative Guide to Postgraduate Funding Online gateway. The College has no direct involvement in these awards – we provide this data for information purposes only. If you are a current Imperial College student you can use your Imperial email address to login to the Alternative Guide to Postgraduate Funding Online gateway.",
    "metadata": {
      "title": "Alternative Guide to Funding",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/scholarships/further-funding-opportunities-/alternative-guide-to-funding",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Funding",
      "key_points": [
        "Charities are an under-utilized source of funding for education",
        "Can be used by undergraduates and postgraduates to top up existing funding",
        "Funding opportunities accessible through the Alternative Guide to Postgraduate Funding Online gateway",
        "Imperial College has no direct involvement in these awards, but provides the information"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Postgraduate funding Scholarships Further funding opportunities Non-Imperial scholarships. A growing number of external organisations offer scholarships, helping you complete your studies. Our scholarships search tool allows you to search all the scholarships we administer. There are also many external scholarships and awards you can apply for.",
    "metadata": {
      "title": "Non-Imperial scholarships",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/scholarships/further-funding-opportunities-/external-awards",
      "category": "Fees and Funding",
      "subcategory": "External Scholarships",
      "key_points": [
        "External organizations offer scholarships to help students complete their studies",
        "Imperial's scholarships search tool allows you to search all the scholarships they administer",
        "There are many external scholarships and awards students can apply for"
      ]
    }
  },
  {
    "content": "Home\nImperial students\nFees and funding\nPostgraduate funding\nScholarships\nResearch Council studentships (PhD)\nUK Research Council awards for Home/EU students\nEU Fee Rates from 2021\nEligibility\nAcademic qualifications\nPrevious postgraduate training\nApplication procedure",
    "metadata": {
      "title": "Research Council studentships (PhD)",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/postgraduate-funding/scholarships/rcuk",
      "categories": [
        "postgraduate",
        "funding",
        "scholarships",
        "research council",
        "PhD"
      ],
      "key_points": [
        "UK Research Councils provide funding for PhD students",
        "EU nationals are eligible for fee support only from 2021",
        "Eligibility criteria include residence requirements and academic qualifications",
        "Previous postgraduate training may affect the duration of the studentship",
        "Application process involves departmental nomination, not direct applications"
      ]
    }
  },
  {
    "content": "Compliance with Imperial's Tuition Fee Policy is part of your contractual obligations. Find info on undergraduate and postgraduate tuition fees.",
    "metadata": {
      "title": "Tuition fees",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees",
      "category": "Fees and Funding",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Tuition Fee Policy is contractual obligation",
        "Information on undergraduate and postgraduate tuition fees"
      ]
    }
  },
  {
    "content": "Imperial College London will not issue a CAS until you've accepted an unconditional offer and uploaded your passport details. Your CAS will reflect any tuition fee payments made before it was issued. For additional payments, contact your admissions team. The Home Office requires you to demonstrate ability to pay the full first year's fees at the time of your visa application. Sponsored students should provide a formal sponsorship letter. Loan-funded students need to provide the loan agreement.",
    "metadata": {
      "title": "CAS and Visas",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/cas-and-visas",
      "category": "Fees and Funding",
      "subcategory": "CAS and Visas",
      "key_points": [
        "Imperial won't issue a CAS until you accept offer and upload passport",
        "CAS will reflect payments made before it was issued",
        "Contact admissions team for additional payments",
        "Home Office requires ability to pay full first year's fees",
        "Sponsored students need formal sponsorship letter",
        "Loan-funded students need loan agreement"
      ]
    }
  },
  {
    "content": "Imperial College London offers two schemes for discounted tuition fees for its staff: the tuition fee remission scheme for staff registering for a part-time degree, and staff-student fees for staff employed as Research Assistants or equivalent. Eligibility requirements include minimum service, contract duration, and departmental approval. The remission scheme provides a two-thirds discount on the relevant Home fee, while the staff-student fees are one-third of the Home fee. Leaving the college within 24 months of completing the program may require repayment of the discount.",
    "metadata": {
      "title": "Discounts for College employees",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/discounts-for-college-employees",
      "category": "Fees and Funding",
      "subcategory": "Tuition fees",
      "key_points": [
        "Two schemes: tuition fee remission and staff-student fees",
        "Eligibility requirements include minimum service, contract duration, and departmental approval",
        "Tuition fee remission scheme provides two-thirds discount on Home fee",
        "Staff-student fees are one-third of Home fee",
        "Leaving college within 24 months may require repayment of discount"
      ]
    }
  },
  {
    "content": "Home - Imperial students - Fees and funding - Tuition fees - Fee status - What does fee status mean? - Who pays home fees in England? - How do I appeal a fee status decision? - I'm applying for a second degree - will this affect my fee status?",
    "metadata": {
      "title": "Fee status",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/fee-status",
      "categories": [
        "Fees and Funding",
        "Tuition Fees",
        "Fee Status"
      ],
      "key_points": [
        "Fee status determines whether you pay home or overseas tuition rates",
        "Nationality alone does not determine eligibility for home fees",
        "There are specific frameworks for eligibility, including immigration permissions",
        "It's not possible to change fee status once enrolled, but you can appeal",
        "Studying for an equivalent or lower qualification may affect fee status"
      ]
    }
  },
  {
    "content": "You are responsible for making arrangements to ensure your fees are paid, whether through sponsorship or paying them yourself. It is your responsibility to inform the College of any sponsorship or fees award. If a sponsor fails to pay, liability for the unpaid fees will be transferred to you. Tuition fees payment terms are reviewed, updated and published prior to the start of each academic year. Invoices are issued via email and you may face penalties for not paying on time. You can find information about the fees you have to pay, and the payment terms, on the College's website.",
    "metadata": {
      "title": "Tuition fees payment terms",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/payment-terms",
      "category": "Fees and Funding",
      "subcategory": "Tuition Fees",
      "key_points": [
        "You are responsible for paying your tuition fees",
        "You must inform the College of any sponsorship or fees award",
        "Unpaid fees by a sponsor will be your responsibility",
        "Payment terms are reviewed and published annually",
        "Invoices are issued by email and late payments may incur penalties",
        "Fee information and payment details are available on the College website"
      ]
    }
  },
  {
    "content": "Imperial has partnered with online payment platforms Convera and Flywire to offer secure and convenient payment options for tuition fees. Students can pay via various methods including bank transfer, credit/debit cards, and e-wallets. Home students can apply for government loans to cover tuition fees. Sponsored students must have their sponsorship formally confirmed before the payment deadline. Late payment fees apply if deadlines are missed. Students should beware of scams and only use official Imperial payment methods.",
    "metadata": {
      "title": "How to pay",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/payment-terms/how-to-pay",
      "category": "Fees and Funding",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Imperial partners with Convera and Flywire for online payments",
        "Multiple payment options available including bank transfer, cards, e-wallets",
        "Home students can apply for government loans to cover tuition fees",
        "Sponsored students must have sponsorship confirmed before payment",
        "Late payment fees apply for missed deadlines",
        "Beware of scams, use only official Imperial payment methods"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Tuition fees payment terms How to pay Scam warnings Scam warnings Applicants and students at UK institutions may be targeted scam run by individuals or a group. It's important to be aware of the types of scams being run. Examples of scams Discounted Tuition Fees You may be contacted by a person or organisation who is offering to pay for your Tier 4 Visa, Tuition Fee Deposit or Tuition Fees at a discounted rate, and in return will be asked to pay the fraudsters directly for this service. This could be advertised as either a one-off discount or an extremely generous exchange rate. The payments these fraudsters make for fees will be made via compromised card details which are later recalled by the original card holder as a charge back, leaving the applicant or student with an outstanding amount as well as the loss of money paid to the scammers. You may be shown a receipt or asked to log into your portal as evidence of payment however once the payment is recalled this proof of payment is no longer valid. Please always use a trusted source when making payment. Imperial College London's preferred payment methods can be found on our How to pay page. If you have any questions about this scam, or suspect you may have been targeted, please contact our Accounts Receivable team at studentpay.queries@imperial.ac.uk. Fraudulent Bank Details Imperial College has been made aware of a new scam targeting our students. This involves a fraudulent invoice from an email address similar to ours (e.g. imperiai.ac.uk with a capital \"i\" instead of \"l\" at the end of \"imperiai\") being issued with different bank details to our own. If possible, please pay by card or e-payment, or if you need to pay by bank transfer, always validate the details against our How to pay page first or contact studentpay.queries@imperial.ac.uk for confirmation. More scam examples Please visit our Visa and Immigrations Scam page for further examples of fraud that ca...",
    "metadata": {
      "title": "Scam warnings",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/payment-terms/how-to-pay/scams",
      "category": "Fees and Funding",
      "subcategory": "Scams",
      "key_points": [
        "Beware of scams targeting applicants and students",
        "Examples include discounted tuition fees and fraudulent bank details",
        "Always use trusted sources when making payments",
        "Contact the Accounts Receivable team if you suspect a scam"
      ]
    }
  },
  {
    "content": "Imperial College London requires a deposit for applicants to research masters (MRes) and taught postgraduate courses, except for students with confirmed full sponsorship or eligible for US Federal Aid. The deposit is typically 10% of the total fee for the first year of the course. The deposit must be paid within 30 days of receiving the invoice, and failure to do so may result in the offer being withdrawn. Deposits are generally non-refundable, but there are some exceptions, such as if the applicant fails to meet the academic conditions of the offer or is refused a visa. Applicants can request an extension to the deposit deadline or a refund under exceptional or extreme mitigating circumstances.",
    "metadata": {
      "title": "Postgraduate application deposit information",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/payment-terms/pg-deposit",
      "category": "Fees and funding",
      "subcategory": "Postgraduate application deposit",
      "key_points": [
        "Deposit required for research masters and taught postgraduate courses",
        "Deposit is typically 10% of the total fee for the first year",
        "Deposit must be paid within 30 days or offer may be withdrawn",
        "Deposits are generally non-refundable, with some exceptions",
        "Applicants can request extensions or refunds under certain circumstances"
      ]
    }
  },
  {
    "content": "University life will be different from previous experiences. You will live with people from around the world, take responsibility for your own education and self-care. Be aware of expectations and opportunities.",
    "metadata": {
      "title": "Information for postgraduate students",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/payment-terms/postgraduates",
      "category": "Postgraduate",
      "subcategory": "Fees and Funding",
      "key_points": [
        "University life is different from previous experiences",
        "You'll live with people from around the world",
        "Take responsibility for your education and self-care",
        "Be aware of expectations and opportunities"
      ]
    }
  },
  {
    "content": "Home/EU undergraduate students will be able to specify whether or not they have applied or intend to apply for a Tuition Fee Loan from the Student Loans Company (SLC) or an NHS Bursary when they register online. Self-funding students will receive an invoice shortly after registering. Students may pay fees in two installments, with the first due on September 1 or within 30 days, and the second due on March 1. Sponsored students must provide proof of sponsorship before enrolling. Refunds are available for students who interrupt or withdraw from their course, calculated on a pro-rata basis.",
    "metadata": {
      "title": "Information for undergraduate students",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/payment-terms/undergraduates",
      "categories": [
        "Tuition Fees",
        "Payment Options",
        "Sponsorship",
        "Refunds"
      ],
      "key_points": [
        "Home/EU students can apply for SLC loans or NHS bursaries",
        "Self-funding students receive invoices and can pay in two installments",
        "Sponsored students must provide proof of sponsorship before enrolling",
        "Refunds available for students who interrupt or withdraw, calculated pro-rata"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Postgraduate tuition fees Please note that unless otherwise stated, tuition fees are subject to annual inflationary uplifts and are charged by year of entry to the College and not year of study. Fees are charges at two different rates, the Home rate and the non-Home rate. Students requiring a Student visa will require a Confirmation of Acceptance for Studies (CAS). All students are bound by the College's payment terms for tuition fees.",
    "metadata": {
      "title": "Postgraduate tuition fees",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Tuition fees are subject to annual inflationary uplifts",
        "Fees are charged at Home and non-Home rates",
        "Students requiring a visa need a Confirmation of Acceptance for Studies (CAS)",
        "All students must follow the College's payment terms"
      ]
    }
  },
  {
    "content": "Imperial students need to be aware of tuition fees, which vary by study level and year of entry. Postgraduate students may be eligible for UK government funding, while some research programs have fees set by UKRI that increase annually. All student fees are subject to an annual inflation-based increase, with a cap of 8% for 2023-24. Students should consult the College's Tuition Fee Policy and contact the College if they have any questions.",
    "metadata": {
      "title": "2023-24",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Tuition fees vary by study level and year of entry",
        "Postgraduate students may be eligible for UK government funding",
        "Some research programs have UKRI-set fees that increase annually",
        "All fees are subject to an 8% cap on annual inflation-based increases",
        "Students should consult the College's Tuition Fee Policy and contact the College with any questions"
      ]
    }
  },
  {
    "content": "Postgraduate research master's programs at Imperial College London have tuition fees set for the year of entry, not the year of study. The Home fees for some programs are set at the United Kingdom Research and Innovation (UKRI) rate, which increases annually by an amount linked to inflation. Fees for other continuing students also increase annually based on the average percentage change in the CPI. Due to exceptional inflationary pressure, the College has reduced the maximum inflationary increase for 2023-24 from 10.0% to 8.0% rounded to the nearest £50. Fees are also capped at the new-entrant fee for that session, so continuing students may see a smaller increase. The fees are listed by faculty and department, and students should refer to the College's Tuition Fee Policy for more information.",
    "metadata": {
      "title": "Postgraduate Research Masters (MRes) Programmes",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/mres",
      "category": "Tuition Fees",
      "subcategory": "Postgraduate Research Masters",
      "key_points": [
        "Fees set by year of entry, not year of study",
        "Some fees set at UKRI rate, which increases annually with inflation",
        "Other fees increase annually based on CPI, capped at 8% for 2023-24",
        "Fees also capped at new-entrant level for that session",
        "Fees listed by faculty and department"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2023-24 Postgraduate Research Masters (MRes) Programmes Faculty of Engineering Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2023-24 academic session. To find the fee for your programme, please choose your department from the boxes below. The fees for all continuing postgraduate research master's students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. Due to the exceptional inflationary pressure currently being faced by the United Kingdom, the College has reduced the maximum inflationary increase for 2023-24 from 10.0% to 8.0% rounded to the nearest £50.00. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. Except where otherwise indicated, the fees for continuing or resuming students will increase annually by an amount linked to inflation as above; the fee paid for subsequent years of study may be higher than the fee listed here. All students are bound by the College's Tuition Fee Policy which is available here. If you have any questions regarding tuition fees, please search our FAQs on the College Knowledge Bank (ServiceNow, College log on required), if you still have questions after this, you can raise a ticket with us via ServiceNow or via the contact links at the top of this page if you do not have a College IT account.",
    "metadata": {
      "title": "Faculty of Engineering",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/mres/faculty-of-engineering",
      "departments": [
        {
          "name": "Department of Bioengineering",
          "entry_cohort": {
            "2023": {
              "home_and_ireland": {
                "ft": 16600,
                "pt": "N/A"
              },
              "overseas": {
                "ft": 38600,
                "pt": "N/A"
              }
            }
          }
        },
        {
          "name": "Department of Computing",
          "entry_cohort": {
            "2023": {
              "home_and_ireland": {
                "ft": 20300,
                "pt": "N/A"
              },
              "overseas": {
                "ft": 42600,
                "pt": "N/A"
              }
            }
          }
        },
        {
          "name": "Dyson School of Design Engineering",
          "entry_cohort": {
            "2023": {
              "home_and_ireland": {
                "ft": 16600,
                "pt": "N/A"
              },
              "overseas": {
                "ft": 38600,
                "pt": "N/A"
              }
            }
          }
        },
        {
          "name": "Institute for Molecular Science and Engineering",
          "entry_cohort": {
            "2023": {
              "home_and_ireland": {
                "ft": 16600,
                "pt": "N/A"
              },
              "overseas": {
                "ft": 38600,
                "pt": "N/A"
              }
            }
          }
        },
        {
          "name": "Department of Materials",
          "entry_cohort": {
            "2023": {
              "home_and_ireland": {
                "ft": 16600,
                "pt": "N/A"
              },
              "overseas": {
                "ft": 38600,
                "pt": "N/A"
              }
            }
          }
        }
      ]
    }
  },
  {
    "content": "Imperial students can find information on postgraduate tuition fees for the 2023-24 academic session, including fees for MRes programmes in the Faculty of Medicine. Fees are charged by year of entry and may increase annually based on inflation, with a maximum increase of 8% for 2023-24. Continuing students may pay less than the maximum increase. Fees vary by programme, entry cohort, and whether the student is classified as Home/Ireland or Overseas.",
    "metadata": {
      "title": "Faculty of Medicine",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/mres/faculty-of-medicine",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Postgraduate tuition fees for 2023-24 academic session",
        "Fees vary by programme, entry cohort, and Home/Overseas status",
        "Fees may increase annually based on inflation, with a max 8% increase for 2023-24",
        "Continuing students may pay less than the maximum increase"
      ]
    }
  },
  {
    "content": "Imperial College London offers various postgraduate research master's (MRes) programmes in the Faculty of Natural Sciences, with tuition fees for the 2023-24 academic session. Fees are charged by year of entry and increase annually based on inflation, with a maximum increase of 8% for 2023-24. Fees vary depending on the department and program, with home/Ireland and overseas student rates listed. Part-time options are also available for some programs.",
    "metadata": {
      "title": "Faculty of Natural Sciences",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/mres/faculty-of-natural-sciences",
      "category": "Postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Various MRes programmes offered in the Faculty of Natural Sciences",
        "Tuition fees for 2023-24 academic session",
        "Fees charged by year of entry, with annual inflation-based increases",
        "Difference in fees for home/Ireland and overseas students",
        "Part-time options available for some programmes"
      ]
    }
  },
  {
    "content": "Imperial College Business School fees for 2023-24 academic session, including information on UKRI rates and annual increases for continuing students.",
    "metadata": {
      "title": "Imperial College Business School",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/mres/imperial-college-business-school",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "UKRI rate for postgraduate research master's programmes in the Business School",
        "Annual increase for continuing students linked to inflation, capped at 8% for 2023-24",
        "Fees for 2023-24 cohort: £4,712 (Home/Ireland), £17,500 (Overseas)"
      ]
    }
  },
  {
    "content": "Imperial College London provides detailed information on postgraduate research programme fees for the 2023-24 academic year. The fees are categorized by faculty and department, with the Home fees for some programmes set at the UKRI rate. Fees for continuing students may increase annually based on inflation, with a maximum increase of 8% for 2023-24. Students who started before September 2022 have their fees charged pro rata, while those who started in or after September 2022 are charged the full first-year fees upon commencement. All students are bound by the College's Tuition Fee Policy, and any questions can be addressed through the College's Knowledge Bank or by raising a ticket.",
    "metadata": {
      "title": "Postgraduate Research Programmes",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/postgraduate-research-programmes",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Detailed information on postgraduate research programme fees for 2023-24",
        "Fees categorized by faculty and department, with some at the UKRI rate",
        "Continuing student fees may increase annually up to 8% due to inflation",
        "Fees charged differently for students starting before and after September 2022",
        "All students bound by the College's Tuition Fee Policy"
      ]
    }
  },
  {
    "content": "Imperial College London's postgraduate tuition fees for the 2023-24 academic session, including fees for the Centre for Languages, Culture and Communication. Fees vary by entry cohort and student status (Home/Ireland or Overseas). Fees for continuing students may increase annually based on inflation measures.",
    "metadata": {
      "title": "Centre for Languages, Culture and Communication",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/postgraduate-research-programmes/centre-for-languages-culture-and-communication",
      "category": "Postgraduate Fees",
      "subcategory": "Centre for Languages, Culture and Communication",
      "key_points": [
        "Postgraduate tuition fees for 2023-24 academic session",
        "Fees vary by entry cohort and student status (Home/Ireland or Overseas)",
        "Fees for continuing students may increase annually based on inflation",
        "Students paying Home rate charged UKRI fee if started before Sep 2021",
        "Part-time students charged half the full-time fee"
      ]
    }
  },
  {
    "content": "Postgraduate tuition fees for the 2023-24 academic session at the Crick Institute. Fees are charged by year of entry, not year of study. Continuing students have fees that increase annually based on inflation. New-entrant fees are provided for various research areas.",
    "metadata": {
      "title": "Crick Institute",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/postgraduate-research-programmes/crick-institute",
      "category": "Postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees charged by year of entry, not year of study",
        "Continuing student fees increase annually based on inflation",
        "New-entrant fees provided for various research areas",
        "Part-time students charged half the full-time fee"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2023-24 Postgraduate Research Programmes Faculty of Engineering Faculty of Engineering. Fees are charged by year of entry, not year of study. Fees for students commencing before Sep 2022 are pro-rated, while those after Sep 2022 are billed in full. Fees for UKRI students increase annually by GDP deflator, while other students increase by CPI. Except where indicated, fees will increase annually by inflation. All students are bound by the College's Tuition Fee Policy.",
    "metadata": {
      "title": "Faculty of Engineering",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/postgraduate-research-programmes/faculty-of-engineering",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Fees charged by year of entry, not year of study",
        "Pro-rated fees for students before Sep 2022, full fees after",
        "UKRI students increase by GDP deflator, others by CPI",
        "Fees generally increase annually by inflation",
        "Students bound by College's Tuition Fee Policy"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2023-24 Postgraduate Research Programmes Faculty of Medicine Faculty of Medicine Fees for students in 2023-24 academic session. Fees for students starting before and after Sept 2022 differ. Fees increase annually based on inflation measures.",
    "metadata": {
      "title": "Faculty of Medicine",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/postgraduate-research-programmes/faculty-of-medicine",
      "category": "Postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees for 2023-24 academic session",
        "Difference in fees for students starting before and after Sept 2022",
        "Fees increase annually based on inflation"
      ]
    }
  },
  {
    "content": "Postgraduate research program fees for the Faculty of Natural Sciences at Imperial College London for the 2023-24 academic session. Fees are charged by year of entry, not year of study, and will increase annually based on inflation measures. Part-time students are charged half the full-time fee.",
    "metadata": {
      "title": "Faculty of Natural Sciences",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/postgraduate-research-programmes/faculty-of-natural-sciences",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Fees will increase annually based on inflation measures",
        "Part-time students are charged half the full-time fee",
        "Fees for different departments and entry cohorts are provided"
      ]
    }
  },
  {
    "content": "Home\nImperial students\nFees and funding\nTuition fees\nPostgraduate tuition fees\n2023-24\nPostgraduate Research Programmes\nImperial College Business School\nPlease note that fees are charged by year of entry to the College and not year of study. The fees listed are for students in the 2023-24 academic session. Students that commenced their studies before 1 September 2022 were billed their first year's fees pro rata, while those that commenced on or after 1 September 2022 are billed their first year's fees in full. Fees for continuing students will increase annually by an amount linked to inflation, capped at 8% for 2023-24.",
    "metadata": {
      "title": "Imperial College Business School",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/postgraduate-research-programmes/imperial-college-business-school",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not study year",
        "Fees for 2023-24 academic session",
        "Billing methods differ for students before and after Sept 2022",
        "Continuing student fees increase annually with inflation, capped at 8% for 2023-24"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2023-24 Taught Postgraduate Programmes Taught Postgraduate Programmes Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2023-24 academic session. To find the fee for your programme, please choose your faculty from the boxes below. The fees for all continuing taught postgraduate students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. Due to the exceptional inflationary pressure currently being faced by the United Kingdom, the College has reduced the maximum inflationary increase for 2023-24 from 10.0% to 8.0% rounded to the nearest £50.00. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. All students are bound by the College's Tuition Fee Policy which is available here. If you have any questions regarding tuition fees, please search our FAQs on the College Knowledge Bank (ServiceNow, College log on required), if you still have questions after this, you can raise a ticket with us via ServiceNow or via the contact links at the top of this page if you do not have a College IT account. Tuition fees by Faculty Faculty of Engineering fees Covering programmes in the following branches of engineering: - Aeronautical - Bioengineering - Chemical - Civil and Environmental - Computing - Design - Earth Science - Electrical and Electronic - Materials - Mechanical See the 2023–24 fees for Engineering courses Faculty of Medicine fees Covering PG Cert, PG Dip and MSc programmes in the Faculty of Medicine. See the 2023–24 fees for Medicine courses Faculty of Natural Sciences fees Covering programmes in the: - Centre...",
    "metadata": {
      "title": "Taught Postgraduate Programmes",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/taught-postgraduate-programmes",
      "category": "Postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not study year",
        "Fees for 2023-24 academic session",
        "Continuing students' fees increase by average CPI",
        "Increase capped at 8% for 2023-24 due to inflation",
        "Fees vary by faculty and program"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2023-24 Taught Postgraduate Programmes Centre for Languages, Culture and Communication Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2023-24 academic session. The fees for all continuing taught postgraduate students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. Due to the exceptional inflationary pressure currently being faced by the United Kingdom, the College has reduced the maximum inflationary increase for 2023-24 from 10.0% to 8.0% rounded to the nearest £50.00. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. Except where otherwise indicated, the fees for continuing or resuming students will increase annually by an amount linked to inflation as above; the fee paid for subsequent years of study may be higher than the fee listed here. All students are bound by the College's Tuition Fee Policy which is available here. If you have any questions regarding tuition fees, please search our FAQs on the College Knowledge Bank (ServiceNow, College log on required), if you still have questions after this, you can raise a ticket with us via ServiceNow or via the contact links at the top of this page if you do not have a College IT account.",
    "metadata": {
      "title": "Centre for Languages, Culture and Communication",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/taught-postgraduate-programmes/centre-for-languages-culture-and-communication",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Continuing student fees increase annually by CPI inflation, up to 8% for 2023-24",
        "Continuing student fees are capped at the new-entrant fee for that session",
        "All students are bound by the College's Tuition Fee Policy",
        "Inquiries about tuition fees should be directed to the College Knowledge Bank or ServiceNow"
      ]
    }
  },
  {
    "content": "University fees and funding information for the Faculty of Engineering at Imperial College London, including tuition fees for various postgraduate programs in 2023-24.",
    "metadata": {
      "title": "Faculty of Engineering",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/taught-postgraduate-programmes/faculty-of-engineering",
      "category": "postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Continuing students' fees will increase annually by the average CPI change",
        "Fees for specific departments and programs are listed",
        "Fees for MA/MSc Innovation Design Engineering and MA/MSc Global Innovation Design are set by the Royal College of Art"
      ]
    }
  },
  {
    "content": "Home\nImperial students\nFees and funding\nTuition fees\nPostgraduate tuition fees\n2023-24\nTaught Postgraduate Programmes\nFaculty of Medicine\nFaculty of Medicine\nPlease note that fees are charged by year of entry to the College and not year of study.  The fees listed within this section are for students in the 2023-24 academic session.  To find the fee for your programme, please choose your department from the boxes below.\nThe fees for all continuing taught postgraduate students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies.  Due to the exceptional inflationary pressure currently being faced by the United Kingdom, the College has reduced the maximum inflationary increase for 2023-24 from 10.0% to 8.0% rounded to the nearest £50.00.  Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount.\nExcept where otherwise indicated, the fees for continuing or resuming students will increase annually by an amount linked to inflation as above, this includes students on modular programmes; the fee paid for subsequent years of study may be higher than the fee listed here.\nModular tuition fees explained:\nIn order to provide a flexible offer for students, many of our Master’s-level programmes have entry points at postgraduate certificate (PGCert) and/or postgraduate diploma (PGDip) level as well as full master’s level. In these cases, the fees for the PGCert and PGDip are calculated as a proportion of the full master’s fee.  Unless otherwise stated, the standard calculation is that a PGCert is charged at 50% and a PGDip at 80% of the rate of the full master’s degree.\nStudents undertaking a PGDip over two years will be charged the PGCert fee in year one and the balance of the PGDip fee (the PGCert-PGD...",
    "metadata": {
      "title": "Faculty of Medicine",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/taught-postgraduate-programmes/faculty-of-medicine"
    }
  },
  {
    "content": "Home\nImperial students\nFees and funding\nTuition fees\nPostgraduate tuition fees\n2023-24\nTaught Postgraduate Programmes\nFaculty of Natural Sciences\nFaculty of Natural Sciences\nPlease note that fees are charged by year of entry to the College and not year of study.  The fees listed within this section are for students in the 2023-24 academic session.  To find the fee for your programme, please choose your department from the boxes below.\nThe fees for all continuing taught postgraduate students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies.  Due to the exceptional inflationary pressure currently being faced by the United Kingdom, the College has reduced the maximum inflationary increase for 2023-24 from 10.0% to 8.0% rounded to the nearest £50.00.  Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount.",
    "metadata": {
      "title": "Faculty of Natural Sciences",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/taught-postgraduate-programmes/faculty-of-natural-sciences",
      "category": "Postgraduate Tuition Fees",
      "subcategory": "Faculty of Natural Sciences",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Continuing student fees will increase annually by CPI change, capped at 8% for 2023-24",
        "Fees for 2023-24 academic session are listed"
      ]
    }
  },
  {
    "content": "Imperial College Business School offers various Postgraduate programs with tuition fees for the 2023-24 academic session. Fees are charged by year of entry to the College and not year of study. The fees are set on a whole-program basis, and the fees for continuing students will not be subject to any inflationary uplifts. Programmes include MBA, MSc, and other options, with varying fees for Home/Ireland and Overseas students, as well as Full-Time and Part-Time modes.",
    "metadata": {
      "title": "Imperial College Business School",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2023-24/taught-postgraduate-programmes/imperial-college-business-school",
      "category": "Postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Tuition fees for 2023-24 academic session",
        "Fees charged by year of entry, not year of study",
        "Fees set on a whole-program basis, no inflationary uplifts",
        "Different fees for Home/Ireland and Overseas students",
        "Full-Time and Part-Time modes available"
      ]
    }
  },
  {
    "content": "Imperial students can find information on tuition fees for 2024-25, including details on postgraduate programs, UKRI rates, and annual inflation increases. Fees are charged by year of entry, not year of study, and vary based on study level and student status (e.g., EU students starting after 2021 vs. before). The college's tuition fee policy provides additional guidance, and students can search the knowledge bank or raise a ticket for any fee-related questions.",
    "metadata": {
      "title": "2024-25",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Tuition fees for 2024-25 academic session",
        "Fees vary by study level (PG Cert, PG Dip, MSc, etc.) and student status (e.g., EU students)",
        "UKRI rate for some postgraduate research programs, with annual inflation-linked increases",
        "All other PG fees increase annually by CPI inflation",
        "Continuing student fees capped at new-entrant rate",
        "College's tuition fee policy provides guidance, and students can search knowledge bank or raise a ticket for questions"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Postgraduate Research Masters (MRes) Programmes Postgraduate Research Masters (MRes) Programmes. Fees are charged by year of entry, not year of study. The Home fees for some programmes are set at the UKRI rate and will increase annually by an amount linked to inflation. Fees for continuing students will increase annually by the average CPI change from the previous April to March. All students are bound by the College's Tuition Fee Policy.",
    "metadata": {
      "title": "Postgraduate Research Masters (MRes) Programmes",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/mres",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Home fees for some programmes set at UKRI rate, increase annually with inflation",
        "Continuing student fees increase annually by average CPI change",
        "All students bound by College's Tuition Fee Policy"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Postgraduate Research Masters (MRes) Programmes Faculty of Engineering Faculty of Engineering Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2024-25 academic session. To find the fee for your programme, please choose your faculty from the boxes below. The fees for all continuing taught postgraduate students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. The inflation increase for 2024-25 fees is 5.7% rounded to the nearest £50.00. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. Except where otherwise indicated, the fees for continuing or resuming students will increase annually by an amount linked to inflation as above; the fee paid for subsequent years of study may be higher than the fee listed here. All students are bound by the College's Tuition Fee Policy which is available here. If you have any questions regarding tuition fees, please search our FAQs on the College Knowledge Bank (ServiceNow, College log on required), if you still have questions after this, you can raise a ticket with us via ServiceNow or via the contact links at the top of this page if you do not have a College IT account.",
    "metadata": {
      "title": "Faculty of Engineering",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/mres/faculty-of-engineering",
      "categories": [
        "postgraduate",
        "tuition fees",
        "faculty of engineering"
      ],
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Fees for continuing students will increase annually by CPI, capped at new-entrant fee",
        "Students are bound by the College's Tuition Fee Policy",
        "Questions can be answered via College Knowledge Bank or by raising a ticket"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Postgraduate Research Masters (MRes) Programmes Faculty of Medicine... Fees are charged by year of entry to the College and not year of study. Fees will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences. The inflation increase for 2024-25 fees is 5.7% rounded to the nearest £50.00. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount.",
    "metadata": {
      "title": "Faculty of Medicine",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/mres/faculty-of-medicine",
      "category": "Postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not study year",
        "Fees will increase annually by CPI average from April to March",
        "2024-25 fees increase by 5.7% rounded to nearest £50",
        "Continuing student fees capped at new-entrant fee"
      ]
    }
  },
  {
    "content": "Fees for postgraduate research masters (MRes) programs in the Faculty of Natural Sciences at Imperial College London for the 2024-25 academic session. Fees vary by department, program, entry cohort, and student status (home/overseas, full-time/part-time). Fees for continuing students will increase annually based on the average percentage change in the CPI from the previous year, up to the new-entrant fee for that session.",
    "metadata": {
      "title": "Faculty of Natural Sciences",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/mres/faculty-of-natural-sciences",
      "department": [
        "Department of Chemistry",
        "Department of Life Sciences",
        "Department of Physics"
      ],
      "programs": [
        "MRes Molecular and Cellular Biosciences",
        "MRes Molecular Plant and Microbial Sciences",
        "MRes Structural Molecular Biology",
        "MRes Systems and Synthetic Biology",
        "MRes Tropical Forest Ecology",
        "MRes Photonics",
        "MRes Plastic Electronic Materials",
        "MRes Machine Learning and Big Data in the Physical Sciences"
      ],
      "fees": {
        "entry_cohort": [
          "2024 Cohort",
          "2023 Cohort",
          "2022 Cohort"
        ],
        "home_and_ireland": {
          "full_time": [
            "£14,650.00",
            "£15,150.00",
            "£15,800.00",
            "£20,550.00"
          ],
          "part_time": [
            "£7,325.00",
            "£7,575.00",
            "£9,375.00",
            "N/A"
          ]
        },
        "overseas": {
          "full_time": [
            "£40,500.00",
            "£37,100.00",
            "£35,600.00",
            "£40,800.00"
          ],
          "part_time": [
            "£20,250.00",
            "£15,300.00",
            "£17,150.00",
            "N/A"
          ]
        }
      }
    }
  },
  {
    "content": "Postgraduate tuition fees for Imperial College Business School programs in 2024-25 academic session. Fees for home/Ireland students are £4,786 and for overseas students are £18,000. Fees for continuing students may increase annually by the average percentage change in the CPI (5.7% for 2024-25) rounded to the nearest £50, but are capped at the new-entrant fee for that session.",
    "metadata": {
      "title": "Imperial College Business School",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/mres/imperial-college-business-school",
      "category": "Postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Postgraduate tuition fees for 2024-25 academic session",
        "Home/Ireland students fee: £4,786",
        "Overseas students fee: £18,000",
        "Continuing students fees may increase annually by CPI (5.7% for 2024-25), capped at new-entrant fee"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Postgraduate Research Programmes Postgraduate Research Programmes Please note that fees are charged by year of entry to the College and not year of study. The fees listed are for students in the 2024-25 academic session. To find the fee for your programme, please choose your faculty from the boxes below. The Home fees for some postgraduate research programmes are set at the United Kingdom Research and Innovation (UKRI) rate, this is clearly noted on the relevant fee tables; these fees will increase annually by an amount linked to inflation (currently, the measure is the GDP deflator), this includes students returning from an interruption of studies. Fees for subsequent years of study may be higher than the fees listed here. The fees for all other continuing postgraduate research students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount.",
    "metadata": {
      "title": "Postgraduate Research Programmes",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/postgraduate-research-programmes",
      "categories": [
        "Fees and Funding",
        "Tuition Fees",
        "Postgraduate Tuition Fees",
        "Postgraduate Research Programmes"
      ],
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "UKRI-set fees will increase annually with inflation",
        "Other fees will increase annually by CPI change",
        "Continuing student fees are capped at new-entrant level"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Postgraduate Research Programmes Centre for Languages, Culture and Communication Please note that fees are charged by year of entry to the College and not year of study. The fees listed are for students in the 2024-25 academic session. To find the fee for your programme, please choose your department. Students that commenced before 1 September 2022 were billed their first year's fees pro rata a nominal progression date of 1 October and will be billed for subsequent years on or around 1 October each year. Students that commenced on or after 1 September 2022 are billed their first year's fees in full regardless of the date on which they commence; these students will be billed for subsequent years on or around the anniversary of the closest first day of the month to the date on which they commenced. The fees for students paying the UKRI rate of fee will increase annually by an amount linked to inflation. The fees for all other continuing postgraduate research students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount.",
    "metadata": {
      "title": "Centre for Languages, Culture and Communication",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/postgraduate-research-programmes/centre-for-languages-culture-and-communication",
      "category": "postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Fees for 2024-25 academic session",
        "Fees for students who started before/after 1 September 2022 differ",
        "UKRI rate fees increase annually by inflation",
        "Other continuing students' fees increase by average CPI change"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Postgraduate Research Programmes Crick Institute Crick Institute Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2024-25 academic session. To find the fee for your programme, please choose your department from the boxes below. Students that commenced their studies before 1 September 2022 were billed their first year's fees pro rata a nominal progression date of 1 October and will be billed for subsequent years of study on or around 1 October each year. Students that commenced their studies on or after 1 September 2022 are billed their first year's fees in full regardless of the date on which they commence their studies; these students will be billed for subsequent years of study on or around the anniversary of the closest first day of the month to the date on which they commenced their studies. The fees for students paying the UKRI rate of fee will increase annually by an amount linked to inflation (the measure currently used by UKRI is the GDP deflator), this included students returning from an interruption of studies. The fees for all other continuing postgraduate research students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. Except where otherwise indicated, the fees for continuing or resuming students will increase annually by an amount linked to inflation as above; the fee paid for subsequent years of study may be higher than the fee listed here. All students are bound by the College's Tuition Fee Policy which is available here. If ...",
    "metadata": {
      "title": "Crick Institute",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/postgraduate-research-programmes/crick-institute",
      "category": "postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Fees for 2024-25 academic session",
        "Fees for students who started before and after September 2022 differ",
        "Fees increase annually based on inflation",
        "Fees vary by research area and home/overseas status"
      ]
    }
  },
  {
    "content": "Fees for Postgraduate Research Programmes in the Faculty of Engineering at Imperial College London for the 2024-25 academic session.",
    "metadata": {
      "title": "Faculty of Engineering",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/postgraduate-research-programmes/faculty-of-engineering",
      "categories": {
        "level": "postgraduate",
        "department": "engineering",
        "program_type": "research"
      },
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "UKRI-funded students have fees that increase annually with inflation",
        "Other continuing students have fees that increase annually by CPI change",
        "Fees for part-time research students are half the full-time rate"
      ],
      "fee_structure": {
        "departments": [
          {
            "name": "Chemical Engineering",
            "home_fees": {
              "2024 Cohort": 7340,
              "2023 Cohort": 7340,
              "2022 Cohort": 7340,
              "2021 Cohort": 7340,
              "2020 Cohort": 4786,
              "2019 Cohort": 4786
            },
            "overseas_fees": {
              "2024 Cohort": 29900,
              "2023 Cohort": 29900,
              "2022 Cohort": 29900,
              "2021 Cohort": 29900,
              "2020 Cohort": 29900,
              "2019 Cohort": 29900
            }
          },
          {
            "name": "Earth Science and Engineering",
            "phd_petroleum_fees": {
              "2021 Cohort": {
                "home": 7340,
                "overseas": 35750
              },
              "2020 Cohort": {
                "home": 4786,
                "overseas": 35750
              },
              "2019 Cohort": {
                "home": 4786,
                "overseas": 35750
              }
            },
            "other_programme_fees": {
              "2024 Cohort": {
                "home": 7340,
                "overseas": 29900
              },
              "2023 Cohort": {
                "home": 7340,
                "overseas": 29900
              },
              "2022 Cohort": {
                "home": 7340,
                "overseas": 29900
              },
              "2021 Cohort": {
                "home": 7340,
                "overseas": 29900
              },
              "2020 Cohort": {
                "home": 4786,
                "overseas": 29900
              },
              "2019 Cohort": {
                "home": 4786,
                "overseas": 29900
              }
            }
          },
          {
            "name": "All Other Departments",
            "fees": {
              "2024 Cohort": {
                "home": 7340,
                "overseas": 29900
              },
              "2023 Cohort": {
                "home": 7340,
                "overseas": 29900
              },
              "2022 Cohort": {
                "home": 7340,
                "overseas": 29900
              },
              "2021 Cohort": {
                "home": 7340,
                "overseas": 29900
              },
              "2020 Cohort": {
                "home": 4786,
                "overseas": 29900
              },
              "2019 Cohort": {
                "home": 4786,
                "overseas": 29900
              }
            }
          }
        ],
        "part_time_research": "Students undertaking research on a part-time basis will be charged half the full-time fee"
      }
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Postgraduate Research Programmes Faculty of Medicine Faculty of Medicine Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2024-25 academic session. To find the fee for your programme, please choose your department from the boxes below. Students that commenced their studies before 1 September 2022 were billed their first year's fees pro rata a nominal progression date of 1 October and will be billed for subsequent years of study on or around 1 October each year. Students that commenced their studies on or after 1 September 2022 are billed their first year's fees in full regardless of the date on which they commence their studies; these students will be billed for subsequent years of study on or around the anniversary of the closest first day of the month to the date on which they commenced their studies. The fees for students paying the UKRI rate of fee will increase annually by an amount linked to inflation (the measure currently used by UKRI is the GDP deflator), this included students returning from an interruption of studies. The fees for all other continuing postgraduate research students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. Except where otherwise indicated, the fees for continuing or resuming students will increase annually by an amount linked to inflation as above; the fee paid for subsequent years of study may be higher than the fee listed here. All students are bound by the College's Tuition Fee Policy which is available h...",
    "metadata": {
      "title": "Faculty of Medicine",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/postgraduate-research-programmes/faculty-of-medicine",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Fees for 2024-25 academic session",
        "Fees for students starting before and after Sept 2022 differ",
        "Fees increase annually based on inflation measures",
        "Continuing student fees capped at new-entrant fee",
        "All students bound by Tuition Fee Policy",
        "Fees can be looked up in the College Knowledge Bank"
      ]
    }
  },
  {
    "content": "University life is different from previous experiences. You'll live with people from around the world and take responsibility for your education and self-care. Be aware of expectations and opportunities.",
    "metadata": {
      "title": "Faculty of Natural Sciences",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/postgraduate-research-programmes/faculty-of-natural-sciences",
      "category": "postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "University life is different from previous experiences",
        "You'll live with people from around the world",
        "Take responsibility for your education and self-care",
        "Be aware of expectations and opportunities"
      ]
    }
  },
  {
    "content": "Fees for postgraduate research programmes at Imperial College Business School for the 2024-25 academic year. Fees are charged by year of entry, not year of study. Fees for students who started before Sept 2022 are billed pro-rata, while those who started after Sept 2022 are billed in full. Fees for UKRI-funded students and other continuing students will increase annually by inflation. All students are bound by the College's Tuition Fee Policy.",
    "metadata": {
      "title": "Imperial College Business School",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/postgraduate-research-programmes/imperial-college-business-school",
      "category": "Tuition Fees",
      "subcategory": "Postgraduate Research Programmes",
      "key_points": [
        "Fees charged by year of entry, not year of study",
        "Fees for students before and after Sept 2022 billed differently",
        "Fees for UKRI-funded and other continuing students increase annually by inflation",
        "All students bound by College's Tuition Fee Policy"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Taught Postgraduate Programmes Taught Postgraduate Programmes Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2024-25 academic session. To find the fee for your programme, please choose your faculty from the boxes below. The fees for all continuing taught postgraduate students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. The inflation increase for 2024-25 fees is 5.7% rounded to the nearest £50.00. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. All students are bound by the College's Tuition Fee Policy which is available here. If you have any questions regarding tuition fees, please search our FAQs on the College Knowledge Bank (ServiceNow, College log on required), if you still have questions after this, you can raise a ticket with us via ServiceNow or via the contact links at the top of this page if you do not have a College IT account.",
    "metadata": {
      "title": "Taught Postgraduate Programmes",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/taught-postgraduate-programmes",
      "category": "Postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not study year",
        "Fees for 2024-25 academic session",
        "Fees increase annually based on CPI, capped at new-entrant fee",
        "Tuition Fee Policy applies to all students",
        "Resources available for fee-related questions"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Taught Postgraduate Programmes Centre for Languages, Culture and Communication Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2024-25 academic session. To find the fee for your programme, please choose your faculty from the boxes below. The fees for all continuing taught postgraduate students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. The inflation increase for 2024-25 fees is 5.7% rounded to the nearest £50.00. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. Except where otherwise indicated, the fees for continuing or resuming students will increase annually by an amount linked to inflation as above; the fee paid for subsequent years of study may be higher than the fee listed here. All students are bound by the College's Tuition Fee Policy which is available here. If you have any questions regarding tuition fees, please search our FAQs on the College Knowledge Bank (ServiceNow, College log on required), if you still have questions after this, you can raise a ticket with us via ServiceNow or via the contact links at the top of this page if you do not have a College IT account.",
    "metadata": {
      "title": "Centre for Languages, Culture and Communication",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/taught-postgraduate-programmes/centre-for-languages-culture-and-communication",
      "category": "Fees and Funding",
      "subcategory": "Postgraduate Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Continuing students' fees increase annually by CPI change",
        "Continuing students' fees capped at new-entrant fee",
        "Fees may increase annually linked to inflation",
        "Students bound by College's Tuition Fee Policy",
        "Questions can be raised via ServiceNow or contact links"
      ]
    }
  },
  {
    "content": "Imperial College London provides postgraduate tuition fees for the Faculty of Engineering for the 2024-25 academic session. Fees are charged by year of entry, not year of study, and will increase annually by the average percentage change in the CPI. Continuing student fees are capped at the new-entrant fee for that session and may increase by less. Fees vary by department, program, full-time/part-time status, and home/overseas status.",
    "metadata": {
      "title": "Faculty of Engineering",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/taught-postgraduate-programmes/faculty-of-engineering",
      "categories": [
        "postgraduate",
        "tuition fees",
        "faculty of engineering"
      ],
      "key_points": [
        "Fees charged by year of entry, not study year",
        "Annual increase based on CPI change",
        "Continuing student fees capped at new-entrant fee",
        "Fees vary by department, program, FT/PT, home/overseas"
      ]
    }
  },
  {
    "content": "Home\nImperial students\nFees and funding\nTuition fees\nPostgraduate tuition fees\n2024-25\nTaught Postgraduate Programmes\nFaculty of Medicine\nFaculty of Medicine\nPlease note that fees are charged by year of entry to the College and not year of study.  The fees listed within this section are for students in the 2024-25 academic session.  To find the fee for your programme, please choose your faculty from the boxes below.\nThe fees for all continuing taught postgraduate students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies.  The inflation increase for 2024-25 fees is 5.7% rounded to the nearest £50.00.  Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount.\nExcept where otherwise indicated, the fees for continuing or resuming students will increase annually by an amount linked to inflation as above, this includes students on modular programmes; the fee paid for subsequent years of study may be higher than the fee listed here.\nModular tuition fees explained:\nIn order to provide a flexible offer for students, many of our Master’s-level programmes have entry points at postgraduate certificate (PGCert) and/or postgraduate diploma (PGDip) level as well as full master’s level. In these cases, the fees for the PGCert and PGDip are calculated as a proportion of the full master’s fee.  Unless otherwise stated, the standard calculation is that a PGCert is charged at 50% and a PGDip at 80% of the rate of the full master’s degree.\nStudents undertaking a PGDip over two years will be charged the PGCert fee in year one and the balance of the PGDip fee (the PGCert-PGDip conversion fee) in year two. Students undertaking a full-master’s degree over three years will be charged the PGCert fee in year on...",
    "metadata": {
      "title": "Faculty of Medicine",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/taught-postgraduate-programmes/faculty-of-medicine"
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Postgraduate tuition fees 2024-25 Taught Postgraduate Programmes Faculty of Natural Sciences Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2024-25 academic session. To find the fee for your programme, please choose your faculty from the boxes below. The fees for all continuing taught postgraduate students will increase annually by the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences unless otherwise indicated, this includes students returning from an interruption of studies. The inflation increase for 2024-25 fees is 5.7% rounded to the nearest £50.00. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. Except where otherwise indicated, the fees for continuing or resuming students will increase annually by an amount linked to inflation as above; the fee paid for subsequent years of study may be higher than the fee listed here. All students are bound by the College's Tuition Fee Policy which is available here. If you have any questions regarding tuition fees, please search our FAQs on the College Knowledge Bank (ServiceNow, College log on required), if you still have questions after this, you can raise a ticket with us via ServiceNow or via the contact links at the top of this page if you do not have a College IT account.",
    "metadata": {
      "title": "Faculty of Natural Sciences",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/taught-postgraduate-programmes/faculty-of-natural-sciences",
      "categories": [
        "Postgraduate",
        "Tuition Fees"
      ],
      "key_points": [
        "Fees are charged by year of entry, not study year",
        "Fees for continuing students increase annually with inflation",
        "Students are bound by the College's Tuition Fee Policy",
        "Procedures for inquiring about tuition fees"
      ]
    }
  },
  {
    "content": "Imperial College Business School offers a range of postgraduate programmes, including MBA, MSc, and online programmes. Tuition fees for the 2024-25 academic session are provided, with fees varying based on programme, mode of study (full-time or part-time), and home/overseas student status. Fees are charged by year of entry, not year of study, and are fixed for the duration of the programme with no inflationary uplifts.",
    "metadata": {
      "title": "Imperial College Business School",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/postgraduate-tuition-fees/2024-25/taught-postgraduate-programmes/imperial-college-business-school",
      "category": "Postgraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Offers a range of postgraduate programmes, including MBA, MSc, and online",
        "Tuition fees for 2024-25 academic session, varying by programme, mode, and student status",
        "Fees are charged by year of entry, not year of study, and are fixed for the duration",
        "No inflationary uplifts on fees"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate tuition fees Please note that tuition fees are subject to annual inflationary uplifts and are charged by year of entry to the College and not year of study. To find the fees for your programme and the inflationary uplifts to which they will be subject please choose the correct session. Fees are charged at two different rates, the Home rate and the non-Home rate. Students requiring a Student visa to study at the College will require a Confirmation of Acceptance for Studies (CAS) as part of their application process. All students are bound by the College's payment terms for tuition fees.",
    "metadata": {
      "title": "Undergraduate tuition fees",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees",
      "category": "fees and funding",
      "subcategory": "undergraduate tuition fees",
      "key_points": [
        "Tuition fees are subject to annual inflation and charged by year of entry",
        "Fees are charged at Home and non-Home rates",
        "Students requiring a Student visa need a Confirmation of Acceptance for Studies (CAS)",
        "All students are bound by the College's payment terms"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Undergraduate tuition fees 2021-22 Please note that fees are charged by year of entry to the College and not year of study. The fees listed are for students in the 2021–2022 academic session. To find the fee for your course, please choose your Department. European Union students will be required to meet the Non-Home fee rate. Continuing students will retain their fees and funding for the duration of the programme. The fees for Home and Ireland undergraduate students may increase annually by an amount linked to inflation. The fees for continuing Overseas students increase annually by the RPI value for the April of the calendar year in which the session commences.",
    "metadata": {
      "title": "2021-22",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2021-22",
      "category": "fees-and-funding",
      "subcategory": "undergraduate-tuition-fees",
      "key_points": [
        "Fees are charged by year of entry, not study year",
        "EU students will meet Non-Home fee rate, continuing students retain their fees",
        "Home/Ireland fees may increase annually with inflation",
        "Overseas fees increase annually based on RPI"
      ]
    }
  },
  {
    "content": "Imperial College London will charge all undergraduate programmes at the Higher Amount in 2021-22. The fees for Home and Ireland undergraduate students are controlled by the UK Government. Fees for EU/Overseas students will increase annually by RPI value. Fees vary by department and entry cohort.",
    "metadata": {
      "title": "Faculty of Engineering",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2021-22/faculty-of-engineering",
      "category": "Tuition Fees",
      "subcategory": "Undergraduate",
      "key_points": [
        "Fees are controlled by the UK Government for Home and Ireland students",
        "Fees for EU/Overseas students increase annually by RPI value",
        "Fees vary by department and entry cohort",
        "All programmes charged at Higher Amount in 2021-22"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Undergraduate tuition fees 2021-22 Faculty of Medicine Faculty of Medicine Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for the 2021–2022 academic session. To find the fee for your department and course, first choose your department from the boxes below. The fees for Home undergraduate students are controlled by the UK Government according to the funding model under which the student started their course of study. These fees may increase annually by an amount linked to inflation and approved by Parliament under the Student Fees (Inflation Index) Regulations 2006 (currently the measure is the RPIX); fees for subsequent years of study may be higher than the fees listed here. Imperial College London will charge all undergraduate programmes at the Higher Amount in 2021-22; Imperial College London reserves the right to amend these fees following publication of the maximum fee caps for 2021-22 by the Government. The fees for continuing EU/ Overseas students will increase annually by the RPI value for the April of the calendar year in which the session commences and rounded to the nearest £500.00; fees for subsequent years of study may be higher than the fee listed here. All Fees are capped at the new-entrent fee rate.",
    "metadata": {
      "title": "Faculty of Medicine",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2021-22/faculty-of-medicine",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "Home student fees are controlled by the UK Government",
        "Fees may increase annually due to inflation",
        "All undergraduate programmes will be charged at the Higher Amount in 2021-22",
        "Imperial reserves the right to amend fees based on government caps",
        "Continuing EU/Overseas fees will increase annually by RPI"
      ]
    }
  },
  {
    "content": "The fees for Home undergraduate students are controlled by the UK Government according to the funding model under which the student started their course of study. These fees may increase annually by an amount linked to inflation and approved by Parliament. Imperial College London will charge all undergraduate programmes at the Higher Amount in 2021-22. The fees for continuing EU/ Overseas students will increase annually by the RPI value for the April of the calendar year in which the session commences and rounded to the nearest £500.00.",
    "metadata": {
      "title": "Faculty of Natural Sciences",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2021-22/faculty-of-natural-sciences",
      "category": "Fees and Funding",
      "subcategory": "Undergraduate Tuition Fees",
      "key_points": [
        "Home undergraduate fees are controlled by the UK Government and may increase annually",
        "Imperial College London will charge all undergraduate programmes at the Higher Amount in 2021-22",
        "Fees for continuing EU/Overseas students will increase annually by the RPI value for the April of the calendar year in which the session commences"
      ]
    }
  },
  {
    "content": "Imperial College London charges all undergraduate programmes at the Higher Amount. Fees for Home undergraduate students, including those from Ireland, are controlled by the UK Government and may increase annually by an amount linked to inflation. Fees for non-Home students will increase annually by up to 8% for 2023-24. Fees vary by faculty, covering engineering, medicine, natural sciences, and business school programmes.",
    "metadata": {
      "title": "2023-24",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2023-24",
      "category": "Fees and Funding",
      "subcategory": "Undergraduate Tuition Fees",
      "key_points": [
        "All undergraduate programmes charged at the Higher Amount",
        "Home student fees controlled by UK Government, may increase with inflation",
        "Non-Home student fees increase up to 8% for 2023-24",
        "Fees vary by faculty: engineering, medicine, natural sciences, business school"
      ]
    }
  },
  {
    "content": "Imperial College London charges undergraduate tuition fees based on the year of entry, not the year of study. Fees for Home and Ireland students are controlled by the UK government and may increase annually by an amount linked to inflation. Fees for non-Home students increase annually by up to 8% for the 2023-24 academic year. Students on a Year Abroad or Year in Industry/Research have different fee structures.",
    "metadata": {
      "title": "Faculty of Engineering",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2023-24/faculty-of-engineering",
      "category": "Tuition Fees",
      "subcategory": "Undergraduate Fees",
      "key_points": [
        "Fees charged based on year of entry, not study",
        "Home/Ireland student fees controlled by UK government",
        "Non-Home student fees increase up to 8% annually",
        "Different fee structures for study abroad or industry placements"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Undergraduate tuition fees 2023-24 Faculty of Medicine Faculty of Medicine Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2023-24 academic session. To find the fee for your programme, please choose your department from the boxes below. European Union students that commenced their studies on or after 1 August 2021 (excluding those from Ireland) are not eligible to claim UK Government funding for tuition fees and will be charged at the higher (non-Home) rate of fee. Students from the European Union that commenced their studies prior to 1 August 2021 will remain eligible for UK Government funding for tuition fees and will therefore continue to be charged at the Home rate of fee. For more information, please see www.gov.uk/government/news/student-support-in-england. The fees for Home undergraduate students, including those from Ireland, are controlled by the UK Government; these fees may increase annually by an amount linked to inflation and approved by Parliament under the Student Fees (Inflation Index) Regulations 2006 (currently, the inflationary measure used is the RPIX). Fees for subsequent years of study may be higher than the fees listed here; Imperial College London charges all undergraduate programmes at the Higher Amount. From the 2022-23 academic year, the fees for continuing undergraduate students paying the non-Home rate of fee will increase annually by an amount up to the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences, this includes students returning from an interruption of studies. Due to the exceptional inflationary pressure currently being faced by the United Kingdom, the College has reduced the maximum inflationary increase for 2023-24 from 10.0% to 8.0% rounded to the nearest £50.00. Continuing student fees ...",
    "metadata": {
      "title": "Faculty of Medicine",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2023-24/faculty-of-medicine",
      "category": "undergraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "EU students who started after Aug 2021 (excl. Ireland) pay higher fees",
        "Home and Ireland students' fees controlled by UK government, may increase annually",
        "Continuing non-Home students' fees may increase up to 8% for 2023-24"
      ]
    }
  },
  {
    "content": "Tuition fees for undergraduate programs in the Faculty of Natural Sciences at Imperial College London for the 2023-24 academic session. Fees are charged by year of entry, not year of study. Home and Ireland students have a controlled fee set by the UK government that may increase annually. EU students who started after August 2021 are charged the higher overseas rate. Part-time programs are charged at 0.5 FTE. Students on a Year Abroad or Year in Industry/Research have different fee structures.",
    "metadata": {
      "title": "Faculty of Natural Sciences",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2023-24/faculty-of-natural-sciences",
      "category": "undergraduate",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees charged by year of entry, not year of study",
        "Home and Ireland students have controlled fees that may increase annually",
        "EU students who started after August 2021 pay higher overseas rates",
        "Part-time programs charged at 0.5 FTE",
        "Different fee structures for students on a Year Abroad or Year in Industry/Research"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Undergraduate tuition fees 2023-24 Imperial College Business School Imperial College Business School Please note that fees are charged by year of entry to the College and not year of study. The fees listed within this section are for students in the 2023-24 academic session. European Union students that commenced their studies on or after 1 August 2021 (excluding those from Ireland) are not eligible to claim UK Government funding for tuition fees and will be charged at the higher (non-Home) rate of fee. Students from the European Union that commenced their studies prior to 1 August 2021 will remain eligible for UK Government funding for tuition fees and will therefore continue to be charged at the Home rate of fee. The fees for Home undergraduate students, including those from Ireland, are controlled by the UK Government; these fees may increase annually by an amount linked to inflation and approved by Parliament under the Student Fees (Inflation Index) Regulations 2006 (currently, the inflationary measure used is the RPIX). Fees for subsequent years of study may be higher than the fees listed here; Imperial College London charges all undergraduate programmes at the Higher Amount. From the 2022-23 academic year, the fees for continuing undergraduate students paying the non-Home rate of fee will increase annually by an amount up to the average percentage change in the CPI from the April of the preceding year to the March of the calendar year in which the session commences, this includes students returning from an interruption of studies. Due to the exceptional inflationary pressure currently being faced by the United Kingdom, the College has reduced the maximum inflationary increase for 2023-24 from 10.0% to 8.0% rounded to the nearest £50.00. Continuing student fees are also capped at the new-entrant fee for that session and so may increase by less than the maximum amount. All students are bound by the College's T...",
    "metadata": {
      "title": "Imperial College Business School",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2023-24/imperial-college-business-school",
      "category": "Fees and Funding",
      "subcategory": "Tuition Fees",
      "key_points": [
        "Fees are charged by year of entry, not year of study",
        "EU students who started after Aug 2021 are charged at non-Home rate",
        "Home student fees are controlled by UK government and may increase annually",
        "Non-Home student fees may increase annually by up to 8% in 2023-24",
        "Continuing student fees are capped at the new-entrant fee",
        "All students must follow the College's Tuition Fee Policy"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Undergraduate tuition fees 2023-24 Imperial College Business School Accordion Accordion",
    "metadata": {
      "title": "Accordion",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2023-24/imperial-college-business-school/accordion",
      "category": "fees-and-funding",
      "subcategory": "tuition-fees",
      "key_points": [
        "Home",
        "Imperial students",
        "Fees and funding",
        "Tuition fees",
        "Undergraduate tuition fees",
        "2023-24",
        "Imperial College Business School",
        "Accordion"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Undergraduate tuition fees 2023-24 Imperial College Business School Accordion BS 2023-24 fees BS 2023-24 fees",
    "metadata": {
      "title": "BS 2023-24 fees",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2023-24/imperial-college-business-school/accordion/bs-2023-24-fees",
      "category": "Fees and Funding",
      "subcategory": "Undergraduate Tuition Fees",
      "key_points": [
        "Imperial College Business School fees for 2023-24"
      ]
    }
  },
  {
    "content": "Undergraduate tuition fees at Imperial College London for the 2024-25 academic session, including information on fees for EU students, inflation-based increases, and links to fee information by faculty.",
    "metadata": {
      "title": "2024-25",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2024-25",
      "category": "Fees and Funding",
      "subcategory": "Undergraduate Tuition Fees",
      "key_points": [
        "Fees for Home undergraduate students, including those from Ireland, are controlled by the UK Government and may increase annually with inflation",
        "Fees for continuing non-Home undergraduate students will increase annually by up to the average percentage change in the CPI",
        "Fees are charged by year of entry, not year of study",
        "Detailed fee information is provided by faculty, including Engineering, Medicine, Natural Sciences, and the Business School"
      ]
    }
  },
  {
    "content": "Imperial students, fees, and funding information for the 2024-25 academic year, including tuition fees for various departments in the Faculty of Engineering.",
    "metadata": {
      "title": "Faculty of Engineering",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2024-25/faculty-of-engineering",
      "category": "Fees and Funding",
      "subcategory": "Undergraduate Tuition Fees",
      "key_points": [
        "Tuition fees vary by entry cohort and student status (Home/Overseas)",
        "Home and Ireland students pay £9,250 annually",
        "Overseas students pay higher fees, ranging from £39,350 to £40,940",
        "Fees may increase annually based on inflation",
        "Fees for study abroad and industrial placements are also provided"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Tuition fees Undergraduate tuition fees 2024-25 Faculty of Medicine Please note that fees are charged by year of entry to the College and not year of study. The fees listed are for students in the 2024-25 academic session. European Union students that commenced their studies on or after 1 August 2021 (excluding those from Ireland) are not eligible to claim UK Government funding for tuition fees and will be charged at the higher (non-Home) rate of fee. The fees for Home undergraduate students, including those from Ireland, are controlled by the UK Government; these fees may increase annually by an amount linked to inflation. From the 2022-23 academic year, the fees for continuing undergraduate students paying the non-Home rate of fee will increase annually by an amount up to the average percentage change in the CPI.",
    "metadata": {
      "title": "Faculty of Medicine",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2024-25/faculty-of-medicine",
      "category": "Tuition Fees",
      "subcategory": "Faculty of Medicine",
      "key_points": [
        "Fees are charged by year of entry, not study year",
        "EU students starting after Aug 2021 ineligible for UK govt funding",
        "Home student fees controlled by UK govt, may increase with inflation",
        "Non-Home student fees increase annually up to CPI average"
      ]
    }
  },
  {
    "content": "Undergraduate tuition fees for the 2024-25 academic session at Imperial College London, including details on fees for Home/Ireland and Overseas students, as well as information on additional/replacement years and the Year in Industry program.",
    "metadata": {
      "title": "Faculty of Natural Sciences",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2024-25/faculty-of-natural-sciences",
      "categories": [
        "Undergraduate",
        "Tuition Fees"
      ],
      "key_points": [
        "Fees for Home/Ireland and Overseas students are provided for various departments and entry cohorts",
        "Additional or replacement years abroad are charged at a reduced rate",
        "Year in Industry placements have specific fee structures"
      ]
    }
  },
  {
    "content": "Imperial College Business School tuition fees for the 2024-25 academic session. Home and Ireland students are charged £9,250, while Overseas students are charged £39,100 for the 2024 cohort. Fees for the 2023 cohort are £9,250 for Home and Ireland students, and £38,800 for Overseas students. Fees are charged by year of entry, not year of study, and may increase annually by an amount linked to inflation.",
    "metadata": {
      "title": "Imperial College Business School",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/tuition-fees/undergraduate-tuition-fees/2024-25/imperial-college-business-school",
      "category": "Fees and Funding",
      "subcategory": "Undergraduate Tuition Fees",
      "key_points": [
        "Tuition fees for the 2024-25 academic session",
        "Home and Ireland students charged £9,250, Overseas students charged £39,100 (2024 cohort)",
        "Fees for 2023 cohort are £9,250 (Home and Ireland) and £38,800 (Overseas)",
        "Fees charged by year of entry, not year of study, and may increase annually with inflation"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Undergraduate funding Important fees and funding information for continuing undergraduate students. Tuition fees Tuition fees Discounts for College staff and their children Managing your money Living costs Budgeting Money saving tips Bursaries & scholarships Imperial Bursary Scholarships search tool Non-Imperial scholarships Loans & grants Tuition fee loan Maintenance loans Funding for Placements Student Support Fund",
    "metadata": {
      "title": "Undergraduate funding",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding",
      "category": "fees and funding",
      "subcategory": "undergraduate",
      "key_points": [
        "Information on tuition fees, living costs, and money management",
        "Availability of bursaries, scholarships, and loans",
        "Funding options for placements and support funds"
      ]
    }
  },
  {
    "content": "We offer a wide range of support to help you through your studies. Available to all Home undergraduates who are eligible for student funding from the Government. You can use our scholarships search tool to search all our awards in one place.",
    "metadata": {
      "title": "Bursaries and scholarships",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/bursaries-and-scholarships",
      "category": "Fees and Funding",
      "subcategory": "Bursaries and Scholarships",
      "key_points": [
        "Wide range of support for students",
        "Imperial Bursary available for eligible Home undergraduates",
        "Scholarships search tool to find all available awards"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Bursaries and scholarships Further funding opportunities Financial Assistance Non- Imperial Scholarships Funding opportunities from external organisations More information Alternative Guide to Funding Funding opportunities from Charities and Trusts More information",
    "metadata": {
      "title": "Further funding opportunities",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/bursaries-and-scholarships/further-funding-opportunities-",
      "category": "undergraduate",
      "subcategory": "Fees and Funding",
      "key_points": [
        "Undergraduate funding options",
        "Bursaries and scholarships",
        "Further funding opportunities",
        "Financial assistance",
        "Non-Imperial scholarships",
        "External funding organizations",
        "Alternative funding guides",
        "Charity and trust funding"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Bursaries and scholarships Further funding opportunities Alternative Guide to Funding Alternative Guide to Funding Scholarships Search Tool Register for the Alternative Guide to Postgraduate Funding Charities are an under- utilised source of funding for education but can be used by both undergraduates and postgraduates to top up the money you have already raised by £500- £2,000. Funding opportunities from charities are accessible by completing the form below to access the Alternative Guide to Postgraduate Funding Online gateway. The College has no direct involvement in these awards – we provide this data for information purposes only. If you are a current Imperial College student you can use your Imperial email address to login to the Alternative Guide to Postgraduate Funding Online gateway.",
    "metadata": {
      "title": "Alternative Guide to Funding",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/bursaries-and-scholarships/further-funding-opportunities-/alternative-guide-to-funding",
      "category": "Fees and Funding",
      "subcategory": "Further Funding Opportunities",
      "key_points": [
        "Charities are an under-utilized source of funding for education",
        "Funding opportunities from charities can be accessed through the Alternative Guide to Postgraduate Funding Online gateway",
        "Imperial College has no direct involvement in these awards, but provides the information",
        "Current Imperial College students can use their college email to login to the online gateway"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Bursaries and scholarships Further funding opportunities Non-Imperial scholarships A growing number of external organisations offer scholarships, helping you successfully complete your studies. Our scholarships search tool Search all the scholarships that we administer in one place. Use our scholarships search tool External scholarships and awards There are many external scholarships and awards you can apply for.",
    "metadata": {
      "title": "Non-Imperial scholarships",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/bursaries-and-scholarships/further-funding-opportunities-/external-awards",
      "category": "Undergraduate Funding",
      "subcategory": "External Scholarships and Awards",
      "key_points": [
        "External organizations offer scholarships to help students",
        "Use Imperial's scholarships search tool to find opportunities",
        "Many external scholarships and awards available to apply for",
        "Research options in advance, identify referees, apply early"
      ]
    }
  },
  {
    "content": "The Imperial Bursary is a generous scheme that provides up to £5,000 per year for Home undergraduate students to help with the cost of studying in London. It is non-repayable and automatically awarded to eligible students with household incomes below £60,000. Bursary amounts vary based on income, from £5,000 for incomes below £16,000 to £2,000 for incomes up to £60,000. There is no separate application process, as the bursary is awarded based on information provided in the means-tested government loan application. Payments are made directly into the student's bank account in monthly instalments. Special options are available for Medicine students, care leavers, and estranged students.",
    "metadata": {
      "title": "Imperial Bursary",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/bursaries-and-scholarships/imperial-bursary",
      "category": "Undergraduate Funding",
      "subcategory": "Bursaries and Scholarships",
      "key_points": [
        "Up to £5,000 per year for Home undergraduate students",
        "Automatically awarded to eligible students with household incomes below £60,000",
        "Bursary amounts vary based on household income",
        "No separate application process, awarded based on government loan application",
        "Special options for Medicine students, care leavers, and estranged students"
      ]
    }
  },
  {
    "content": "University life can involve several one-off costs before loans/bursaries are received. Care leavers and estranged students with less family support may struggle to meet these upfront costs. Imperial offers an early Bursary payment to help. To apply, provide evidence of status and bank details. Payment is on 6 September 2024, with 10 monthly instalments thereafter.",
    "metadata": {
      "title": "Care leavers and estranged students",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/bursaries-and-scholarships/imperial-bursary/care-leavers",
      "category": "Undergraduate Funding",
      "subcategory": "Bursaries and Scholarships",
      "key_points": [
        "Upfront costs can be difficult for care leavers and estranged students",
        "Imperial offers early Bursary payment to help with these costs",
        "Apply by providing evidence of status and bank details",
        "First payment on 6 September 2024, then 10 monthly instalments"
      ]
    }
  },
  {
    "content": "MBBS Medicine students have reduced statutory funding in years 5 and 6. To minimize this, eligible students can choose the six-year spread payment option, where 33% of their Imperial Bursary is set aside in years 1-4 and paid out in years 5 and 6, along with 1% interest.",
    "metadata": {
      "title": "Medicine students",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/bursaries-and-scholarships/imperial-bursary/medicine-students",
      "categories": {
        "main": "Fees and funding",
        "sub": "Bursaries and scholarships"
      },
      "key_points": [
        "MBBS Medicine students have reduced statutory funding in years 5 and 6",
        "Six-year spread payment option allows setting aside 33% of bursary in years 1-4 to be paid in years 5-6",
        "1% interest is paid on the saved bursary in the final year",
        "Bursary payments are made in varying instalments across the 6 years"
      ]
    }
  },
  {
    "content": "Home students can apply for Tuition fee loan to cover study costs and Maintenance loan for living expenses. Medical students can apply for NHS funding in clinical years. Blackbullion platform provides financial education and resources.",
    "metadata": {
      "title": "Loans and grants",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants",
      "category": "fees and funding",
      "subcategory": "loans and grants",
      "key_points": [
        "Tuition fee loan available to cover study costs",
        "Maintenance loan available for living expenses",
        "NHS funding available for medical students in clinical years",
        "Blackbullion platform provides financial education and resources"
      ]
    }
  },
  {
    "content": "Canadian students can apply for loans and grants for full-time or part-time study at Imperial. The application process involves both provincial and federal government funding. Students are required to submit tax forms to the Canada Revenue Agency annually. The College can confirm student status but is not involved in processing loan applications.",
    "metadata": {
      "title": "Canadian student loans and tax forms",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/canadian-loans",
      "category": "Fees and Funding",
      "subcategory": "Loans and Grants",
      "key_points": [
        "Canadian students can access loans and grants for study at Imperial",
        "Loan application process involves provincial and federal governments",
        "Students must submit annual tax forms to Canada Revenue Agency",
        "College can confirm student status but not involved in loan processing"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Loans and grants Funding for placements Funding for curriculum placements Whilst spending a year abroad or in Industry you may be eligible to receive some additional funding to help you with your studies. Funding for placements varies according to your chosen route, details of which can be found below. Year abroad students Funding options for students studying abroad Year in Industry Funding options for students spending a year in year in Industry Erasmus grants for 2021-22 study period An Erasmus grant provides financial support to assist with additional expenses such as ordinarily, non-living expenses such as travel costs. Turing Scheme funding Funding for international opportunities in education and training across the world Undergraduate Research Opportunities Programme (UROP) Full time undergraduate students are invited to apply to the College's UROP Contact us Contact Student Financial Support if you have any further queries",
    "metadata": {
      "title": "Funding for placements",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/funding-for-placements",
      "category": "Fees and Funding",
      "subcategory": "Funding for Placements",
      "key_points": [
        "Funding for placements varies depending on chosen route",
        "Funding options available for year abroad and year in industry",
        "Erasmus grants and Turing Scheme funding available for international opportunities",
        "Undergraduate Research Opportunities Programme (UROP) for full-time undergraduates",
        "Contact Student Financial Support for further queries"
      ]
    }
  },
  {
    "content": "Imperial students can apply for Erasmus grants to cover additional expenses while studying abroad in Europe. The grant amounts vary by country, with €370 per month for most countries and €420 per month for Nordic countries. Eligibility requirements include a minimum 3-month and maximum 12-month duration, being part of a degree program, and potentially a supplementary grant for low-income students. Previous Erasmus participation must be disclosed. Successful applicants have responsibilities like submitting contracts, learning agreements, and certificates of arrival and attendance. Payments are made in two installments per year. Brexit and COVID-19 may impact the Erasmus program.",
    "metadata": {
      "title": "Erasmus grants for 2021-22 study period",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/funding-for-placements/erasmus-grants-for-2021-22-study-period",
      "category": "Undergraduate Funding",
      "subcategory": "Funding for Placements",
      "key_points": [
        "Erasmus grants available for study abroad in Europe",
        "Grant amounts vary by country, with higher rates for Nordic countries",
        "Eligibility requirements include duration, degree program, and income-based supplement",
        "Successful applicants have responsibilities like submitting paperwork",
        "Payments made in two installments per year",
        "Brexit and COVID-19 may impact the Erasmus program"
      ]
    }
  },
  {
    "content": "The Turing Scheme is the UK government's global programme to study and work abroad. It provides funding for international opportunities in education and training across the world, and is supported by the Department for Education. The scheme recognizes that students from under-represented backgrounds are less likely to spend a period of their degree overseas, and offers enhanced funding to these students. Applications for Turing Scheme funding for both the 2023-24 and 2024-25 academic years are now open.",
    "metadata": {
      "title": "Turing Scheme",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/funding-for-placements/turing-scheme",
      "category": "Undergraduate Funding",
      "subcategory": "Funding for Placements",
      "key_points": [
        "The Turing Scheme provides funding for international study and work opportunities",
        "It is supported by the Department for Education",
        "The scheme aims to widen access to international experiences by offering enhanced funding to students from under-represented backgrounds",
        "Applications for Turing Scheme funding are open for the 2023-24 and 2024-25 academic years"
      ]
    }
  },
  {
    "content": "Home\nImperial students\nFees and funding\nUndergraduate funding\nLoans and grants\nFunding for placements\nTuring Scheme\nTuring Scheme 2023-24\nTuring Scheme 2023-24\nThe Turing Scheme is the UK government's global programme to study and work abroad. Apply now for 2023-24\nUpload your documents to support your 23-24 application\nApplications for Postgraduate International Placements and Undergraduate Industrial/Research Placements still open! Please ensure you have read the information on this webpage before applying.\nHow to apply\nFor the 2023-24 academic year, Imperial has been awarded funding to support students to take up international opportunities across several activities, listed below. Home (UK), EU and international students are all eligible to apply.\nBefore applying, you will need to consider the individual eligibility criteria, application processes and deadlines for each activity.",
    "metadata": {
      "title": "Turing Scheme 2023-24",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/funding-for-placements/turing-scheme/turing-scheme-2023-24",
      "category": "Undergraduate Funding",
      "subcategory": "Turing Scheme",
      "key_points": [
        "The Turing Scheme is the UK government's global programme to study and work abroad",
        "Apply now for 2023-24",
        "Applications for Postgraduate International Placements and Undergraduate Industrial/Research Placements still open",
        "Eligibility criteria, application processes and deadlines vary for each activity"
      ]
    }
  },
  {
    "content": "Imperial College has applied for 2024/25 Turing Scheme funding. The Turing Scheme is the UK government's global program for study and work abroad. Applications for Study Abroad funding have now closed. Eligible students can apply for a grant to support the additional costs of international placements. The grant amount is calculated based on duration, location, and cost of living. Enhanced funding is available for students meeting certain criteria. Key deadlines and application details are provided.",
    "metadata": {
      "title": "Turing Scheme 2024-25",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/funding-for-placements/turing-scheme/turing-scheme-2024-25",
      "category": "Undergraduate",
      "subcategory": "Funding",
      "key_points": [
        "Imperial has applied for Turing Scheme 2024-25 funding",
        "Funding available for international study abroad placements",
        "Grant amounts based on duration, location, and cost of living",
        "Enhanced funding available for eligible students",
        "Application deadline of 16th June 2024"
      ]
    }
  },
  {
    "content": "The Undergraduate Research Opportunities Programme (UROP) at Imperial College London offers funding for undergraduate students to undertake research experiences during the summer. The application process involves submitting an Expression of Interest form, completing an application form, and having a supporting statement from a supervisor. Various bursary schemes are available, including the Presidential UROP Bursary for Students of Black Heritage, the Engineering and Physical Sciences Research Council (EPSRC) Vacation Bursary, and the Imperial College UROP Award. The application deadline is 11:59 pm (GMT) on Monday, 19 February 2024, and successful applicants will be notified by Tuesday, 9 April 2024. The bursary is paid in a single installment on Friday, 5 July 2024.",
    "metadata": {
      "title": "Undergraduate Research Opportunities Programme",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/funding-for-placements/urop",
      "categories": {
        "main": "Undergraduate Funding",
        "subcategories": [
          "Placements",
          "Undergraduate Research Opportunities Programme"
        ]
      },
      "key_points": [
        "UROP offers funding for undergraduate students to undertake summer research experiences",
        "Application process involves Expression of Interest, application form, and supervisor statement",
        "Various bursary schemes available, including Presidential UROP Bursary for Students of Black Heritage",
        "Application deadline is 11:59 pm (GMT) on 19 February 2024, with results announced by 9 April 2024",
        "Bursary is paid in a single installment on 5 July 2024"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Loans and grants Funding for placements Year Abroad If you are a Home undergraduate student who is planning to spend a year abroad at an overseas University as part of your programme you are eligible to apply for the same funding as you would in the UK. Depending on the duration of your period of study abroad, you may also be entitled to an additional Travel Grant and the Study Abroad rate for your maintenance loan. You should apply to your funding authority as usual for your tuition fee loan as well as maintenance loans and grants. Tuition Fees Tuition fee information for your year abroad can be found on the tuition fees webpage. Imperial Bursary If you receive the Imperial Bursary you will continue to receive 15% of your assessed amount during your year abroad.",
    "metadata": {
      "title": "Year Abroad",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/funding-for-placements/year-abroad",
      "category": "Fees and Funding",
      "subcategory": "Loans and Grants",
      "key_points": [
        "Eligible for same funding as in the UK",
        "May be entitled to additional Travel Grant and Study Abroad rate",
        "Apply to funding authority for tuition fee loan and maintenance loans/grants",
        "Tuition fee information available on website",
        "Continue to receive 15% of Imperial Bursary during year abroad"
      ]
    }
  },
  {
    "content": "Home students undertaking a year in industry are eligible for partial government funding. Tuition fee information is available online. Imperial Bursaries are awarded based on household income assessments. Paid placements can pay £1,000 to £1,500 per month, and unpaid placements may entitle students to 15% of the assessed Imperial Bursary.",
    "metadata": {
      "title": "Year in Industry",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/funding-for-placements/year-in-industry",
      "category": "Fees and funding",
      "subcategory": "Undergraduate funding",
      "key_points": [
        "Government funding available for year in industry",
        "Tuition fees information online",
        "Imperial Bursaries based on household income",
        "Paid placements can pay £1,000 to £1,500 per month",
        "Unpaid placements may entitle 15% of assessed Imperial Bursary"
      ]
    }
  },
  {
    "content": "The Maintenance Loan is designed to support full-time Home students with their living costs. The amount you can get depends on where you live, where you study, and your household income. The maximum loan amount in 2024-25 for students living away from home in London is £13,348. Students from England must apply for financial support from Student Finance England, while students from Northern Ireland, Scotland, or Wales can contact their relevant funding body. EU/EEA/Swiss students starting a course on or after 1 August 2021 will no longer be eligible for the Home fee rate and support from Student Finance.",
    "metadata": {
      "title": "Maintenance loan for living costs",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/maintenance-loan",
      "category": "Fees and Funding",
      "subcategory": "Loans and Grants",
      "key_points": [
        "Maintenance Loan supports full-time Home students with living costs",
        "Loan amount depends on location, study location, and household income",
        "Maximum loan in 2024-25 for London students is £13,348",
        "Application process varies for students from different home nations",
        "EU/EEA/Swiss students are no longer eligible for Home fee rate and student finance"
      ]
    }
  },
  {
    "content": "Medical students in the final (clinical) years of their MBBS may be able to get funding from the NHS. There are two types of bursaries: an award providing full tuition fee support and a means-tested bursary, or a tuition fees only bursary. Students need to apply to the NHS, and the funding they receive will affect the amount of government funding they receive. Students from different regions should refer to their respective funding bodies for more information.",
    "metadata": {
      "title": "NHS funding for medical students",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/nhs-funding",
      "category": "Undergraduate Funding",
      "subcategory": "Loans and Grants",
      "key_points": [
        "Medical students in final years may get NHS funding",
        "Two types of bursaries: full tuition fee support or tuition fees only",
        "Students need to apply to the NHS for funding",
        "Funding received affects government funding eligibility",
        "Students from different regions have different funding bodies"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Loans and grants NHS funding for medical students English students English students Funding for English-domiciled students The tables below provide a guide to the funding you may be eligible to apply for depending on your chosen course and year of entry. Students undertaking an intercalating year at Imperial will be eligible for the funding outline of the cohort that they started at their home university. Funding available for MBBS/BSc Medicine (6 years) and MBBS Graduate Entry (Cumbria) (4 years) A100 MBBS/BSc Medicine (six-year course) Updated March 2023 A102 MBBS Graduate Entry (Cumbria) Updated May 2024 Summary of the table's contents Figures are applicable for academic year 2024-25. Further information on NHS funding can be found on the NHS website. Any students continuing on the A109 programme with questions about their funding, should contact us in the Student Financial Support team. Find out more Return to the NHS funding page to find out more about how to apply and contact details for more information.",
    "metadata": {
      "title": "English students",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/nhs-funding/english",
      "category": "Undergraduate Funding",
      "subcategory": "Loans and Grants",
      "key_points": [
        "Funding available for MBBS/BSc Medicine (6 years) and MBBS Graduate Entry (Cumbria) (4 years)",
        "Tables provide a guide to the funding you may be eligible for",
        "Intercalating students eligible for funding of the cohort they started at their home university",
        "Additional information on NHS funding available on the NHS website",
        "Contact the Student Financial Support team for questions on A109 programme funding"
      ]
    }
  },
  {
    "content": "EU students will no longer be able to claim UK Government funding or the lower EU (Home) fee rates for programmes starting from 2021. Continuing students, who commence prior to 2021, will retain their fees and funding for the duration of the programme. For medical students, the A100 MBBS/BSc Medicine - 6 year course has government tuition fee loans for years 1-4 and the NHS covering tuition fees for years 5-6. The A109 MBBS Graduate Entry course has students responsible for self-funding tuition fees in years 1-4, with an NHS tuition fee grant provided to cover the fees in year 5.",
    "metadata": {
      "title": "EU students",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/nhs-funding/eu-students",
      "category": "Fees and Funding",
      "subcategory": "EU Students",
      "key_points": [
        "EU students ineligible for UK government funding or lower EU fees from 2021",
        "Continuing students retain their fees and funding until program completion",
        "A100 MBBS/BSc Medicine - 6 year course has government loans for years 1-4, NHS covers fees for years 5-6",
        "A109 MBBS Graduate Entry course has students self-fund years 1-4, NHS grant covers fees in year 5"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Loans and grants NHS funding for medical students NHS hardship grant NHS hardship grant NHS hardship funds for medical and dental courses The hardship grant has been made available to medical and dental students only, due to the length of the courses and the other funding that is available. A grant of between £100 and £3,000 can be made to assist a student. To be eligible for a medical hardship grant a student must be: on a course leading to registration as a doctor or dentist eligible for a full bursary (both tuition fees and basic bursary) in genuine hardship unable to manage any shortfall between income and expenditure by their own actions An application for hardship funding must include: evidence of income and expenditure (evidence of bills must be in the student's name) three months bank statements university approval of the hardship application evidence that the student has applied for all other available funding, including the Imperial College Student Support Fund. Payments will not be made if the student has chosen not to take up their full student loan entitlement and any other form of funding or financial assistance that may be available to them. Only one application is permitted per NHS funded year.",
    "metadata": {
      "title": "NHS hardship grant",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/nhs-funding/nhs-hardship-grant",
      "category": "undergraduate",
      "subcategory": "Fees and Funding",
      "key_points": [
        "NHS hardship grant available for medical and dental students",
        "Grant range between £100 and £3,000",
        "Eligibility criteria includes full bursary, genuine hardship, and exhaustion of other funding options",
        "Application process requires financial evidence and university approval",
        "Only one application per NHS funded year"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Loans and grants Repaying your loans Repayments Play video Key facts on interest for student loans It's about what you earn, not what you owe If you have taken out a Maintenance Loan or Tuition Fee Loan via the Student Loans Company, then the repayments will only begin once: you have left university and are in employment you are earning £25,000 or more a year Repayments are linked to your earnings and not the loan itself, so the amount you owe in total will have no effect on your repayments. Instead, the amount you repay per month is calculated on how much you're earning above the threshold. Loan repayments are calculated at 9% of the amount you're earning over the threshold for the plan you are on.* If you have taken out both a Maintenance Loan and Tuition Fee Loan, the two loans will be added together, and monthly repayments will be deducted from your salary on a sliding scale depending on your income. *To find out what Repayment Plan you fall under and more information regarding repayments, see the GOV.UK page. Students from Northern Ireland, Scotland and Wales If you normally live in Northern Ireland, Scotland or Wales, your government finance will be dealt with by the authorities in your own region. See the below websites for more information. Northern Ireland: Student Finance NI Scotland: Student Awards Agency for Scotland Wales: Student Finance Wales",
    "metadata": {
      "title": "Repaying your loans",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/repayments",
      "category": "Undergraduate Funding",
      "subcategory": "Loans and Grants",
      "key_points": [
        "Repayments begin once you have left university and are earning £25,000 or more per year",
        "Repayments are based on your earnings, not the total loan amount",
        "Loan repayments are 9% of your earnings above the threshold",
        "If you have multiple loans, they will be added together for repayment",
        "Students from Northern Ireland, Scotland, and Wales have different repayment processes"
      ]
    }
  },
  {
    "content": "Imperial College understands that some Muslim students and members of other faiths may not take out the UK Government Student Loans due to the interest that is added to the repayments which may be considered as Sharia non-compliant. The Department for Education is working towards a Sharia-compliant funding system. Students in Wales can receive a partial Maintenance Loan and Maintenance Grant, and can choose to receive just the grant. The Imperial Bursary is non-repayable and Sharia-compliant. There are also scholarships and the Student Experience Fund available. For Sharia-compliant banking and funding, students can look into AI Rayan Bank, The National Zakat Foundation, United Bank UK, and Ansar Finance.",
    "metadata": {
      "title": "Student funding and Sharia law",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/student-funding-sharia-law",
      "category": "Fees and funding",
      "subcategory": "Loans and grants",
      "key_points": [
        "Imperial understands some students may not take out UK student loans due to Sharia law",
        "Department for Education is working on Sharia-compliant funding system",
        "Wales students can receive partial Maintenance Loan and Grant, or just the Grant",
        "Imperial Bursary is non-repayable and Sharia-compliant",
        "Scholarships and Student Experience Fund available",
        "Sharia-compliant banking and funding options include AI Rayan Bank, National Zakat Foundation, United Bank UK, and Ansar Finance"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Loans and grants Tuition fee loan Tuition fee loan EU fee rates from 2021 EU students will no longer be able to claim tuition fee loans or the lower EU fee rates for programmes starting from 2021. Continuing students, who commence prior to 2021, will retain their fees and funding for the duration of the programme. Introduction to student finance in 2022/23 No fees upfront If you are a Home student, you can apply for a Tuition Fee Loan from the UK government. This will cover the entire cost of tuition for every year of study, which means you do not have to pay any money towards your fees while you are studying. The loan is not means-tested so, unlike the Maintenance Loan for living costs, it doesn't matter what your household income is. At Imperial, the undergraduate tuition fee for Home students at the College is £9,250 for the 2023-24 academic year. Tuition Fees for contnuing Home students will remain at £9,250 per year for 2023-24 entry. Do I have to pay it back? Yes, but only once you have left university, are in employment and earning above the repayment threshold. Tuition fee loan FAQs How does it work? The funding authority for your region (e.g. Student Finance England for students living in England) pays your Tuition Fee Loan directly to the College to cover the cost of your tuition for every year that you apply for the loan. The money is paid to the College in three installments over the course of each academic year. How do I apply? The application process varies depending on whether you are from England, Scotland, Wales or Northern Ireland. Do I have to pay it back? Yes, but only once you have left university, are in employment and earning a pre-tax salary of £26,575 a year or more (confirmed for English students but not Welsh students yet). Student finance for EU, Swiss, Norwegian, Icelandic or Liechtenstein nationals from August 2021 EU/EEA/Swiss students starting a course on or after 1 August ...",
    "metadata": {
      "title": "Tuition fee loan",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/tuition-loan",
      "category": "Fees and Funding",
      "subcategory": "Undergraduate Funding",
      "key_points": [
        "EU students will no longer be eligible for tuition fee loans or lower EU fee rates from 2021",
        "Home students can apply for a Tuition Fee Loan to cover the entire cost of tuition",
        "The Tuition Fee Loan is not means-tested, unlike the Maintenance Loan",
        "Tuition fees for continuing Home students will remain at £9,250 per year",
        "Tuition Fee Loan is paid directly to the university in installments",
        "Application process varies by home country (England, Scotland, Wales, NI)",
        "Repayment of Tuition Fee Loan starts after graduation, once earning above the threshold"
      ]
    }
  },
  {
    "content": "Home students, fees and funding, undergraduate funding, US student loans, ineligible courses, application process, payment and disbursement, satisfactory academic progress, repayment, code of conduct, and special circumstances.",
    "metadata": {
      "title": "US student loans",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/us-loans",
      "category": "Fees and Funding",
      "subcategory": "US Student Loans",
      "key_points": [
        "Federal Direct Loans are available to U.S. citizens and permanent residents studying at Imperial College London",
        "Eligible students can apply for Subsidized, Unsubsidized, Parent PLUS, and Graduate PLUS loans",
        "Detailed information on the application process, payment/disbursement, and repayment requirements",
        "Satisfactory Academic Progress is required to maintain loan eligibility",
        "Special circumstances may allow for adjustments to the Cost of Attendance or dependency status"
      ]
    }
  },
  {
    "content": "Home Imperial students Fees and funding Undergraduate funding Loans and grants US student loans Consumer Disclosure Institutuitions which participate in the Title IV Scheme and provide Federal loans are required to disclose the information below. Exit Counseling The submission of Exit Counseling is mandatory before a student withdraws or graduates, or if they drop below half-time enrolment. Student financial aid information Information on the following topics can be found on our US student loans webpages Withdrawal and return of funds If you interrupt your study, withdraw or fall below half-time enrolment you must inform the Student Financial Support team immediately. Loan funds must be returned in the following order: Federal Direct Loans Federal Direct Sunsubsidized loans (awarded to undergraduate students only) Federal PLUS and Grad PLUS loans. Students right to review educational records The Family Educational Rights and Privacy Act (FERPA) does not apply in the UK. Vaccinations policy This information is available on our Imperial College Health Care Centre webpages. Services and facilities for students with disabilities Information about services and facilities for students with disabilities including intellectual disabilities, is available from the Disability Advisory Service. Terms and conditions under which students receive Federal Direct loans These are defined on our US student loans webpage and also on the Federal Direct Loans and Federal Student Aid webpages. Transfer of Credit Policies These can be found on the Academic Regulations webpage. National Student Loan Data System (NSLDS) If you borrow Federal loans we will submit details of your loan and enrolment to National Student Loan Data System (NSLDS). Textbook information Information about any required and recommended textbooks for your course will be provided to you by your department. Retention rates Information on the University's retention rate is available on the UKPIs: Non-continuation rates web...",
    "metadata": {
      "title": "Consumer Disclosure",
      "url": "https://www.imperial.ac.uk/students/fees-and-funding/undergraduate-funding/loans-and-grants/us-loans/consumer-disclosure",
      "category": "undergraduate",
      "subcategory": "Fees and Funding",
      "key_points": [
        "Institutions that participate in the Title IV Scheme and provide Federal loans must disclose certain information",
        "Exit Counseling is mandatory before withdrawing or graduating",
        "Information on US student loans is available on the website",
        "Withdrawal and return of funds processes are defined",
        "FERPA does not apply in the UK, GDPR and UK Data Protection Act 2018 apply",
        "Vaccination policy, disability services, and textbook information are available",
        "Retention, completion, and graduation rates are published",
        "Drug and alcohol abuse prevention resources are provided",
        "Entrance and PLUS Counseling requirements are outlined",
        "Title IV Loan Code of Conduct prohibits certain practices",
        "Certain programs are ineligible for Federal Aid",
        "Leave of Absence policies are defined",
        "Placement (post-study employment) rates are available",
        "Safeguarding policy is published"
      ]
    }
  }
]