[
  {
    "content": "We're here to support you through all stages of your housing journey, from your first-year experience in halls to moving out into the private sector. Our accommodation vision 2020-2030 sets out our ambitions for first-year undergraduates, and you can find out more about our rent strategy. We want your feedback on your hall experience to help us improve - take our Annual Hall Survey 2022-23.",
    "metadata": {
      "title": "About us",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us",
      "category": "Accommodation",
      "subcategories": [
        "Accommodation Vision",
        "Rent Strategy",
        "Annual Hall Survey 2022-23"
      ],
      "key_points": [
        "Support for housing journey from halls to private sector",
        "Accommodation vision for first-year undergraduates",
        "Information on rent strategy",
        "Feedback survey to improve hall experience"
      ]
    }
  },
  {
    "content": "Imperial College aims to provide comfortable, safe, and affordable on-campus accommodation for all first-year undergraduates. The university owns and operates its own halls to ensure high-quality facilities and support services. Rents for first-year undergraduate halls are set to be competitive with similar accommodation in the local market and at other comparable London universities, with the goal of breaking even rather than making a surplus. This approach allows the university to renew and maintain the first-year undergraduate accommodation portfolio for future generations of students.",
    "metadata": {
      "title": "Accommodation vision",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/accommodation-vision",
      "category": "About us",
      "key_points": [
        "Imperial provides on-campus accommodation for all first-year undergraduates",
        "Halls are owned and operated by the university to ensure quality",
        "Rents are set to be competitive and to cover costs, not make a profit",
        "This approach allows for ongoing maintenance and renewal of the accommodation"
      ]
    }
  },
  {
    "content": "Provides contact information for various Imperial College London departments, including the Student Accommodation Office, Halls at Silwood Park Campus, the Student Hub, the Imperial College Admissions Office, and the Imperial College Disabilities Officer.",
    "metadata": {
      "title": "Contact us",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/contacts",
      "category": "About us",
      "key_points": [
        "Contact information for student accommodation, admissions, and disabilities services",
        "Includes phone, email, and physical address details",
        "Covers both the main campus and Silwood Park campus"
      ]
    }
  },
  {
    "content": "Imperial College is dedicated to providing high-quality service to students. If you have feedback, whether a suggestion, compliment, or complaint, we want to hear it. We aim to listen carefully, respond promptly and politely, provide explanations or apologies, keep you updated, and be open and honest. Most issues can be resolved informally with the staff or team involved. For unresolved complaints, you can escalate to the Village Manager, Student Accommodation Office Manager, Head of Residential Services, or Director of Campus Services. The Imperial College Students' Union can also provide advice and representation. We are committed to the Student Accommodation Code of Practice, and you can contact the Office of the Independent Adjudicator if you are still unsatisfied.",
    "metadata": {
      "title": "Comments, Compliments and Complaints",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/feedback",
      "category": "About us",
      "subcategory": "Feedback and Complaints",
      "key_points": [
        "Imperial College aims to provide high-quality service and welcomes feedback",
        "Most issues can be resolved informally with staff or teams involved",
        "Unresolved complaints can be escalated through management hierarchy",
        "Imperial College Students' Union can provide advice and representation",
        "College is committed to the Student Accommodation Code of Practice",
        "Unsatisfied students can contact the Office of the Independent Adjudicator"
      ]
    }
  },
  {
    "content": "Annual Halls Survey to understand student experience and improve accommodation offerings.",
    "metadata": {
      "title": "Annual Halls Survey",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/hallsfeedback",
      "category": "About us",
      "key_points": [
        "Annual survey to get feedback from students on accommodation",
        "Helps to identify areas for improvement and maintain what's working well",
        "Students can participate in the survey and be entered into a prize draw",
        "Previous survey results are available for reference"
      ]
    }
  },
  {
    "content": "Our approach to hall rents focuses on providing fairly priced, comfortable, and safe accommodation for first-year undergraduates. The college owns and self-manages its halls to ensure high quality and fair pricing, offering a range of rooms at competitive rates compared to similar universities and the private sector. They follow a 'break-even model' to avoid profiting or losing on the halls, and offer 38-39 week contracts to match the actual period students need accommodation.",
    "metadata": {
      "title": "Our approach to hall rents",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/our-approach-to-hall-rents",
      "category": "About us",
      "key_points": [
        "College owns and self-manages halls for quality and fair pricing",
        "Offers range of rooms at competitive rates compared to other universities and private sector",
        "Follows 'break-even model' to avoid profit or loss on halls",
        "Offers 38-39 week contracts to match student accommodation needs"
      ]
    }
  },
  {
    "content": "Our approach to hall rents, including information on why the college wants to own its own accommodation, the break-even model, how rent rates are determined, how Imperial's accommodation compares to other institutions, the definition of 'affordable' accommodation, and financial assistance available for students.",
    "metadata": {
      "title": "Hall Cost FAQs",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/our-approach-to-hall-rents/cost-faqs",
      "category": "About us",
      "key_points": [
        "College wants to own its own accommodation to meet student expectations",
        "Break-even model to be fair to all students",
        "Rent rates determined by room type, facilities, and location",
        "Imperial accommodation is comparable to or lower than other institutions",
        "Affordability considers maintenance loans, average living costs, and bursaries",
        "Financial support available for students"
      ]
    }
  },
  {
    "content": "Our approach to hall rents. We aim to provide a range of affordable options while ensuring halls are well-maintained and staffed to support students. Rent covers accommodation staff, support staff, estates costs, long-term maintenance, and capital costs. We meet and exceed affordability recommendations, with competitive rents compared to similar universities and consideration of student finance and living costs.",
    "metadata": {
      "title": "The cost of our halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/our-approach-to-hall-rents/hall-costs",
      "category": "About us",
      "key_points": [
        "Provide range of affordable hall options",
        "Ensure halls are well-maintained and staffed",
        "Rent covers various operational and capital costs",
        "Meet affordability recommendations with competitive rents"
      ]
    }
  },
  {
    "content": "This policy sets out how the Student Hub and Residential Services at Imperial College London collect, store and use your personal data. It covers the types of information collected, how it is obtained, the legal basis for processing, and with whom the data is shared. The policy also addresses data storage, retention, and circumstances under which you may be contacted. Updates to the policy will be posted on the website.",
    "metadata": {
      "title": "Privacy Policy",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/privacy-policy",
      "category": "About us",
      "key_points": [
        "Covers personal data collected by Student Hub and Residential Services",
        "Explains legal basis and purposes for data processing",
        "Outlines data sharing with third parties",
        "Describes data storage, retention, and circumstances for contacting students",
        "Notes that policy will be updated and changes communicated"
      ]
    }
  },
  {
    "content": "The Student Resident Engagement Strategy outlines how Imperial College London communicates with and involves students residing in its owned and managed accommodation regarding building safety. This includes regular updates, opportunities for feedback, and clear responsibilities for both the college and the students.",
    "metadata": {
      "title": "Student Resident Engagement Strategy",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/resident-engagement-strategy",
      "category": "About us",
      "key_points": [
        "Ensure safety is a top priority with clear communication and engagement",
        "Provide regular updates on safety-related activities and any disruptions",
        "Actively seek student input and feedback to shape safety strategies",
        "Outline responsibilities for both the college and the students",
        "Review the strategy annually, incorporating student comments"
      ]
    }
  },
  {
    "content": "The Student Accommodation Code protects your rights to a quality home, including a healthy, safe environment, timely repairs and maintenance, a clean, pleasant living environment, a formal, contractual relationship with your landlord, access to health and wellbeing services, and a living environment free from anti-social behaviour.",
    "metadata": {
      "title": "The Student Accommodation Code",
      "url": "https://www.imperial.ac.uk/students/accommodation/about-us/uuk",
      "category": "About us",
      "key_points": [
        "Protects your rights to a quality home",
        "Ensures healthy, safe, and clean living environment",
        "Provides a formal, contractual relationship with landlord",
        "Offers access to health and wellbeing services",
        "Guarantees a living environment free from anti-social behaviour"
      ]
    }
  },
  {
    "content": "Continuing students have options to stay in halls after the first year, including Evelyn Gardens, Parsons House, and Xenia. Continuing Undergraduate Applications, Hall Seniors, and Medical and Wellbeing applications provide further information and options.",
    "metadata": {
      "title": "Continuing students",
      "url": "https://www.imperial.ac.uk/students/accommodation/continuing-students",
      "category": "Accommodation",
      "subcategory": "Continuing Students",
      "key_points": [
        "Options to stay in halls after the first year",
        "Specific halls available for continuing students",
        "Application process for continuing undergraduate accommodation",
        "Hall Seniors and medical/wellbeing considerations"
      ]
    }
  },
  {
    "content": "Putney Boathouse provides self-catered single study room accommodation for 8 students. It is located on the Putney Embankment overlooking the River Thames and has been the home of the Imperial College Boat Club since 1938. The accommodation is specifically for elite Imperial rowing athletes and is reviewed termly. Rent includes utility bills, internet access, basic contents insurance, maintenance, communal cleaning, and a contribution to the halls activity fund.",
    "metadata": {
      "title": "Putney Boathouse",
      "url": "https://www.imperial.ac.uk/students/accommodation/continuing-students/boathouse",
      "category": "Accommodation",
      "subcategory": "Continuing Students",
      "key_points": [
        "8 self-catered single study room accommodation",
        "Located on the Putney Embankment overlooking the River Thames",
        "Home to the Imperial College Boat Club since 1938",
        "Specifically for elite Imperial rowing athletes",
        "Rent includes utilities, internet, insurance, maintenance, cleaning, and activity fund"
      ]
    }
  },
  {
    "content": "Continuing students can apply to become Hall Seniors, which involves supporting the running of their residence hall for an additional year. Hall Seniors are responsible for organizing events, preparing the hall for the new year, providing wellbeing and pastoral support, and managing finances. They also receive a discounted accommodation rate. Applications are made through the eHalls system when it is open, and details can be found on the individual hall websites.",
    "metadata": {
      "title": "Hall Seniors",
      "url": "https://www.imperial.ac.uk/students/accommodation/continuing-students/hall-seniors",
      "category": "Accommodation",
      "subcategory": "Continuing Students",
      "key_points": [
        "Hall Seniors are continuing students who support the running of their residence hall",
        "Responsibilities include organizing events, preparing for the new year, providing pastoral support, and managing finances",
        "Hall Seniors receive a discounted accommodation rate",
        "Applications are made through the eHalls system and details are on the individual hall websites"
      ]
    }
  },
  {
    "content": "Applications for continuing student housing are now closed. Thank you for your interest.",
    "metadata": {
      "title": "How to Apply",
      "url": "https://www.imperial.ac.uk/students/accommodation/continuing-students/how-to-apply-",
      "category": "Accommodation",
      "subcategory": "Continuing Students"
    }
  },
  {
    "content": "FAQs about Imperial College London's continuing undergraduate accommodation options, including information on available halls, license lengths, room sharing, and other amenities.",
    "metadata": {
      "title": "Continuing Undergraduate Accommodation FAQs",
      "url": "https://www.imperial.ac.uk/students/accommodation/continuing-students/how-to-apply-/faqs",
      "category": "Undergraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Evelyn Gardens, Xenia, and Parsons House are only available for continuing undergraduate students, not first-year students",
        "Continuing halls have 24-hour reception, Resident Assistants, but no Wardens",
        "Licenses are 39 weeks, with possible summer extensions (except for final year students)",
        "Rooms have shared toilets/showers, unisex",
        "Wi-Fi is available in all bedrooms, but wired internet is faster",
        "No bike storage is provided",
        "Evelyn Gardens has no lifts, Xenia has lifts up to the 4th floor",
        "No waiting lists or room swaps are available"
      ]
    }
  },
  {
    "content": "Continuing students will be offered first refusal to remain in their current halls of residence (Evelyn, Parsons and Xenia) for the following academic year. Current residents will be contacted in April to confirm their interest. Applications for all other continuing undergraduate students will open in mid-late May. After current residents are allocated, remaining applications will be reviewed on a first-come, first-served basis. Only one offer of accommodation will be provided to each student, based on their preferences. Not all applicants may receive an offer, and the webpage will be updated when all rooms are allocated.",
    "metadata": {
      "title": "How We Allocate",
      "url": "https://www.imperial.ac.uk/students/accommodation/continuing-students/how-to-apply-/how-we-allocate",
      "category": "Accommodation",
      "subcategory": "Continuing Students",
      "key_points": [
        "Current residents get first refusal to remain in their halls",
        "Applications for other continuing students open in mid-late May",
        "Offers based on preferences, first-come first-served basis",
        "Not all applicants may receive an offer"
      ]
    }
  },
  {
    "content": "Parsons House is a 46-bed student accommodation located near Charing Cross Hospital in West Kensington. It offers self-catered single study rooms in cluster flats, with shared bathrooms, kitchens, and common areas. The accommodation includes utilities, internet, insurance, maintenance, and cleaning. Residents have access to facilities in the neighboring Golding House, such as a common room with TV, computers, and a pool table, as well as a shared garden. The location provides easy access to the main South Kensington campus by bike or tube.",
    "metadata": {
      "title": "Parsons House",
      "url": "https://www.imperial.ac.uk/students/accommodation/continuing-students/parsons",
      "category": "Accommodation",
      "subcategory": "Continuing Students",
      "key_points": [
        "46-bed student accommodation near Charing Cross Hospital",
        "Self-catered single study rooms in cluster flats",
        "Shared facilities including bathrooms, kitchens, and common areas",
        "Access to nearby Golding House amenities",
        "Convenient location for reaching South Kensington campus"
      ]
    }
  },
  {
    "content": "Evelyn Gardens offers continuing undergraduate students a more independent living experience compared to first-year accommodation. Located in a safe, managed environment near South Kensington campus, the accommodation provides a range of room types with varying weekly rents. Residents have access to shared kitchens, common rooms, and communal gardens, along with 24-hour support from Village staff and Resident Assistants. The 39-week contracts include utility bills, internet, and cleaning services.",
    "metadata": {
      "title": "Evelyn Gardens",
      "url": "https://www.imperial.ac.uk/students/accommodation/continuing-students/returning-students-accommodation",
      "category": "Undergraduate Accommodation",
      "subcategory": "Continuing Students",
      "key_points": [
        "Undergraduate housing option for continuing students",
        "Offers more independent living experience compared to first-year",
        "Range of room types and weekly rents available",
        "Shared amenities and 24-hour support services",
        "39-week contracts include utilities, internet, and cleaning"
      ]
    }
  },
  {
    "content": "Xenia offers 166 self-catered study accommodations for undergraduate students in the heart of London, near Waterloo Station and the River Thames. The residence includes a variety of room types with different features and rents, as well as shared kitchen and common areas, study rooms, and other amenities. Xenia is conveniently located close to cultural attractions and the main South Kensington campus, with easy access to public transportation.",
    "metadata": {
      "title": "Xenia",
      "url": "https://www.imperial.ac.uk/students/accommodation/continuing-students/xenia",
      "location": "Waterloo, London",
      "room_types": [
        {
          "type": "Ensuite single",
          "size": "<10sqm",
          "price": "£248/week",
          "count": 63
        },
        {
          "type": "Ensuite single",
          "size": ">10.1sqm",
          "price": "£261/week",
          "count": 55
        },
        {
          "type": "Standard single",
          "size": "<10sqm",
          "price": "£188/week",
          "count": 18
        },
        {
          "type": "Standard single",
          "size": ">10.1sqm",
          "price": "£196/week",
          "count": 4
        },
        {
          "type": "En-suite twin",
          "price": "£178/week",
          "count": 2
        },
        {
          "type": "Standard twin",
          "size": "<12sqm",
          "price": "£152/week",
          "count": 4
        },
        {
          "type": "Standard twin",
          "size": ">12.1sqm",
          "price": "£157/week",
          "count": 20
        }
      ],
      "amenities": [
        "Shared bathrooms and shower rooms",
        "Fitted work stations in some twin rooms",
        "Individual wired internet and wireless coverage",
        "Access to nearby kitchens with individual cupboards and shared fridges",
        "WiFi in communal areas",
        "Games room",
        "Internal courtyard with patio",
        "Laundry facilities",
        "Monthly bedroom cleaning service",
        "Lifts serving 4 out of 6 floors",
        "Secure entry system and 24-hour CCTV"
      ],
      "location_details": [
        "Located in Waterloo, near the River Thames",
        "Close to the Old Vic, Young Vic, and Globe theatres, as well as Bankside and the Southbank Centre",
        "5-minute walk to the tube station, 30-minute bike ride to the South Kensington campus"
      ]
    }
  },
  {
    "content": "Current residents can make themselves at home and enjoy the facilities and services in halls. Imperial aims to provide quality accommodation and ensure a safe, positive living environment through various services and policies. Residents with health conditions or disabilities can receive additional support, and there are opportunities to take personal action towards sustainability.",
    "metadata": {
      "title": "Current residents",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents",
      "category": "accommodation",
      "subcategory": "Current Residents",
      "key_points": [
        "Enjoy the facilities and services in halls",
        "Imperial provides quality accommodation and a safe environment",
        "Support available for residents with health conditions or disabilities",
        "Opportunities to take personal action towards sustainability"
      ]
    }
  },
  {
    "content": "Current residents must depart halls by 10:00 on Saturday, June 29. Residents should clear their rooms, dispose of waste properly, remove all belongings, return keys, and complete the Annual Halls Survey. Residents transferring to summer accommodation cannot check in until 16:00 on the same day but can store luggage earlier. Detailed departure procedures and recycling/donation information are provided for each hall.",
    "metadata": {
      "title": "Departures",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/departures",
      "category": "Accommodation",
      "subcategory": "Departures",
      "key_points": [
        "Departure deadline is 10:00 on June 29",
        "Clear rooms, dispose of waste, return keys",
        "Complete Annual Halls Survey",
        "Summer residents can store luggage before 16:00 check-in",
        "Detailed departure procedures for each hall"
      ]
    }
  },
  {
    "content": "Residents must take reasonable care for their own and others' safety while using College premises. Fire safety, electrical safety, and kitchen safety are important considerations. Personal safety is also emphasized, including letting others know when leaving overnight and closing windows for security. Window restrictors have been installed for compliance with regulations.",
    "metadata": {
      "title": "Health and safety",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/health-and-safety",
      "category": "Accommodation",
      "subcategory": "Health and Safety",
      "key_points": [
        "Adopt safe practices and use safety facilities provided",
        "Electrical equipment must be compatible with UK voltage and standards",
        "Cooking appliances should be attended and turned off after use",
        "Let others know when leaving overnight for safety",
        "Window restrictors installed for compliance and security"
      ]
    }
  },
  {
    "content": "Imperial College London's student accommodation has robust fire safety measures in place, including automatic fire detection, alarms, regular audits, and 24/7 trained staff response. Residents must adhere to fire safety guidelines, such as not tampering with equipment, familiarizing themselves with emergency escape routes, and keeping fire doors closed. Failure to comply can result in prosecution and fines. Personal Emergency Evacuation Plans (PEEPs) are available for residents with mobility or sensory impairments. To prevent false alarms, residents should take precautions like using kitchen windows to dissipate smoke, avoiding open flames, and closing doors when showering.",
    "metadata": {
      "title": "Fire safety",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/health-and-safety/fire-safety",
      "category": "Accommodation",
      "subcategory": "Health and Safety",
      "key_points": [
        "Robust fire safety measures in place in student accommodation",
        "Residents must follow fire safety guidelines to prevent incidents",
        "Failure to comply can lead to prosecution and fines",
        "Personal Emergency Evacuation Plans (PEEPs) available for residents with special needs",
        "Precautions to prevent false alarms, such as using kitchen windows and avoiding open flames"
      ]
    }
  },
  {
    "content": "Current residents can earn £100 per day by becoming accommodation tour guides for prospective students and their families during the College's Open Day events on June 26-27 and September 14. Applicants must be friendly, enthusiastic, and able to work the full day on both June 26 and 27. A compulsory training session will be held during the week of June 17. Successful applicants will be provided with a t-shirt and lunch, in addition to the daily wage. Priority will be given to those who have completed the Rector's Ambassador Scheme and Departmental Open Day training, but applications from outgoing and passionate students are welcome.",
    "metadata": {
      "title": "Open day jobs",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/open-day-jobs",
      "category": "accommodation",
      "subcategory": "open day jobs",
      "key_points": [
        "Earn £100 per day as an accommodation tour guide",
        "Guides required for College Open Day events on June 26-27 and September 14",
        "Applicants must be friendly, enthusiastic, and able to work full days",
        "Compulsory training session during week of June 17",
        "Successful applicants receive t-shirt, lunch, and daily wage",
        "Priority given to Rector's Ambassador Scheme and Departmental Open Day participants"
      ]
    }
  },
  {
    "content": "Guidelines for living in a residential community, including policies, procedures, and resources related to living in halls of residence.",
    "metadata": {
      "title": "Policies and Guidelines",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/policies-and-guidelines",
      "category": "Accommodation",
      "subcategory": "Policies and Guidelines",
      "key_points": [
        "Guidelines for living in a residential community",
        "Policies and procedures related to living in halls of residence",
        "Resources like the Living Guide",
        "Information on comments, compliments, complaints, health, safety, security, insurance, and TV license"
      ]
    }
  },
  {
    "content": "Policies and procedures for moving rooms and departing college halls of residence at Imperial College London, including the process for completing a Notice to Quit, returning keys, liability for rent payments, and requesting room transfers.",
    "metadata": {
      "title": "Moving rooms and departing halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/policies-and-guidelines/transfer-and-departure",
      "category": "Student Accommodation",
      "subcategory": "Policies and Procedures",
      "key_points": [
        "Complete a Notice to Quit to leave college accommodation",
        "Return keys by 10 am on the day of departure",
        "Liable for rent payments until room is re-let or license period ends",
        "Requests to move rooms considered only for medical/wellbeing reasons"
      ]
    }
  },
  {
    "content": "You need a TV license if you watch or record live TV or BBC iPlayer, regardless of the device used. The license costs £157.50 and can be paid in installments. Halls of residence have a communal TV license, but you may need one for your own TV in your room. If you have a joint tenancy, one license covers the whole property, but if you have a separate contract, you'll need a separate license. You can get a refund if you're moving out for the summer. No license is needed if you only watch on-demand content on non-BBC platforms.",
    "metadata": {
      "title": "TV Licence",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/policies-and-guidelines/tv-licence",
      "category": "Accommodation",
      "subcategory": "Policies and Guidelines",
      "key_points": [
        "TV license required for live TV and BBC iPlayer",
        "Cost of £157.50, can be paid in installments",
        "Halls have communal license, but personal TV may need separate license",
        "Joint tenancy covers whole property, separate contracts need individual licenses",
        "Eligible for refund when moving out for summer",
        "No license needed for on-demand non-BBC content"
      ]
    }
  },
  {
    "content": "Ensure you have your College ID card, follow safety protocols, secure your belongings, and be aware of emergency procedures to stay safe and secure on campus.",
    "metadata": {
      "title": "Security, Health and Safety",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/security-health-and-safety",
      "category": "Accommodation",
      "subcategory": "Safety and Security",
      "key_points": [
        "Carry your College ID card at all times",
        "Comply with local hall rules and College safety policies",
        "Lock your room, doors, and windows for security",
        "Report lost cards and keys immediately",
        "Use the SafeZone app for emergency assistance",
        "Secure your bicycle with a D-lock",
        "Be aware of fire safety measures in your halls"
      ]
    }
  },
  {
    "content": "Current residents can access various services in their halls, including internet/phone, reporting issues, cleaning, laundry, and mail. The College Union also provides a free, confidential advice service for students.",
    "metadata": {
      "title": "Services in halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services",
      "categories": [
        "Accommodation",
        "Student Services"
      ],
      "key_points": [
        "Connectivity services (internet, phone)",
        "Reporting and resolving issues",
        "Cleaning and laundry facilities",
        "Mail handling procedures",
        "Free, confidential advice from the College Union"
      ]
    }
  },
  {
    "content": "Residents are responsible for the upkeep and cleanliness of their bedroom, shower-room, flat corridor and kitchen. Cleaning staff maintain the overall cleanliness of halls, but residents must cooperate by clearing floors, clearing basins, disposing of rubbish properly, and placing dirty laundry in the provided basket. Halls provide cleaning equipment like vacuum cleaners, mops and buckets, and dustpans/brushes. Formal room inspections are conducted during term time to check for damages, safety issues, cleanliness, and excessive rubbish. Residents will be notified in advance and have the opportunity to address any issues before the inspection.",
    "metadata": {
      "title": "Cleaning",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services/cleaning",
      "category": "Accommodation",
      "subcategory": "Cleaning",
      "key_points": [
        "Residents responsible for cleaning their own rooms and shared spaces",
        "Cleaning staff maintain overall cleanliness, but residents must cooperate",
        "Halls provide cleaning equipment for resident use",
        "Formal room inspections held to check for cleanliness and issues"
      ]
    }
  },
  {
    "content": "The Imperial College Union Advice Service provides information and advice to current students on various issues, including academic matters, student accommodation, complaints, and more. The service is free, confidential, and independent from the College, benefiting students who have concerns about the College and prefer not to use internal services. The Advice Service offers different levels of support, from information and referrals to representation and advocacy. Students can also request food bank vouchers if they are experiencing financial difficulties. To access the service, students need to email advice@imperial.ac.uk and complete a registration form.",
    "metadata": {
      "title": "College Union Advice Service",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services/college-union-advice-service",
      "category": "Student Services",
      "subcategory": "Advice and Support",
      "key_points": [
        "The Advice Service provides information and advice to current students",
        "Covers academic issues, accommodation, complaints, and more",
        "Free, confidential, and independent from the College",
        "Offers different levels of support, including representation and advocacy",
        "Students can request food bank vouchers for financial assistance",
        "To access the service, students must email and complete a registration form"
      ]
    }
  },
  {
    "content": "Current residents, services in halls, insurance, and security information for students staying in Imperial College London's residence halls. Key points include details on the student contents insurance provided through Endsleigh, the importance of reviewing coverage, and access to resources like the Safe and Secure Guide.",
    "metadata": {
      "title": "Insurance and Security in Halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services/insurance",
      "category": "Student Life",
      "subcategory": "Accommodation",
      "key_points": [
        "Free contents insurance provided through Endsleigh",
        "Need to register and confirm coverage details",
        "Resources available on security and safety in halls and across London",
        "Copies of insurance certificates available from Hall Supervisors"
      ]
    }
  },
  {
    "content": "Residents can access the internet and phone services in their college halls. To use the internet, students need to register their devices on the Student Halls Network service. WiFi is available in communal areas, but some smart devices may not be compatible. Residents can also use 'in-room' WiFi units in certain halls. Telephone services are provided, with free internal calls and chargeable external calls. Residents can log any phone or internet faults with the IT helpdesk.",
    "metadata": {
      "title": "Internet and phone",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services/internet-and-phone",
      "category": "Accommodation",
      "subcategory": "Internet and Phone",
      "key_points": [
        "Register devices on Student Halls Network to access internet",
        "WiFi available in communal areas, but some smart devices not compatible",
        "'In-room' WiFi units available in certain halls",
        "Free internal calls, chargeable external calls on telephone service",
        "Report phone or internet faults to IT helpdesk"
      ]
    }
  },
  {
    "content": "Information about laundry services and etiquette in residential halls, including instructions for using the machines, reporting problems, and local procedures.",
    "metadata": {
      "title": "Laundry",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services/laundry",
      "key_points": [
        "Read instructions before using the machines",
        "Bring your own washing supplies",
        "Don't overload the machines",
        "Close machine doors properly before starting",
        "Clean the tumble dryer filter before use",
        "Remove your laundry as soon as possible",
        "Laundry rooms have washers, dryers, irons, and ironing boards (not to be used in bedrooms)",
        "Report any problems to the laundry service provider",
        "Provide hall name, machine details, and room number when reporting issues",
        "Also report faults to hall staff"
      ]
    }
  },
  {
    "content": "Current residents, services in halls, and mail delivery information for various Imperial College London residence halls, including Beit Hall, Eastside Halls, Southside Halls, Wilson House, Woodward Buildings, and Xenia.",
    "metadata": {
      "title": "Mail",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services/mail",
      "category": "Accommodation",
      "subcategory": "Current Residents",
      "key_points": [
        "Each hall has individual lockable mailboxes for students",
        "Packages too large for mailboxes are delivered to a central location and students are notified",
        "Detailed address information provided for each hall"
      ]
    }
  },
  {
    "content": "This page explains how to report any problems or concerns with your student accommodation at Imperial College London. It covers the process for reporting non-urgent defects, the schedule for maintenance contractors to visit each hall, and how to handle urgent issues like emergencies or pest control problems. The content also addresses expectations around contractor access to student rooms and the need for students to prepare their space before a visit.",
    "metadata": {
      "title": "Reporting problems in halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services/report",
      "category": "Student Life",
      "subcategory": "Accommodation",
      "key_points": [
        "Report non-urgent defects using an online form",
        "Maintenance contractors visit halls on a weekly schedule",
        "Urgent issues like emergencies or pests should be reported to hall staff",
        "Students must prepare their room before a contractor visit",
        "Contractors will leave a record of their visit and work done"
      ]
    }
  },
  {
    "content": "Current residents can access services in halls and report any problems using the defect form.",
    "metadata": {
      "title": "Defect form",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services/report/defectform",
      "category": "Accommodation",
      "subcategory": "Reporting Issues",
      "key_points": [
        "Access services in halls",
        "Report problems using the defect form"
      ]
    }
  },
  {
    "content": "Current residents, services in halls, utilities, heating information, and guidelines on use of space heaters in residences.",
    "metadata": {
      "title": "Utilities",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/services/utilities",
      "category": "Student Accommodation",
      "subcategory": "Utilities",
      "key_points": [
        "Heating in halls is centrally controlled and maintained at around 20°C",
        "Heating is scheduled for a few hours in the morning and evenings on weekdays, and more often on weekends or during college closures",
        "Report any consistent under or over heating to the Hall Supervisor",
        "Space heaters are banned in bedrooms except in limited circumstances where the building systems cannot provide adequate heating"
      ]
    }
  },
  {
    "content": "Imperial students can stay in Evelyn Gardens, Kemp Porter, and Xenia halls over the summer, with availability ranging from one week to the whole summer. Summer accommodation is available from June 29 to September 21. Rooms can be booked in weekly blocks, and prices vary depending on the length of stay and hall. To be eligible, students must be enrolled at Imperial for the duration of their stay. Applications are now open and allocated on a first-come, first-served basis. Detailed information on room types, pricing, and hall amenities is provided.",
    "metadata": {
      "title": "Summer in halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/summer-in-halls",
      "category": "accommodation",
      "subcategory": "summer housing",
      "key_points": [
        "Imperial students can stay in halls over the summer",
        "Availability ranges from 1 week to the whole summer",
        "Rooms can be booked in weekly blocks, with varying prices",
        "Students must be enrolled at Imperial for their stay",
        "Applications are on a first-come, first-served basis"
      ]
    }
  },
  {
    "content": "Imperial College London offers summer accommodation in halls for eligible students, including Imperial College pre-sessional English, UROP and Medical Elective students. Stays can be booked in weekly blocks of 1 to 12 weeks, and full payment must be made before arrival. Cancellation policies and procedures are outlined, with refunds only available in certain circumstances. Amenities and facilities in the halls are described, including check-in/check-out times, security, internet access, and communal areas. Students are advised to bring their own bedding and kitchen supplies, as these are not provided.",
    "metadata": {
      "title": "Frequently asked questions",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/summer-in-halls/frequently-asked-questions",
      "category": "Accommodation",
      "subcategory": "Summer in Halls",
      "key_points": [
        "Summer accommodation available for eligible Imperial College students",
        "Bookings can be made in weekly blocks of 1 to 12 weeks",
        "Full payment required before arrival, with limited refund options",
        "Amenities and facilities described, including security and internet access",
        "Students must bring their own bedding and kitchen supplies"
      ]
    }
  },
  {
    "content": "College is committed to reducing environmental impact, with sustainable initiatives like e-inductions, Sustainable Halls campaign, recycling, and end-of-year donation schemes. Students are expected to follow the three R's: reduce, reuse, recycle. Various engagement activities aim to build sustainability knowledge and encourage student leadership on environmental projects.",
    "metadata": {
      "title": "Sustainability",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/sustainability",
      "category": "Accommodation",
      "subcategory": "Sustainability",
      "key_points": [
        "College has sustainable initiatives like e-inductions and Sustainable Halls campaign",
        "Students expected to reduce, reuse, and recycle",
        "Engagement activities build sustainability knowledge and encourage student leadership",
        "Recycling and end-of-year donation schemes available"
      ]
    }
  },
  {
    "content": "Current residents must manage waste and recycling responsibly. Glass bottles, cans, tins, hard plastics, paper, card, and food can be recycled. Proper recycling reduces environmental impact and fire hazards. Rinsing items before recycling helps maintain quality. Coated paper/card cannot be recycled. The system has green bins for recyclables and black bins for waste, with additional glass/paper/card segregation on campus. Some halls compost food waste. Reducing waste, reusing items, and recycling are encouraged. Unwanted clothes/shoes can be donated. An end-of-year reuse scheme in halls diverts items to good causes.",
    "metadata": {
      "title": "Recycling",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/sustainability/recycling",
      "category": "Sustainability",
      "subcategory": "Recycling",
      "key_points": [
        "Proper waste management and recycling is required",
        "Recyclable items include glass, cans, plastics, paper, card, and food",
        "Rinsing items and avoiding coated materials improves recycling quality",
        "The system uses dedicated green and black bins, with additional segregation",
        "Some halls compost food waste",
        "Reducing, reusing, and recycling are encouraged",
        "Unwanted items can be donated through end-of-year schemes"
      ]
    }
  },
  {
    "content": "The Sustainable Halls Campaign at Imperial College London encourages students living in halls to take personal action against the climate crisis. Through the campaign, students can learn about sustainability, act on sustainability tips, and lead by volunteering as campaign volunteers. The hall that engages the most with the campaign can win a £250 prize for their chosen charity. Last year, the campaign reached 82,600 students who saved 860,000kWh of electricity, equivalent to powering a lightbulb for over 6,500 years. To get involved, students can enter a competition to win a £25 voucher and sign up to be a volunteer in their hall.",
    "metadata": {
      "title": "Sustainable Halls Campaign",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/sustainability/sustainable-halls-campaign",
      "category": "Accommodation",
      "subcategory": "Sustainability",
      "key_points": [
        "Encourages students in halls to take action against climate crisis",
        "Offers learning, action, and leadership opportunities",
        "Engaging the most can win a £250 charity prize",
        "Last year's campaign saved significant electricity",
        "Students can enter a competition and volunteer"
      ]
    }
  },
  {
    "content": "Current residents, vacancies in halls, useful information on re-sit and repeating students, and details on Silwood Park campus accommodation.",
    "metadata": {
      "title": "Vacancies in Halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/vacancies",
      "categories": [
        "Current Residents",
        "Vacancies in Halls",
        "Useful Information",
        "Silwood Park"
      ],
      "key_points": [
        "Vacancies available for postgraduate students with courses based at Silwood Park",
        "No waiting list, interested students should apply directly",
        "Silwood Park is a campus located outside of London, ineligible for London-based students"
      ]
    }
  },
  {
    "content": "Current residents, vacancies, and students repeating first year or transferring departments may have limited accommodation options. Accommodation availability and eligibility varies throughout the year, with debt checks also impacting housing offers.",
    "metadata": {
      "title": "Students repeating their first year",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/vacancies/repeat",
      "categories": [
        "Accommodation",
        "First-Year Students"
      ],
      "key_points": [
        "Current residents and vacancies may have limited options",
        "Students repeating first year or transferring departments may not be guaranteed accommodation",
        "Accommodation availability changes throughout the year",
        "Debt checks can impact eligibility for housing offers"
      ]
    }
  },
  {
    "content": "Information about accommodation options for students returning to campus for resit exams, including details on applying for short-term 'Student Summer Accommodation' if your course has ended or you are on an Interruption of Studies.",
    "metadata": {
      "title": "Students returning for resits",
      "url": "https://www.imperial.ac.uk/students/accommodation/current-residents/vacancies/resit",
      "category": "Accommodation",
      "subcategory": "Resit Exams",
      "key_points": [
        "Opportunities for short-term accommodation during resit exams",
        "Application process for 'Student Summer Accommodation'",
        "Accommodation not guaranteed for resit students"
      ]
    }
  },
  {
    "content": "This document covers frequently asked questions (FAQs) for prospective undergraduates, prospective postgraduates, and current students. Topics include application process, accepting offers, facilities, arrival, Silwood Park, room swaps, hall policies, and general help.",
    "metadata": {
      "title": "FAQs",
      "url": "https://www.imperial.ac.uk/students/accommodation/faqs",
      "category": "student-resources",
      "subcategory": "faqs",
      "key_points": [
        "Covers FAQs for prospective undergraduates, prospective postgraduates, and current students",
        "Topics include application process, accepting offers, facilities, arrival, Silwood Park, room swaps, hall policies, and general help"
      ]
    }
  },
  {
    "content": "FAQs about room swapping, leaving halls, smoking policy, cleaning, and pets in halls for current Imperial College London students.",
    "metadata": {
      "title": "Current students",
      "url": "https://www.imperial.ac.uk/students/accommodation/faqs/current-students",
      "category": "Accommodation",
      "subcategory": "Current Students",
      "key_points": [
        "Room swapping is only allowed under exceptional circumstances with a fee",
        "Students must complete a 'notice to quit' form to leave halls before the end of the contract",
        "Friends cannot take over a student's room contract",
        "First-year students are guaranteed halls, but upper-year students must find private accommodation",
        "Imperial is a smoke-free environment, with designated smoking areas outside",
        "Students are responsible for keeping their rooms clean, with cleaning services provided",
        "Pets are not allowed in halls, except for registered assistance dogs"
      ]
    }
  },
  {
    "content": "Key details about applying for and living in accommodation at Imperial College's Silwood Park campus as a postgraduate student, including information on accommodation guarantees, room preferences, room allocation timelines, bringing partners/families, transportation, and what to bring. Also covers internet access and policies around field work.",
    "metadata": {
      "title": "Prospective Postgraduates",
      "url": "https://www.imperial.ac.uk/students/accommodation/faqs/prospective-postgraduates",
      "category": "Accommodation",
      "subcategory": "Postgraduate",
      "key_points": [
        "Accommodation is likely but not guaranteed for Silwood Park postgrads",
        "Can specify 2 equally ranked preferences for room type and price",
        "Accommodation offers come in early September, after academic offer conditions are met",
        "Limited options for bringing partners/families to Silwood Park",
        "Nearby train stations and campus parking/bike storage available",
        "Need to bring own bedding, kitchenware, and electrical adapters",
        "Internet access provided via wired ethernet and wireless in common areas",
        "Accommodation fees may be adjustable for field work periods"
      ]
    }
  },
  {
    "content": "FAQs for prospective undergraduate students on applying for and moving into Imperial College London's halls of residence, including information on room allocation, arrival procedures, prohibited items, and facilities.",
    "metadata": {
      "title": "Prospective Undergraduates",
      "url": "https://www.imperial.ac.uk/students/accommodation/faqs/prospective-undergraduates",
      "category": "Accommodation",
      "subcategory": "Prospective Undergraduates",
      "key_points": [
        "Updating personal details with UCAS and department required",
        "Cannot change accommodation preferences after submission",
        "Accommodation allocation is randomized, with some exceptions",
        "Need to accept offer within deadline to avoid losing room",
        "Arrival day is set, no early move-ins allowed",
        "Certain items are prohibited in halls for safety reasons",
        "Rooms come equipped with basic furniture and fittings",
        "Rents are based on room type, facilities, and location"
      ]
    }
  },
  {
    "content": "Prepare for your transition to university halls with this comprehensive induction, covering essential information like what to bring, arrival day details, and available support services.",
    "metadata": {
      "title": "Moving into halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/moving-into-halls",
      "category": "Accommodation",
      "subcategory": "Moving In",
      "key_points": [
        "Complete the pre-arrival induction to ease your transition",
        "Familiarize yourself with what to bring and not bring",
        "Review arrival day information and security/safety details",
        "Utilize available services and support in the halls"
      ]
    }
  },
  {
    "content": "Start your private housing journey with Imperial's private accommodation services, which provide information, support, and events to guide you through the process. Explore options, get help with contracts and rent guarantees, and begin your private housing search.",
    "metadata": {
      "title": "Private accommodation",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation",
      "category": "Accommodation",
      "subcategory": "Private Housing",
      "key_points": [
        "Start your private housing journey with Imperial's support",
        "Get information, support, and attend events for private accommodation",
        "Explore options, get help with contracts and rent guarantees",
        "Begin your private housing search with Imperial Home Solutions"
      ]
    }
  },
  {
    "content": "Offers additional support and suggestions for finding private housing, including private halls of residence, commuting options, living with a landlord, using local estate agents, and accessing college resources like Yammer and Imperial Home Solutions. Provides information on managing bills and costs, and notes that on-campus college halls are now full for the 2023-24 academic year.",
    "metadata": {
      "title": "Additional support",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/additional-support",
      "category": "Accommodation",
      "subcategory": "Private Housing",
      "key_points": [
        "Suggestions for finding private housing options",
        "Private halls of residence, commuting, living with a landlord",
        "Using college resources like Yammer and Imperial Home Solutions",
        "Advice on managing bills and costs",
        "College halls of residence are now full for 2023-24"
      ]
    }
  },
  {
    "content": "Private accommodation events, including an exhibition, are being held to help Imperial College London students find private housing. The events will feature various private hall providers, local agents, landlords, and other service providers from across London. The Student Accommodation Office will also be present to answer questions about the private housing process. Registration is required to attend the events.",
    "metadata": {
      "title": "Private Housing Events",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/events",
      "category": "Accommodation",
      "subcategory": "Private Housing",
      "key_points": [
        "Private accommodation events for Imperial College London students",
        "Meet private hall providers, agents, landlords, and other service providers",
        "Student Accommodation Office available to answer questions",
        "Registration required to attend the events"
      ]
    }
  },
  {
    "content": "Navigating private housing can be overwhelming, but Imperial College London's Private Housing Masterclass is designed to guide you through each step of the process. The masterclass covers six short courses, including researching before the search, property viewings, understanding contracts, moving in, tenant rights and responsibilities, and moving out. Additionally, the college has launched an Area Guide to help you find the location that best suits your needs.",
    "metadata": {
      "title": "Private Housing Masterclass",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/masterclass",
      "category": "Accommodation",
      "subcategory": "Private Housing",
      "key_points": [
        "Masterclass covers 6 courses to guide you through private housing process",
        "Courses include pre-search research, viewings, contracts, moving in/out, and tenant rights",
        "Area Guide helps you find the right location",
        "Resources available throughout the year to use as needed"
      ]
    }
  },
  {
    "content": "Imperial Home Solutions offers free private accommodation services for Imperial students, including a wide range of property choices, property management tools, and customizable search options to help students find their perfect home.",
    "metadata": {
      "title": "Imperial Home Solutions",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/private-accommodation",
      "category": "Accommodation",
      "subcategory": "Private Housing",
      "key_points": [
        "Imperial Home Solutions provides free private accommodation services for students",
        "Offers a wide range of property choices",
        "Provides property management tools like favorite lists and customizable alerts",
        "Helps students find their ideal home"
      ]
    }
  },
  {
    "content": "Imperial's Student Accommodation Team provides support for students in both halls and private accommodation, including contract checking, rent guarantee schemes, and information on local agents and other housing providers.",
    "metadata": {
      "title": "Support Services",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services",
      "category": "Accommodation",
      "subcategory": "Support",
      "key_points": [
        "Student Accommodation Team supports students in halls and private housing",
        "Contract checking and rent guarantee schemes available",
        "Information provided on local agents and other housing providers"
      ]
    }
  },
  {
    "content": "Ensure you thoroughly review and understand your housing contract before signing. Get the contract checked by someone you trust, such as parents or a solicitor, or use the university's contract checking tool. Be cautious of landlords or agents who won't let you take the contract away to review it first. Check if any holding deposits are refundable if you decide not to take the property. Housing contracts can vary in length, language, and included clauses, so it's important to be confident in what you are agreeing to.",
    "metadata": {
      "title": "Contract checking",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/contract-checking",
      "category": "Accommodation",
      "subcategory": "Contract Review",
      "key_points": [
        "Review housing contracts carefully before signing",
        "Use university contract checking services or get help from trusted sources",
        "Be cautious of landlords who won't let you take the contract away",
        "Check if any holding deposits are refundable",
        "Housing contracts can vary, so ensure you understand all terms"
      ]
    }
  },
  {
    "content": "Explore various housing options, including Imperial Home Solutions, letting agents, private halls, and other service providers. Imperial Home Solutions offers a one-stop-shop for finding accommodation, searching properties, posting housing requests, and getting advice. Letting agents can help with finding and managing properties. Private halls provide a transitional experience between halls of residence and independent living. Other service providers offer additional support, such as bedding packs, house-finding services, and guarantor services.",
    "metadata": {
      "title": "Agents and other providers",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/listings",
      "category": "Accommodation",
      "subcategory": "Support Services",
      "key_points": [
        "Imperial Home Solutions provides a one-stop-shop for finding accommodation",
        "Letting agents can help with finding and managing properties",
        "Private halls offer a transitional experience between halls of residence and independent living",
        "Other service providers offer additional support, such as bedding packs and house-finding services"
      ]
    }
  },
  {
    "content": "Private accommodation options, support services, and information on letting agents and accommodation agents. Key points include: 1) Letting agents advertise properties on behalf of landlords and manage the process until the tenant moves in. 2) Managing agents can also handle property management, collecting rent, and repairs. 3) New legislation in 2019 limits the fees that can be charged to tenants, including banning charges for viewing properties, referencing, and contract renewals.",
    "metadata": {
      "title": "Letting agents",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/listings/letting-agents",
      "category": "Accommodation",
      "subcategory": "Letting Agents",
      "key_points": [
        "Letting agents advertise properties and manage the process for landlords",
        "Managing agents can also handle property management tasks",
        "New legislation limits the fees that can be charged to tenants"
      ]
    }
  },
  {
    "content": "Private accommodation, support services, agents, and other providers. Letting agents in London are listed, including Amber & Co, Broadway and West, Chestertons, Dexters, EC Residential, Hybr, Lero Property, Marsh & Parsons, Onslows, Residential Land, RR Properties, Russell Simpson, Studios 2 Let, and tlc Estate Agents. The provided information includes contact details and website links for these agents. Students are advised to thoroughly read the terms and conditions of any contracts and be aware of potential charges.",
    "metadata": {
      "title": "List of local agents",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/listings/letting-agents/tips",
      "category": "Accommodation",
      "subcategory": "Private Accommodation",
      "key_points": [
        "List of local letting agents in London",
        "Contact details and website links for the agents",
        "Advise students to read contracts and be aware of charges",
        "Agents have not been vetted by the university"
      ]
    }
  },
  {
    "content": "Private accommodation options, support services, and external accommodation providers in the Silwood Park area are listed, including contact information for local letting agents and websites for providers like Prestige Student Living, IQ Student Accommodation, CRM Students, Derwent Students, and Here Students.",
    "metadata": {
      "title": "Silwood Park agents",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/listings/letting-agents/tips/silwood-park-agents",
      "category": "Accommodation",
      "subcategory": "Private Accommodation",
      "key_points": [
        "Private accommodation options in Silwood Park",
        "Support services and listing of local letting agents",
        "External accommodation providers with websites",
        "Contact information for various agents and providers"
      ]
    }
  },
  {
    "content": "Private accommodation support services, agents and other providers that offer services such as homestay accommodation, serviced apartments, student bedding packs, house finding services, or guarantor services for students searching for or moving into private accommodation. These service providers have not been vetted by the Student Accommodation Office, so students should use them at their own risk.",
    "metadata": {
      "title": "Other service providers",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/listings/other-service-providers",
      "category": "Accommodation",
      "subcategory": "Private Accommodation Support Services",
      "key_points": [
        "List of companies providing private accommodation services",
        "Services include homestay, apartments, bedding, house finding, guarantor",
        "Service providers not vetted by the university",
        "Students should use these services at their own risk"
      ]
    }
  },
  {
    "content": "Explore private accommodation options, including staying in Imperial's halls of residence or private halls, which offer a range of room types and facilities. Consider the benefits of a transitional living experience in Imperial's continuing student accommodation. Familiarize yourself with the available support services and hall providers to make the best choice for your needs.",
    "metadata": {
      "title": "Private halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/listings/private-halls",
      "category": "Accommodation",
      "subcategory": "Private Halls",
      "key_points": [
        "Staying in Imperial's halls of residence for another year provides a transitional living experience",
        "Private hall providers offer a range of room types and facilities in London",
        "Explore support services and hall providers to find the best option",
        "Consider the benefits of private accommodation versus on-campus options"
      ]
    }
  },
  {
    "content": "Explore various private accommodation options, including purpose-built properties for postgraduate living, private halls near the Silwood Park Campus, and a range of other providers in London. Be aware that these private halls have not been vetted by the Student Accommodation Office, so use them at your own risk.",
    "metadata": {
      "title": "List of private halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/listings/private-halls/list-of-private-halls",
      "category": "Accommodation",
      "subcategory": "Private Halls",
      "key_points": [
        "Variety of private accommodation options in London",
        "GradPad for postgraduate living near South Kensington and White City campuses",
        "Private halls near Silwood Park Campus listed",
        "Private providers not vetted by the Student Accommodation Office"
      ]
    }
  },
  {
    "content": "The college provides a Rent Guarantee Scheme for Imperial College undergraduate students who require a UK-based guarantor to secure private accommodation. The scheme covers rent up to £275 per week for a 12-month period, and is not available to postgraduate students. Eligibility criteria include being a full-time registered student with no outstanding debts, providing a satisfactory accommodation reference, and demonstrating the ability to pay rent. The application process involves uploading required documentation, paying an admin fee, and signing agreements with the landlord. The college does not sign any external paperwork or contracts, and the guarantee is limited to 12 months, with the option to renew if the contract is longer.",
    "metadata": {
      "title": "Rent Guarantee Scheme",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/rent-guarantee-scheme",
      "category": "Accommodation",
      "subcategory": "Support Services",
      "key_points": [
        "College provides Rent Guarantee Scheme for undergraduates",
        "Covers rent up to £275 per week for 12 months",
        "Eligibility criteria include being a full-time registered student with no outstanding debts and ability to pay rent",
        "Application process involves uploading documentation, paying admin fee, and signing agreements",
        "College does not sign external contracts, and guarantee is limited to 12 months with option to renew"
      ]
    }
  },
  {
    "content": "The information provided covers the terms and conditions of Imperial College London's Rent Guarantee Scheme for continuing full-time registered undergraduate students. It outlines the eligibility criteria, the College's responsibilities as a guarantor, the students' obligations, and the consequences of defaulting on rent payments or providing false information. The key points include the 12-month guarantee period, the need for a satisfactory landlord reference and proof of financial means, the exclusion of students in private halls or with existing tenancy agreements, and the requirement to inform the College of any changes to enrollment or financial status.",
    "metadata": {
      "title": "Terms and Conditions",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/support-services/rent-guarantee-scheme/terms-and-conditions",
      "category": "Accommodation",
      "subcategory": "Rent Guarantee Scheme",
      "key_points": [
        "The Rent Guarantee Scheme is available to continuing full-time registered undergraduate students at Imperial College London for the 2023/2024 academic year only",
        "The College can only act as a guarantor for a period of 12 months, with the possibility of renewal",
        "Applicants must have exhausted all other options to find a UK-based guarantor and provide a satisfactory landlord reference",
        "Students must be able to demonstrate the financial means to pay the rent",
        "The College will only guarantee a pre-agreed amount of up to £275 per week, and will not cover additional charges",
        "Students must inform the College of any changes to their enrollment or financial status",
        "If the College has to pay out under the scheme, the student must enter into a debt management plan to repay the amount"
      ]
    }
  },
  {
    "content": "This section provides guidance on the process of finding and securing private accommodation, including tips for viewing properties, understanding fees and deposits, obtaining references and guarantors, and navigating legal checks and contracts.",
    "metadata": {
      "title": "Found somewhere",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/test-pages/found-somewhere",
      "category": "Accommodation",
      "subcategory": "Private Accommodation",
      "key_points": [
        "Tips for viewing properties and negotiating contracts",
        "Understanding fees, deposits, references, and guarantors",
        "Importance of legal checks and understanding contracts"
      ]
    }
  },
  {
    "content": "This document provides information on private accommodation, specifically regarding fees and deposits. It explains the Tenant Fees Act of 2019, which bans most letting fees and caps tenancy deposits for private renters in England. The document outlines what fees tenants can and cannot be charged, as well as guidance on holding deposits, including what should be included in the receipt and what happens when a holding deposit is paid. It also covers what happens when a tenancy agreement is entered into or if either the tenant or landlord changes their mind.",
    "metadata": {
      "title": "Fees and deposits",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/test-pages/found-somewhere/fees-and-deposits",
      "category": "Accommodation",
      "subcategory": "Fees and Deposits",
      "key_points": [
        "Tenant Fees Act 2019 bans most letting fees and caps tenancy deposits",
        "Outlines fees tenants can and cannot be charged",
        "Provides guidance on holding deposits, including receipt and process",
        "Covers what happens when a tenancy agreement is entered into or if either party changes their mind"
      ]
    }
  },
  {
    "content": "Landlords and tenants both have obligations to check legal requirements for providing or receiving accommodation. Landlords must check the immigration status of prospective tenants, and tenants should verify the legal property owner. Properties with three or more unrelated people sharing facilities (HMOs) may require a license, and landlords operating an HMO without a license can face prosecution. Tenants should report unlicensed HMOs to the local council.",
    "metadata": {
      "title": "Legal checks",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/test-pages/found-somewhere/legal-checks",
      "category": "Accommodation",
      "subcategory": "Legal Requirements",
      "key_points": [
        "Landlords must check tenants' immigration status",
        "Tenants should verify the legal property owner",
        "HMOs may require a license, and unlicensed HMOs are illegal",
        "Tenants should report unlicensed HMOs to the local council"
      ]
    }
  },
  {
    "content": "Viewing and evaluating potential private accommodations is an important part of the housing search process. Key considerations include safety, taking detailed notes and photos, asking relevant questions, and negotiating contract terms. Virtual viewings can provide some insight but should not replace in-person inspections. Careful evaluation and documentation of any promises or required work is crucial before signing a legally binding agreement.",
    "metadata": {
      "title": "Viewing a property",
      "url": "https://www.imperial.ac.uk/students/accommodation/private-accommodation/test-pages/found-somewhere/viewing-a-property",
      "category": "Accommodation",
      "subcategory": "Private Housing",
      "key_points": [
        "Evaluate property safety and condition through in-person viewing",
        "Take detailed notes and photos to compare options",
        "Ask landlord/agent relevant questions about costs, requirements, etc.",
        "Negotiate contract terms, including any requested work or inclusions",
        "Approach virtual tours with caution, as they do not replace in-person visits"
      ]
    }
  },
  {
    "content": "We look forward to welcoming you into our community. Undergraduate applications for the 2023-24 academic year will open in late May. The prices on our website are for the 2023-24 academic year and will be updated before applications open. It may become necessary to amend these dates or processes as they get nearer. Accommodation information is available for both prospective undergraduates and postgraduates, including the application process, cost, and hall options.",
    "metadata": {
      "title": "Prospective Students",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective",
      "category": "Accommodation",
      "subcategory": "Prospective Students",
      "key_points": [
        "Undergraduate applications for 2023-24 open in late May",
        "Prices and dates may be updated as the process gets nearer",
        "Accommodation information available for undergraduates and postgraduates",
        "Accommodation application process, cost, and hall options details provided"
      ]
    }
  },
  {
    "content": "Prospective postgraduate students can explore various accommodation options, including halls on the Silwood Park Campus, GradPad, and private housing in London. The university provides information on how to apply, fees and payments, and disability and welfare support.",
    "metadata": {
      "title": "Postgraduate",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg",
      "category": "accommodation",
      "subcategory": "postgraduate",
      "key_points": [
        "Accommodation options for postgraduate students",
        "Halls on Silwood Park Campus, GradPad, and private housing in London",
        "Information on application process, fees, and support services"
      ]
    }
  },
  {
    "content": "Prospective students can find postgraduate accommodation options through GradPad, private rentals, or halls of residence at the Silwood Park Campus.",
    "metadata": {
      "title": "Postgraduate accommodation",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/accommodation",
      "category": "Accommodation",
      "subcategory": "Postgraduate",
      "key_points": [
        "GradPad properties designed for postgraduate living",
        "London has a wide range of private rental options",
        "Silwood Park Campus has single and couples accommodation"
      ]
    }
  },
  {
    "content": "Private accommodation options near Silwood Park campus, including commutable areas and advice on renting.",
    "metadata": {
      "title": "Private accommodation",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/accommodation/private-accommodation",
      "category": "Accommodation",
      "subcategory": "Private Housing",
      "key_points": [
        "Postgraduate students at Silwood Park are not guaranteed a space in halls",
        "Private accommodation options are available in nearby areas like Wokingham, Bracknell, Cheapside, Slough, and Virginia Water",
        "Advice on finding and renting private accommodation, including using letting agencies and private landlords",
        "Caution advised when signing contracts or paying money without viewing the property first",
        "Short-term accommodation options like Spareroom and Airbnb available",
        "Students should check for break clauses or early termination options"
      ]
    }
  },
  {
    "content": "Silwood Park is a postgraduate campus of Imperial College London, located in Ascot, Berkshire. It offers a range of accommodation options, including single, double, and studio rooms, as well as one-bedroom flats. The campus provides modern facilities for research and teaching in ecology, evolution, and conservation, set in a 100-hectare parkland. Students studying at Silwood Park can choose from five separate halls of residence: Brian Flowers, John Smith, Southwood, William Penney, and Mary Flowers. Due to ongoing refurbishment, some students may need to relocate within Silwood Park. The campus is not available for students studying at the London campuses.",
    "metadata": {
      "title": "Silwood Park (not based in London)",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/accommodation/silwood-park",
      "category": "postgraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Silwood Park is a postgraduate campus of Imperial College London",
        "Located in Ascot, Berkshire, it offers a range of accommodation options",
        "Modern facilities for research and teaching in ecology, evolution, and conservation",
        "Students may need to relocate within the campus due to refurbishment",
        "Not available for students studying at the London campuses"
      ]
    }
  },
  {
    "content": "Prospective students can explore postgraduate accommodation options at Imperial's Silwood Park campus, including Brian Flowers Hall. Brian Flowers is a 2-floor residence with 8 study bedrooms and a kitchen per floor, offering a social space with TV. Rents include utilities, internet, insurance, maintenance, and cleaning, paid termly. The hall has a 51-week contract period and features like individual internet/phone access, shared bathrooms, and campus sports facilities. Brian Flowers is located at the Silwood Park campus in Ascot, with nearby post office, stores, and train station connections.",
    "metadata": {
      "title": "Brian Flowers",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/accommodation/silwood-park/brian-flowers",
      "category": "Postgraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "2-floor residence with 8 study bedrooms and a kitchen per floor",
        "Rents include utilities, internet, insurance, maintenance, and cleaning",
        "51-week contract period with individual internet/phone access and shared facilities",
        "Located at Silwood Park campus in Ascot, near amenities and transportation"
      ]
    }
  },
  {
    "content": "John Smith Hall is a postgraduate accommodation option located at Imperial College London's Silwood Park Campus in Ascot, Berkshire. The hall features standard single rooms with 3' x 6'3\" beds, shared bathroom facilities, and shared kitchens with TVs. Rent includes utilities, internet, contents insurance, maintenance, and cleaning, and is paid on a termly basis. The hall has a 51-week contract period and additional features like a laundry room, bike shed, and access to campus sports facilities.",
    "metadata": {
      "title": "John Smith",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/accommodation/silwood-park/john-smith",
      "category": "Postgraduate",
      "subcategory": "Accommodation",
      "location": "Silwood Park (not based in London)",
      "key_points": [
        "Standard single rooms with 3' x 6'3\" beds",
        "Shared bathroom facilities and kitchens",
        "Rent includes utilities, internet, insurance, and more",
        "51-week contract period with additional features"
      ]
    }
  },
  {
    "content": "Prospective Students, Postgraduate, Postgraduate accommodation, Silwood Park (not based in London), Mary Flowers, Mary Flowers Virtual Tour. Mary Flowers is located at the front of the main residence village, set over two floors with flats ideal for couples and independent living. Rent includes utilities, internet, insurance, maintenance, cleaning, and a halls activity fund. Flats are subject to council tax, with student exemption. Mary Flowers has a 51-week contract period and features like washers, bathrooms, kitchens, Wi-Fi, and social areas. The campus has sports facilities and secure access.",
    "metadata": {
      "title": "Mary Flowers",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/accommodation/silwood-park/mary-flowers",
      "category": "Postgraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Mary Flowers is located at Silwood Park campus",
        "Flats are suitable for couples and independent living",
        "Rent includes utilities, internet, insurance, maintenance, and more",
        "Flats are subject to council tax with student exemption",
        "51-week contract period with various amenities and facilities"
      ]
    }
  },
  {
    "content": "Prospective students can explore postgraduate accommodation options at Imperial College London's Silwood Park campus, specifically the Southwood halls. These halls are located at the heart of the residences village and offer a variety of room types with different weekly rents. The rents include utility bills, internet access, basic contents insurance, maintenance, communal cleaning, and a contribution towards the halls' activity fund. The contract period is 51 weeks. The halls feature shared bathrooms, kitchens, common areas, a TV room, and a laundry room. Secure access and 24-hour CCTV are also provided.",
    "metadata": {
      "title": "Southwood",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/accommodation/silwood-park/southwood",
      "category": "Postgraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Southwood halls located at Silwood Park campus",
        "Variety of room types with different weekly rents",
        "Rents include utilities, internet, insurance, and more",
        "51-week contract period",
        "Shared facilities and amenities with secure access"
      ]
    }
  },
  {
    "content": "Prospective Students Postgraduate Postgraduate accommodation Silwood Park (not based in London) William Penney William Penney William Penney Virtual Tour William Penney is a hall for those on a limited budget and is offered at a competitive rental fee as compared to the rest of our single standard rooms. Whilst it is limited in comparison to other halls on this Campus in certain aspects (kitchens are shared between 14 students, there is no common room, bathroom/toilet facilities are also slightly more limited than other halls) room sizes and room furniture are as generous and comparable with our other halls at Silwood. Please note the building is compact and rooms are close together so if you are particularly sensitive to noise this hall may not be suitable for you. William Penney in more detail Room types and rents The rents for 2024-25 are as follows: Type of room Number of bed spaces Weekly rent Standard single 13 £109 s All beds in William Penney are 3' x 6'3\" (0.91m x 1.90m) Visit Fees and Payment page for more information William Penney has a 51 week contract period. Features and facilities Hall features and facilities: Room Each study bedroom has individual internet and telephone access and TV aerial point (licence required) Shared bathrooms facilities Kitchen and common areas Shared kitchens with TVs Shared fridges and freezers Individual food storage cupboard No common room Other features and facilities Fully-equipped coin /card operated laundry room No smoking residence Car parking allowed with permit Bike shed available Secure swipe card access 24-hour front entrance CCTV Summary of the table's contents Location Address: William Penney Hall Imperial College London Silwood Park Campus Buckhurst Road Ascot Berks, SL5 7PY View location on map William Penney is a short distance away from the other halls on Silwood Park Campus. Silwood Park is within walking distance of a post office and general store, and local bus services operate twice daily. Connections to places further a field may be made from Ascot or Sunningdale mainline train stations. For directions to the hall please click here.",
    "metadata": {
      "title": "William Penney",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/accommodation/silwood-park/william-penney",
      "category": "Postgraduate",
      "subcategory": "Accommodation",
      "location": "Silwood Park",
      "key_points": [
        "William Penney is a hall for those on a limited budget",
        "It has shared kitchens, no common room, and limited bathroom facilities",
        "Room sizes and furniture are comparable to other halls",
        "The building is compact with close-together rooms, so it may not be suitable for noise-sensitive students",
        "Rents for 2024-25 start at £109 per week for a standard single room",
        "William Penney has a 51-week contract period",
        "The hall has basic amenities like shared kitchens, laundry room, and secure access",
        "It is located in Silwood Park, a short distance from other halls on the campus"
      ]
    }
  },
  {
    "content": "Postgraduate students whose studies are based at Silwood Park campus can apply for accommodation via AccHub. Late May, applicants who have firmly accepted an academic offer will receive an email invite to apply. Allocation of rooms will be done in early September, and successful applicants will receive a 'Licence to Occupy' with their hall and room type. Applicants must accept the offer and make payment by the deadline to secure the accommodation. If the offer is rejected, the room will be reallocated, and an alternative offer is unlikely. Moving in day varies from year to year. Postgraduate students can also apply for GradPad accommodation near the South Kensington campus.",
    "metadata": {
      "title": "How to apply",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/apply",
      "category": "Accommodation",
      "subcategory": "Postgraduate",
      "key_points": [
        "Apply for Silwood Park campus accommodation via AccHub",
        "Receive email invite to apply in late May if you have accepted an academic offer",
        "Accommodation offers made in early September, with a deadline to accept and pay",
        "If offer rejected, room will be reallocated and alternative offer unlikely",
        "Moving in day varies year to year",
        "Postgraduate students can also apply for GradPad accommodation"
      ]
    }
  },
  {
    "content": "Imperial College London offers various accommodations and support services for prospective postgraduate students with disabilities or special requirements. Applicants should indicate any special needs or requirements during the online application process to ensure suitable accommodations are provided, including rooms for live-in helpers if needed. All GradPad properties have rooms suitable for disabled students, and the Disability Advisory Service is available to provide more information and support.",
    "metadata": {
      "title": "Disability and welfare",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/disability",
      "category": "Postgraduate",
      "subcategory": "Disability and welfare",
      "key_points": [
        "Indicate any special accommodation needs or requirements during application",
        "Accessible rooms available in GradPad properties",
        "Disability Advisory Service provides information and support"
      ]
    }
  },
  {
    "content": "Detailed information on fees and payment options for prospective postgraduate students, including GradPad, Silwood Park, and various on-campus accommodation types.",
    "metadata": {
      "title": "Fees and payment",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/pg/fees",
      "category": "Postgraduate",
      "subcategory": "Fees and payment",
      "key_points": [
        "GradPad and Silwood Park fees and payment details",
        "Rent includes utilities, internet, insurance, maintenance, and cleaning",
        "Variety of room types and costs for on-campus accommodation",
        "Range of payment methods available to suit students' needs"
      ]
    }
  },
  {
    "content": "Around 90% of undergraduates at Imperial choose to live in our halls of residence in their first year. There are many benefits to living in halls, such as unique hall experiences, all-inclusive rent, quality-assured accommodation, a guaranteed place for first-year students, and 24-hour security and support.",
    "metadata": {
      "title": "Undergraduate Accommodation",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug",
      "category": "Accommodation",
      "subcategory": "Undergraduate",
      "key_points": [
        "Majority of undergraduates live in halls of residence",
        "Halls offer unique community experiences",
        "Rent includes utilities, internet, insurance, and more",
        "Accommodation is quality-assured and secure",
        "First-year students are guaranteed a hall placement",
        "Halls have 24/7 security and support staff"
      ]
    }
  },
  {
    "content": "Prospective students can view and download the College Accommodation Licence for the 2023-24 and 2024-25 academic years. The accommodation contract lengths vary for undergraduate and postgraduate students. The licence is a legally binding agreement, and students are advised to read it carefully. If residing outside the College portfolio, the terms and conditions will be set by the estate agent, landlord, or private provider. The Student Accommodation Office can provide guidance and support for private accommodation inquiries.",
    "metadata": {
      "title": "Accommodation Licence",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/accommodation-contract",
      "category": "Undergraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Accommodation licence details for 2023-24 and 2024-25",
        "Contract lengths vary for undergraduates and postgraduates",
        "Licence is a legally binding agreement, students should read it carefully",
        "Private accommodation terms set by external providers",
        "Student Accommodation Office can provide guidance on private housing"
      ]
    }
  },
  {
    "content": "Prospective Students will be able to compare undergraduate halls, including information on rents, room types, and facilities. Applications for the 2024-25 academic year will open in mid-late May, so keep an eye on the website and social media for updates. Rent includes utility bills, internet access, basic contents insurance, maintenance, communal cleaning, and a contribution to the halls activity fund. Halls vary in room types, number of bed spaces, and weekly rent per person. Distance and transport information is also provided, showing the average time to travel to the main campus. Hall facilities include laundry, TV/game rooms, bike storage, lifts, and in some cases, gym facilities.",
    "metadata": {
      "title": "Compare undergraduate halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/compare",
      "category": "Accommodation",
      "subcategory": "Comparing Halls",
      "key_points": [
        "Upcoming application timeline for 2024-25",
        "Detailed information on room types, rents, and facilities",
        "Travel times and transportation options to campus",
        "Variety of hall options with different amenities"
      ]
    }
  },
  {
    "content": "Imperial College London offers accommodation and support for students with disabilities or medical conditions. Students are encouraged to disclose their requirements when applying for college accommodation, so that appropriate arrangements can be made. The college can provide a range of accommodations, such as ensuite bathrooms, accessible rooms, ground-floor rooms, and additional support like a fridge for medication storage or a vibrating pillow. Students will need to provide evidence from their medical professionals to support their needs. The Disability Advisory Service can also provide information and arrange campus visits for prospective students.",
    "metadata": {
      "title": "Medical, wellbeing and disability",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/disability",
      "category": "Accommodation",
      "subcategory": "Disability and Medical Support",
      "key_points": [
        "Disclose medical/disability requirements when applying for college accommodation",
        "College can provide a range of accommodations and support services",
        "Students need to provide medical evidence to support their needs",
        "Disability Advisory Service can provide information and campus visits"
      ]
    }
  },
  {
    "content": "Imperial College London offers a range of accessible facilities in its undergraduate halls, including specially adapted rooms, kitchens, and common areas to accommodate students with disabilities or additional needs.",
    "metadata": {
      "title": "Accessible facilities in halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/disability/accessiblefacilities",
      "category": "Undergraduate",
      "subcategory": "Disability and Accessibility",
      "key_points": [
        "Specially adapted rooms with low/high beds, emergency pull cords, adjustable sinks, and en-suite showers with seats",
        "Adapted kitchens suitable for students with disabilities",
        "All floors accessible by lift",
        "Additional features like round table corners, electric sockets, vibrating pagers, and visual emergency alarms"
      ]
    }
  },
  {
    "content": "Applying to stay in halls of residence after your first year. If you are an undergraduate student who has medical or wellbeing requirements and would benefit from living in halls after the first year of study, you will have the opportunity to apply to stay in our accommodation for the next academic year. There are a small number of rooms available each year and you will need to apply for a place. Decisions are made by a College panel and are based on the priority of need. You'll be informed of the panel's decision regarding your application once they have met. Applications for the 2024/25 academic year open on Monday 8 January 2024 and close midnight on Monday 19 February 2024.",
    "metadata": {
      "title": "After first year",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/disability/after-first-year",
      "category": "undergraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Opportunity to apply to stay in halls after first year",
        "Limited rooms available, decided by a College panel based on priority of need",
        "Application period for 2024/25 academic year is from January 8 to February 19, 2024",
        "Application supported by Health Centre Doctor, DAS Disability Advisor, or Faculty Senior Tutor",
        "Relevant and up-to-date evidence must be provided"
      ]
    }
  },
  {
    "content": "Prospective students can view information on undergraduate fees and payment options at Imperial College London. Accommodation rents for the 2024-25 academic year are provided, with details on room types, number of bed spaces, and weekly rent per person across various halls. Payment methods are also outlined to suit different needs.",
    "metadata": {
      "title": "Fees and payment",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/fees",
      "category": "Undergraduate",
      "subcategory": "Fees and payment",
      "key_points": [
        "Undergraduate fees and payment information for 2024-25 academic year",
        "Detailed breakdown of accommodation rents across different hall types",
        "Various payment methods available to suit student needs"
      ]
    }
  },
  {
    "content": "Imperial College London offers a wide range of undergraduate halls across London to cater to different preferences and budgets. These halls vary in location, character, and social atmosphere, providing students with a diverse living experience as part of the college community.",
    "metadata": {
      "title": "Undergraduate halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/halls",
      "category": "Accommodation",
      "subcategory": "Undergraduate Halls",
      "key_points": [
        "Wide range of halls available",
        "Halls cater to different tastes and budgets",
        "Halls vary in location, character, and social atmosphere",
        "Halls are part of the Imperial College London community"
      ]
    }
  },
  {
    "content": "Beit Hall is a historic undergraduate residence located in the bustling Beit Quad, offering 339 self-catered bed spaces with a range of room types and rents. The hall is situated in the heart of South Kensington, next to the Royal Albert Hall and Imperial's Royal School of Mines. Residents enjoy convenient access to the Imperial College Union and nearby amenities, but should be aware of higher noise levels due to the colocation with licensed venues. Beit Hall provides a range of features and facilities, including internet access, shared kitchens, common areas, and on-site laundry.",
    "metadata": {
      "title": "Beit Hall",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/halls/beit",
      "category": "undergraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Historic undergraduate residence with 339 bed spaces",
        "Located in the Beit Quad, next to the Royal Albert Hall",
        "Offers a range of room types and rents",
        "Convenient access to the Imperial College Union and nearby amenities",
        "Higher noise levels due to colocation with licensed venues",
        "Provides features and facilities, including internet, shared kitchens, and on-site laundry"
      ]
    }
  },
  {
    "content": "Eastside Halls offer 454 self-catered en-suite rooms for undergraduate students at Imperial College London. The halls are located in Prince's Gardens, just across the road from the main South Kensington campus. Eastside Halls feature a convenience store, common rooms, a student bar and restaurant, and easy access to the college's sports center. The halls are comprised of three adjoining buildings named after notable figures in the college's history: Gabor Hall, Linstead Hall, and Wilkinson Hall. Rooms range from premium en-suite singles to en-suite twins, with weekly rents from £186 to £346 per person. Amenities include telephone and internet access, shared kitchens, laundry facilities, and 24-hour security.",
    "metadata": {
      "title": "Eastside Halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/halls/eastside",
      "category": "Undergraduate Accommodation",
      "subcategory": "Eastside Halls",
      "key_points": [
        "454 self-catered en-suite rooms for undergraduates",
        "Located in Prince's Gardens, near the main campus",
        "Amenities include convenience store, common rooms, and sports center access",
        "Rooms range from premium en-suite singles to en-suite twins",
        "Weekly rents from £186 to £346 per person"
      ]
    }
  },
  {
    "content": "Kemp Porter Buildings is our newest halls of residence, located in North Acton with 708 bed spaces. It offers self-catered accommodation for 701 undergraduate students, with a mix of en-suite single and twin rooms. The halls feature a large common room, open plan kitchen and living areas, study rooms, a games room, and other amenities. Kemp Porter is located just a 2-minute walk from North Acton station, providing easy access to the South Kensington campus and other parts of London.",
    "metadata": {
      "title": "Kemp Porter Buildings",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/halls/kemp-porter",
      "category": "Accommodation",
      "subcategory": "Undergraduate Halls",
      "key_points": [
        "Newest halls of residence with 708 bed spaces",
        "Offers self-catered accommodation for 701 undergraduate students",
        "Mix of en-suite single and twin rooms",
        "Amenities include common room, kitchen/living areas, study rooms, games room",
        "Conveniently located near North Acton station"
      ]
    }
  },
  {
    "content": "Helen Kemp Porter, born in 1899, was a British-Belgian scientist who had a distinguished career at Imperial College London. She excelled in science from a young age, despite coming from a financially-straitened background, and went on to become Imperial's first female professor in 1959. Her pioneering work on plant metabolism and her election to the Royal Society in 1956 cemented her reputation as a leading scientist in her field. She was described as a caring, hardworking, and meticulous mentor who brought out the best in her students and colleagues.",
    "metadata": {
      "title": "Professor Helen Kemp Porter: a profile",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/halls/kemp-porter/professor-helen-kemp-porter-a-profile",
      "category": "biography",
      "subcategory": "scientist",
      "key_points": [
        "Helen Kemp Porter was a distinguished British-Belgian scientist",
        "She excelled in science from a young age despite financial constraints",
        "She became Imperial College's first female professor in 1959",
        "Her pioneering work on plant metabolism earned her election to the Royal Society",
        "She was described as a caring, hardworking, and meticulous mentor"
      ]
    }
  },
  {
    "content": "Southside Halls are located in Prince's Gardens in South Kensington, just a short walk from the main Imperial College campus. The halls provide self-catered accommodation for 397 undergraduate students, with a variety of room types including single and twin en-suite bedrooms. Rent includes utilities, internet, insurance, maintenance, and cleaning. The halls feature shared kitchens, common rooms, and access to nearby sports and convenience facilities.",
    "metadata": {
      "title": "Southside Halls",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/halls/southside",
      "category": "Undergraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Located in Prince's Gardens, South Kensington, near the main campus",
        "397 undergraduate student rooms, including single and twin en-suite options",
        "Rent includes utilities, internet, insurance, maintenance, and cleaning",
        "Shared kitchens, common rooms, and access to nearby facilities"
      ]
    }
  },
  {
    "content": "Wilson House offers self-catered study accommodation for 382 undergraduate students in Paddington, London. The hall features a variety of room types with different weekly rents, including en-suite singles, standard singles, small standard singles with study beds, en-suite twins, and standard twins. Amenities include telephone and wired internet access, shared bathrooms and kitchens, common areas, laundry facilities, bike storage, and access to nearby sports facilities. The hall is located near Paddington Station, local restaurants and cafes, and is within 25-30 minutes of the main South Kensington campus.",
    "metadata": {
      "title": "Wilson House",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/halls/wilson-house",
      "category": "Undergraduate",
      "subcategory": "Residential Halls",
      "key_points": [
        "Self-catered accommodation for 382 undergraduate students",
        "Variety of room types and weekly rents",
        "Amenities include internet, shared facilities, common areas, and more",
        "Conveniently located near Paddington Station and South Kensington campus"
      ]
    }
  },
  {
    "content": "Woodward Buildings offers modern, spacious accommodation for 682 undergraduate students in North Acton, with a range of amenities and excellent transport links. The hall features en-suite rooms, communal spaces, and various facilities like a gym, music rooms, and study areas. Rent includes utilities, internet, insurance, and maintenance. The hall is located near other university halls and is well-connected to the South Kensington campus and central London.",
    "metadata": {
      "title": "Woodward Buildings",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/halls/woodward",
      "category": "Undergraduate Accommodation",
      "subcategory": "Woodward Buildings",
      "key_points": [
        "Modern, spacious accommodation for 682 undergrad students",
        "Located in North Acton with a range of on-site amenities",
        "Rent includes utilities, internet, insurance, and maintenance",
        "Well-connected to South Kensington campus and central London"
      ]
    }
  },
  {
    "content": "Prospective students can apply for undergraduate accommodation at Imperial College London for the 2024-25 academic year. The application process includes submitting preferences, guaranteeing a place in halls if applying before the deadline, and accepting the final accommodation offer. Additional information is provided on the application timeline, room types, payment, and support for students with special needs.",
    "metadata": {
      "title": "How to apply",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/how-to-apply",
      "category": "Undergraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Accommodation application process for 2024-25 academic year",
        "Guaranteed place in halls if applying before July 19 deadline",
        "Preference selection, offer acceptance, and move-in details",
        "Support available for students with special needs or concerns"
      ]
    }
  },
  {
    "content": "Imperial College London guarantees accommodation for all first-year undergraduates, Oxbridge Medics, and students on official exchanges, if they meet certain terms and conditions. These include accepting an offer, submitting an accommodation application by a certain deadline, and being a full-time student for the full academic year. While preferences are considered, the College cannot guarantee a specific preference. Other students, such as those with insurance/clearing offers, intercalated BSc Medicine students, and postgraduate students, are not guaranteed accommodation but may be considered for any remaining vacancies. Under-18 students will be allocated a single room due to guidelines.",
    "metadata": {
      "title": "Accommodation Guarantee",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/how-to-apply/accommodation-guarantee",
      "category": "Undergraduate",
      "subcategory": "Accommodation",
      "key_points": [
        "Accommodation guarantee for first-year undergrads, Oxbridge Medics, and exchange students",
        "Certain terms and conditions must be met to be eligible",
        "Preferences considered but no guarantee of specific preference",
        "Other students not guaranteed accommodation but may be considered for remaining vacancies",
        "Under-18 students allocated single rooms due to guidelines"
      ]
    }
  },
  {
    "content": "Upcoming applicants can soon apply for 2024-25 Imperial College London accommodation. Key steps include activating your account, selecting preferences in AccHub, and applying by the deadline. Important notes cover twin rooms, underage applicants, and the allocation process after applying.",
    "metadata": {
      "title": "Information for applicants",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/how-to-apply/information-for-applicants",
      "category": "Undergraduate",
      "subcategory": "Accommodation Application",
      "key_points": [
        "Apply for 2024-25 accommodation soon",
        "Activate account and select preferences in AccHub",
        "Apply by July 19, 2024 deadline to guarantee a place",
        "Considerations for twin rooms and underage applicants",
        "Allocation process after applying"
      ]
    }
  },
  {
    "content": "Prospective students may be allocated to twin rooms in Imperial College London's halls, which can be a more affordable option. While most rooms are single, twin rooms offer the potential to make new friends and have a study buddy. Sharing a room requires a tolerant and accepting attitude, flexibility, and respect for each other's possessions and personal space. Students can request to share a room with a friend during the application process. Twin room prices are generally cheaper than single rooms, and rooms with restricted views (RV) are even more affordable.",
    "metadata": {
      "title": "Twin rooms",
      "url": "https://www.imperial.ac.uk/students/accommodation/prospective/ug/twin-rooms",
      "category": "Accommodation",
      "subcategory": "Twin Rooms",
      "key_points": [
        "Twin rooms are a more affordable housing option",
        "Sharing a room requires tolerance, flexibility, and respect",
        "Students can request to share a room with a friend",
        "Twin rooms are generally cheaper than single rooms",
        "Rooms with restricted views (RV) are even more affordable"
      ]
    }
  }
]