[
  {
    "content": "No main content found",
    "metadata": {
      "title": "Food and drink",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink",
      "category": "university_services",
      "subcategory": "food_and_drink"
    }
  },
  {
    "content": "Taste Imperial provides fresh food and drink across Imperial's campuses. They have over 28 outlets, including cafes, restaurants, and a convenience store. They aim to provide great food, excellent customer service, and good value for money, catering to different tastes, customs, and budgets. Their team works hard to provide a high standard of customer service, and visitors can leave feedback. Their internal till point systems are managed by Cosmic, and staff should be aware of the Cosmic Accessibility Statement.",
    "metadata": {
      "title": "About us",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/about-us",
      "category": "Food and Drink",
      "subcategory": "About Taste Imperial",
      "key_points": [
        "Taste Imperial provides food and drink across Imperial's campuses",
        "They have over 28 outlets, including cafes, restaurants, and a convenience store",
        "They aim to provide great food, excellent customer service, and good value",
        "They cater to different tastes, customs, and budgets",
        "Their team works hard to provide a high standard of customer service",
        "Visitors can leave feedback",
        "Their internal till point systems are managed by Cosmic"
      ]
    }
  },
  {
    "content": "The Taste Imperial team is committed to providing excellent customer service, with regular reviews, staff training, and encouraging feedback. The Customer Charter outlines their commitment and the standards of service customers can expect, how to obtain information, and how customers can provide feedback to maintain high service standards. The charter applies to all customers, internal or external. Catering staff are committed to providing professional, cheerful, and efficient service, offering the best value, and continuously improving services based on customer feedback. Customers can log complaints via email or an online form, and the team will investigate and respond promptly. Feedback is valued, and improvements are made as necessary. The team aims to provide prompt and helpful telephone, face-to-face, and written communication, and expects customers to treat staff politely and provide feedback to improve services.",
    "metadata": {
      "title": "Customer charter",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/about-us/customer-charter",
      "category": "Food and Drink",
      "subcategory": "About Us",
      "key_points": [
        "Commitment to excellent customer service",
        "Standards of service outlined in Customer Charter",
        "Catering staff provide professional, efficient service",
        "Feedback and complaints handled promptly",
        "Expectations for customer behavior and communication"
      ]
    }
  },
  {
    "content": "Imperial College London is committed to sustainability, including reducing beef consumption, serving sustainable fish, providing free non-dairy milk options, and sourcing local, seasonal produce. The Sustainable Food & Drink Policy, developed in 2022, guides these efforts. The college has previously implemented initiatives like using wooden cutlery and removing single-use plastic water cups. Ongoing updates and new sustainability efforts are communicated to the community.",
    "metadata": {
      "title": "Sustainability",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/about-us/sustainability",
      "category": "Sustainability",
      "subcategory": "Food and Drink",
      "key_points": [
        "Reducing beef consumption by 35% annually and eliminating it by 2026",
        "Serving only sustainable, MSC-certified fish",
        "Providing free non-dairy milk options across campus",
        "Stocking local, seasonal produce to reduce food miles",
        "Previous sustainability initiatives like wooden cutlery and removal of single-use plastic water cups"
      ]
    }
  },
  {
    "content": "Imperial College has announced plans to replace beef with wild culled venison in its menus by 2025-26 due to the high carbon footprint of beef production. Venison has a significantly lower carbon footprint, emitting only 27% of the CO2 emissions of beef. Culling wild deer is also necessary to conserve the health and biodiversity of British countryside and woodlands, as their population has grown problematically high. Venison is a healthy alternative to beef, being higher in protein and vitamins while lower in fat. The college is excited for students to try venison in various dishes.",
    "metadata": {
      "title": "Our move to venison",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/about-us/sustainability/our-move-to-venison",
      "category": "Sustainability",
      "subcategory": "Food & Drink",
      "key_points": [
        "Replacing beef with wild culled venison to reduce carbon footprint",
        "Venison has 27% of the CO2 emissions of beef",
        "Culling deer necessary to conserve British countryside and woodlands",
        "Venison is a healthier alternative to beef",
        "College is introducing venison in various dishes"
      ]
    }
  },
  {
    "content": "The Taste Imperial Team have won 5 awards at this year's TUCO competition, in a fierce battle of almost 100 competitors. Kitti Szabados took home the Silver Trophy in the Barista Skills challenge and won the Best Speciality Drink award for 'Miss Homemade'. Bianca Ilona-Ciobanu secured the Bronze Trophy in the Mixology Challenge and the Best Signature Cocktail award. Chef Newton Dias won the Silver Trophy in the Best Burger Challenge for his tandoori chicken thigh burger.",
    "metadata": {
      "title": "Taste win big at Tuco",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/about-us/taste-win-big-at-tuco",
      "category": "Food and Drink",
      "subcategory": "Awards and Achievements",
      "key_points": [
        "Taste Imperial Team won 5 awards at TUCO competition",
        "Kitti Szabados won Barista Skills and Best Speciality Drink",
        "Bianca Ilona-Ciobanu won Mixology Challenge and Best Signature Cocktail",
        "Newton Dias won Best Burger Challenge"
      ]
    }
  },
  {
    "content": "Home. Administration and support services. Food and drink. Allergy information. Food allergies and intolerances. Speak to a supervisor for product ingredients and allergy info. For more general info, visit the Food Standards Agency website.",
    "metadata": {
      "title": "Allergy information",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/allergy-information",
      "category": "food and dining",
      "subcategory": "allergies",
      "key_points": [
        "Information about food allergies and intolerances",
        "Speak to a supervisor for product details",
        "Visit the Food Standards Agency website for more general info"
      ]
    }
  },
  {
    "content": "Home Admin/support services Food/drink Apps College Catering Apps Yoyo makes campus payments easier, faster, more rewarding Dill new food ordering app for faster campus food pickup",
    "metadata": {
      "title": "Apps",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/apps",
      "category": "campus services",
      "subcategory": "apps",
      "key_points": [
        "Campus payment app Yoyo",
        "New food ordering app Dill",
        "Apps make campus life easier"
      ]
    }
  },
  {
    "content": "Imperial College London operates 29 food and drink outlets across its campuses, offering a wide variety of options and cuisines. The South Kensington campus has 17 outlets, including the Business School Cafe, Chemistry Cafe, College Cafe, Eastside Bar and Restaurant, Electrical Engineering Cafe, Essentials Convenience Store, h-bar, JCR Deli, Kimiko, and The Bakery. The Charing Cross, Hammersmith, and White City campuses also have on-site cafes and restaurants, such as Reynolds Cafe, Wolfson Restaurant, Ex Libris Cafe, MRC Cafe, The Invention Rooms Cafe, and The MSRH Cafe.",
    "metadata": {
      "title": "Catering outlets",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets",
      "category": "campus services",
      "subcategory": "food and drink",
      "key_points": [
        "Imperial College London operates 29 food and drink outlets across its campuses",
        "The South Kensington campus has 17 outlets with a wide variety of options and cuisines",
        "Other campuses also have on-site cafes and restaurants",
        "Outlets include cafes, bars, convenience stores, and restaurants"
      ]
    }
  },
  {
    "content": "The Business School Café is open Monday to Friday, 8.30 to 17.30, and offers a selection of hot and cold dishes, baguettes, pastries, and hot beverages. It is conveniently located at the ground floor of the Business School Building, next to Imperial's main entrance on Exhibition Road.",
    "metadata": {
      "title": "Business School Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/business-school-cafe",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "The Business School Café is open Monday to Friday, 8.30 to 17.30",
        "It offers a selection of hot and cold dishes, baguettes, pastries, and hot beverages",
        "The café is conveniently located at the ground floor of the Business School Building, next to Imperial's main entrance on Exhibition Road"
      ]
    }
  },
  {
    "content": "The Chemistry Café offers a great view, serving jacket potatoes, baguettes, panini, and hot/cold drinks. There are desktop computers and a comfortable seating area. The café is located in the Chemistry Building's Common Room, and you'll need your College ID to access the building.",
    "metadata": {
      "title": "Chemistry Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/chemistry-cafe",
      "opening_hours": "Monday to Friday, 9.00 to 16.00",
      "location": "Chemistry Building's Common Room, South Kensington campus"
    }
  },
  {
    "content": "College Café offers a wide range of hot and cold options for breakfast, lunch, and everything in between. It is open Monday to Friday, from 8.00 to 18.00, and is located next to the Alumni Centre near the main entrance. The café serves freshly prepared bacon sandwiches, toasties, filled croissants, breakfast yoghurt, and porridge with toppings. For lunch, there are delicious hand-carved roast sandwiches with homemade dressings. The café also has a juice bar where you can order healthy juice concoctions and smoothies.",
    "metadata": {
      "title": "College Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/college-cafe",
      "location": "Next to the Alumni Visitor Centre in the College's main entrance",
      "hours": "Monday to Friday, 8.00 to 18.00",
      "menu_items": [
        "Freshly prepared bacon sandwiches, toasties, filled croissants",
        "Breakfast yoghurt and porridge with toppings",
        "Delicious hand-carved roast sandwiches with homemade dressings",
        "Healthy juice concoctions and smoothies"
      ]
    }
  },
  {
    "content": "Eastside Restaurant and Bar is a lively, contemporary eaterie where you can enjoy a selection of drinks and excellent food ranging from healthy salads to delicious main meals. It also has bar snacks and sports fixtures on large plasma screens, making it a great place to socialize with friends and colleagues. Eastside is a membership-only bar that welcomes staff, students, and alumni from Imperial, as well as 'Friends of Imperial' like local residents and museum employees. Guests can also be brought in, but they will need to sign in.",
    "metadata": {
      "title": "Eastside Restaurant and Bar",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/eastside-restaurant-and-bar",
      "location": "Eastside is situated on the ground floor of Linstead Hall and is part of Eastside halls of residence in Prince's Gardens.",
      "hours": {
        "opening_hours": "Monday to Friday, 11.00 to 22.00"
      },
      "facilities": [
        "Selection of drinks and excellent food",
        "Healthy salads and delicious main meals",
        "Bar snacks",
        "Sports fixtures on large plasma screens"
      ],
      "membership": {
        "requirements": "Eastside is a membership-only bar that welcomes staff, students, and alumni from Imperial, as well as 'Friends of Imperial' like local residents and museum employees",
        "guest_policy": "Guests can also be brought in, but they will need to sign in"
      }
    }
  },
  {
    "content": "Essentials Convenience Store is Imperial's on-campus store that stocks daily essentials, including organic and fair trade products, world foods, toiletries, household items, beverages, newspapers, and more. The store is located in the Eastside Halls of Residence and is open Monday to Friday from 8:00 to 21:00, and Saturday & Sunday from 10:00 to 16:30. The store also has 24-hour accessible vending machines and an ATM machine.",
    "metadata": {
      "title": "Essentials Convenience Store",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/essentials-convenience-store",
      "category": "campus-services",
      "subcategory": "food-and-drink",
      "key_points": [
        "On-campus convenience store",
        "Stocks daily essentials, including organic and fair trade products",
        "Located in Eastside Halls of Residence",
        "Open 7 days a week with extended hours",
        "Has 24-hour accessible vending machines and ATM"
      ]
    }
  },
  {
    "content": "The Ex Libris Cafe is open Monday to Friday, from 10.30 to 17.30 and offers a wide range of hot and cold snacks, including a daily 'grab and go' selection of panini, Phat pies, pasties, salads, baguettes, and barista coffee. The cafe is located on the first floor of the Commonwealth Building in the Hammersmith Campus.",
    "metadata": {
      "title": "Ex Libris Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/ex-libris-cafe",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "Ex Libris Cafe is open Monday to Friday, 10.30 to 17.30",
        "Offers a wide range of hot and cold snacks, including 'grab and go' options",
        "Located on the first floor of the Commonwealth Building in Hammersmith Campus"
      ]
    }
  },
  {
    "content": "The Huxley Café is located in the Huxley Building at 180 Queen's Gate. It is open Monday to Friday, from 9.00 to 15.30, and serves a selection of grab and go items and hot drinks.",
    "metadata": {
      "title": "Huxley Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/huxley-cafe",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "The Huxley Café is located in the Huxley Building",
        "It is open Monday to Friday, from 9.00 to 15.30",
        "It serves a selection of grab and go items and hot drinks"
      ]
    }
  },
  {
    "content": "Kimiko serves sushi and hot Japanese food, all of which is made fresh on site each day! From Katsu curry to teriyaki salmon the menu is packed with popular options, plus with an extensive selection of Asian drinks and snacks available, it's a really exciting place to eat. Kimiko is located in the Junior Common Room on Level 2 of the Sherfield Building.",
    "metadata": {
      "title": "Kimiko",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/kimiko",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "Serves fresh sushi and hot Japanese food",
        "Menu includes popular options like Katsu curry and teriyaki salmon",
        "Extensive selection of Asian drinks and snacks",
        "Located in the Junior Common Room on Level 2 of the Sherfield Building"
      ]
    }
  },
  {
    "content": "Home Administration and support services Food and drink Catering outlets Kokoro at h-bar Kokoro at h-bar Opening Hours Kokoro is open Monday to Friday, from 11.00 to 21.00. h-bar is open and jointly run by Campus Services and Imperial College Union. It is divided into a café and bar section. h-bar serves a selection of food from Kokoro, including sushi and hot bento boxes. To find out more about h-bar or Imperial Student Union please visit their website. Location h-bar can be found on level 0 of the Sherfield building. The entrance can be accessed from the ground floor foyer of the Sherfield building.",
    "metadata": {
      "title": "Kokoro at h-bar",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/kokoro-at-h-bar",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "Kokoro is open Monday to Friday, 11.00 to 21.00",
        "h-bar is jointly run by Campus Services and Imperial College Union",
        "h-bar serves Kokoro's food, including sushi and bento boxes",
        "h-bar is located on level 0 of the Sherfield building"
      ]
    }
  },
  {
    "content": "The Library Café is a great choice for meals and study spots on campus. It's open extended hours and offers a variety of food and drink options, from breakfast to late night. Located on the ground floor of the library building, the café features comfortable seating and PC access.",
    "metadata": {
      "title": "Library Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/library-cafe",
      "category": "Campus Facilities",
      "subcategory": "Dining",
      "key_points": [
        "Open extended hours: Monday-Friday 8am-10pm, Saturday-Sunday 10am-4pm",
        "Offers breakfast, lunch, and snacks",
        "Comfortable seating and PC access for studying",
        "Located in the ground floor of the library building"
      ]
    }
  },
  {
    "content": "Lumen Café is open Monday to Friday, from 11.00 to 19.00, with access to outside seating on Dalby Court. It's a popular spot for staff and students, offering a great place to have a meeting, business or social, over a cup of coffee made by experienced baristas. The café also serves a variety of cakes, panini, pastries, muffins, sandwiches, and bagels. The Lumen Café is located in the Foyer area of the Electrical Engineering Building on the South Kensington Campus.",
    "metadata": {
      "title": "Lumen Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/lumen-cafe",
      "category": "food_and_drink",
      "subcategory": "Catering_outlets",
      "key_points": [
        "Lumen Café is open Monday to Friday, 11.00 to 19.00",
        "Located in the Electrical Engineering Building on the South Kensington Campus",
        "Offers a variety of coffee, food, and seating options",
        "Popular spot for staff and students to meet and work"
      ]
    }
  },
  {
    "content": "The MRC Cafe serves a range of food and drinks, including pastries, baguettes, panini, ciabattas, snacks, and hot and cold beverages. It's open Monday to Friday from 8:30 to 15:30 and is a great place to take a break and socialize.",
    "metadata": {
      "title": "MRC Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/mrc-cafe",
      "category": "food and drink",
      "subcategory": "catering outlets",
      "key_points": [
        "Offers a variety of food and drink options",
        "Open Monday to Friday from 8:30 to 15:30",
        "Serves as a social and break area for the community"
      ]
    }
  },
  {
    "content": "Home Administration and support services Food and drink Catering outlets MSRH Café The MSRH Café is located in the Molecular Science Research Hub at the new White City Campus. This modern space is perfect for relaxing with a hot drink or sandwich. The café serves sandwiches, snacks, and barista-style coffee. It's a great place to socialize with colleagues or catch up on work.",
    "metadata": {
      "title": "MSRH Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/msrh-cafe"
    }
  },
  {
    "content": "Home Administration and support services Food and drink Catering outlets Neo Pizza & Pasta Opening Hours Neo Pizza & Pasta is open Monday to Friday, from 11.30 to 14.30. Location Neo Pizza and Pasta can be found in the JCR.",
    "metadata": {
      "title": "Neo Pizza & Pasta",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/neo-pizza--pasta",
      "category": "food and drink",
      "subcategory": "catering outlets",
      "key_points": [
        "Neo Pizza & Pasta is open Monday to Friday, from 11.30 to 14.30",
        "Neo Pizza and Pasta can be found in the JCR"
      ]
    }
  },
  {
    "content": "Plantworks is Imperial College's first entirely plant-based and vegan catering outlet. It features a bespoke and fresh menu of plant-based hot foods and drinks every day. If you're looking for a healthier option or want to make your diet more sustainable, Plantworks provides a contemporary and fresh spin to the range of food available on campus. Plantworks is located in the Junior Common Room (JCR) and is open Monday to Friday, from 11.30 to 14.30.",
    "metadata": {
      "title": "Plantworks",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/plantworks",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "Plantworks is Imperial College's first entirely plant-based and vegan catering outlet",
        "It features a bespoke and fresh menu of plant-based hot foods and drinks",
        "Provides a healthier and more sustainable option for campus food",
        "Located in the Junior Common Room (JCR), open Monday to Friday, 11.30 to 14.30"
      ]
    }
  },
  {
    "content": "The Queen's Tower Rooms offers international food court style dining and serves cuisine from around the globe. It has two course meal deals that provide good value, making it a popular option for staff and students. Customers can choose from Traditional, Roast, Copper Pot or Wok meal deals, which include sides, soup, roll, dessert, and a drink. The QTR will be closed during exam periods in March and April-June 2023. The Queen's Tower Restaurant is located on Level 1 of the Sherfield Building on the South Kensington Campus.",
    "metadata": {
      "title": "Queen's Tower Rooms",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/queens-tower-rooms",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "Offers international food court style dining",
        "Has two course meal deals with good value",
        "Closed during exam periods in March and April-June 2023",
        "Located on Level 1 of the Sherfield Building, South Kensington Campus"
      ]
    }
  },
  {
    "content": "Home Administration and support services Food and drink Catering outlets RCM Restaurant RCM Restaurant Opening Hours The RCM Café is open Monday to Saturday, from 10.00 to 14.00. The RCM Student Bar is open Monday & Tuesday, from 17.00 to 22.30 and Wednesday to Friday, from 17.00 to 22.30. The RCM Restaurant is open to Imperial staff and students and offers a range of hot and cold snacks and beverages. A full lunch menu is also available between 12.00 and 14.00. Location RCM Restaurant is located in the Royal College of Music on Prince Consort Road. For more information, please visit the Royal College of Music food and drink webpages.",
    "metadata": {
      "title": "RCM Restaurant",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/rcm-restaurant",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "RCM Café and Student Bar operating hours",
        "RCM Restaurant offers food and beverages for Imperial staff and students",
        "Full lunch menu available from 12.00 to 14.00",
        "RCM Restaurant located in the Royal College of Music"
      ]
    }
  },
  {
    "content": "Reynolds Café is open Monday to Friday, from 8.30 to 20.00. It serves a selection of sandwiches, snacks, ciabattas, salads, beverages, cold drinks, plus a variety of confectionery and chocolates. The Snack Bar is the ideal place to relax or have a meeting with your colleagues during the day. They also serve English breakfasts, barista coffee and pastries, and you can enjoy a yoghurt bar too.",
    "metadata": {
      "title": "Reynolds Café",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/reynolds-cafe",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "Reynolds Café is open Monday to Friday, 8.30 to 20.00",
        "Serves sandwiches, snacks, ciabattas, salads, beverages, and more",
        "Ideal place to relax or have a meeting with colleagues",
        "Also serves English breakfasts, barista coffee, pastries, and a yoghurt bar"
      ]
    }
  },
  {
    "content": "The Royal School Of Mines Café offers a variety of hot and cold food, including fresh pasta, salads, Taste Imperial baguettes, wraps, and pastries. Coffee, tea, and other cold drinks are also available. The café is located on the 3rd floor of the Royal School of Mines building and is open Monday to Friday from 8.30 to 16.30.",
    "metadata": {
      "title": "Royal School of Mines",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/royal-school-of-mines",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "Variety of hot and cold food options",
        "Coffee, tea, and cold drinks available",
        "Located on the 3rd floor of the Royal School of Mines building",
        "Open Monday to Friday, 8.30 to 16.30"
      ]
    }
  },
  {
    "content": "Home Administration and support services Food and drink Catering outlets SCR Restaurant SCR Restaurant Location The Senior Common Room is located on level 2 of the Sherfield Building. See location on the map of South Kensington Campus Opening Hours The SCR Restaurant is open Monday to Friday, from 11.45 to 14.30. The SCR Restaurant offers a complete menu of fresh hot and cold lunches every weekday. Our chefs prepare a variety of freshly-made hot meals including street food, vegan and vegetarian options, a salad bar, fresh soups, carvery roasts and a delicious selection of desserts.",
    "metadata": {
      "title": "SCR Restaurant",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/scr-restaurant",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "SCR Restaurant located on level 2 of Sherfield Building",
        "Open Monday to Friday, 11.45 to 14.30",
        "Offers a variety of fresh hot and cold lunches",
        "Includes street food, vegan and vegetarian options, salad bar, soups, carvery roasts, and desserts"
      ]
    }
  },
  {
    "content": "The Bakery is a new catering outlet at Imperial College London's South Kensington campus, offering a range of freshly-baked pastries, slices, baguettes, cakes, doughnuts, and hot breakfast options. It also houses the university's first Starbucks cafe, providing a variety of drinks and beverages.",
    "metadata": {
      "title": "The Bakery",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/the-bakery",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "opening_hours": {
        "weekdays": "Monday to Friday, 8.00 to 16.00"
      },
      "location": "The Bakery is located in the Junior Common Room on South Kensington campus."
    }
  },
  {
    "content": "Home Administration and support services Food and drink Catering outlets The Foundry The Foundry Opening hours The Foundry is open Thursday and Friday from 16.00 to 23.00. Welcome to The Foundry, the College's own pub in North Acton, available to our students, staff and neighbours. Serving a delicious array of pub favourite beers, wines and spirits, it's the perfect spot if you're looking to unwind. We're located right in the heart of the Imperial community in North Acton, just next to Woodward Buildings and across the street from Kemp Porter Buildings. No booking required but, if you'd like to explore using our space for a large event, you can reach us at foundrybookings@imperial.ac.uk",
    "metadata": {
      "title": "The Foundry",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/the-foundry",
      "category": "food-and-drink",
      "subcategory": "catering-outlets",
      "key_points": [
        "The Foundry is the College's own pub in North Acton",
        "It's open Thursday and Friday from 16.00 to 23.00",
        "Serves a variety of pub drinks and is a relaxing spot",
        "Located in the heart of the Imperial community",
        "No booking required, but can be used for large events"
      ]
    }
  },
  {
    "content": "Home Administration and support services Food and drink Catering outlets The Garden Room Restaurant The Garden Room Restaurant Opening hours Reservations Situated on the ground floor of 58 Princes Gate, an impressive Edwardian townhouse, which boasts period features and overlooks the leafy Prince's Gardens, The Garden Room Restaurant is a smart and stylish place to network over lunch or treat your colleagues, friends and family. Menu Location",
    "metadata": {
      "title": "The Garden Room Restaurant",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/the-garden-room-restaurant",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "The Garden Room Restaurant is located in an Edwardian townhouse on the South Kensington Campus",
        "It offers a la carte menu and outdoor seating with views of Prince's Gardens",
        "Reservations are strongly advised due to the restaurant's popularity",
        "Opening hours are Monday to Friday, 11:45 - 14:15"
      ]
    }
  },
  {
    "content": "The Loud Bird is a catering outlet on the ground floor of the Sir Alexander Fleming Building. It is open Monday to Friday from 8:00 to 16:00 and offers a selection of grilled chicken, burgers, wraps, vegan options, sides, and signature sauces. The outlet also serves hot coffee and tea all day in partnership with 'Roastology'.",
    "metadata": {
      "title": "The Loud Bird",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/the-loud-bird",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "The Loud Bird is a catering outlet on the ground floor of the Sir Alexander Fleming Building",
        "It is open Monday to Friday from 8:00 to 16:00",
        "Offers grilled chicken, burgers, wraps, vegan options, sides, and signature sauces",
        "Serves hot coffee and tea all day in partnership with 'Roastology'"
      ]
    }
  },
  {
    "content": "The Pantry is a new pop-up concept that offers everyday essentials at low, wholesale prices. It is open Monday to Friday, 11.00 to 14.00, and is available at Sherfield Walkway and Wolfson Restaurant in Hammersmith. The Pantry focuses on food staples that can be purchased wholesale and passed on to the community at significantly reduced prices, such as rice, pasta, cereals, and vegetables. Customers can pick up pre-packed grab bags or weigh out their own produce. The Pantry is operated on a not-for-profit basis.",
    "metadata": {
      "title": "The Pantry",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/the-pantry",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "key_points": [
        "The Pantry offers everyday essentials at low, wholesale prices",
        "It is open Monday to Friday, 11.00 to 14.00, at Sherfield Walkway and Wolfson Restaurant",
        "Customers can pick up pre-packed grab bags or weigh out their own produce",
        "The Pantry is operated on a not-for-profit basis"
      ]
    }
  },
  {
    "content": "The Roastery is a modern cafe located in the Senior Common Room, offering a range of hot breakfast and lunch options, sandwiches, snacks, and handmade drinks. It features an exclusive Imperial Coffee blend sourced from Brazilian and Nicaraguan medium-roast beans, providing a more balanced, lighter taste.",
    "metadata": {
      "title": "The Roastery",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/the-roastery",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "opening_hours": "Monday to Friday, 8.00 to 18.00",
      "location": "Sherfield Building, Senior Common Room level 2"
    }
  },
  {
    "content": "The Works is a contemporary eatery that serves the White City Campus from breakfast until late, with a wide-ranging menu including gluten-free, vegetarian and vegan options as well as daily lunch specials from around the world. It reflects the industrial heritage of the building's namesake, Sir Michael Uren, and offers a multi-use space that shifts from a cafe to a restaurant to a venue.",
    "metadata": {
      "title": "The Works",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/the-works",
      "opening_hours": {
        "weekdays": "Monday to Friday, from 8.00 to 22.00",
        "bar": "12.00 until close",
        "coffee_and_pastries": "available all day",
        "breakfast": "until 10.00",
        "bar_menu": "11.45 - 17.00",
        "lunch_specials": "11.45 - 14.30",
        "evening_menu": "17.00 - 20.00"
      },
      "menu_highlights": [
        "Hot and cold breakfast selection",
        "Burger selection",
        "Pub classics",
        "World foods options (e.g., Teriyaki noodles, Java squash curry, Miso and sesame roasted aubergines)",
        "Pizzas",
        "Small plates and sharing platters"
      ]
    }
  },
  {
    "content": "Wolfson Restaurant offers a variety of hot and cold lunch options, including jacket potatoes, salads, and a deli bar for custom baguettes. It is located on the ground floor of the Wolfson Conference Centre at the Hammersmith Campus.",
    "metadata": {
      "title": "Wolfson Restaurant",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/catering-outlets/wolfson-restaurant",
      "category": "Food and Drink",
      "subcategory": "Catering Outlets",
      "opening_hours": "Monday to Friday, 8:30 to 15:00",
      "location": "Wolfson Café is located on the ground floor of the Wolfson Conference Centre in the Hammersmith Campus."
    }
  },
  {
    "content": "Home, Administration and support services, Food and drink, Contact us. Customer service is at the heart of what we do here at Taste Imperial. Your feedback is important to us and will help us improve our service.",
    "metadata": {
      "title": "Contact us",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/contact-us",
      "category": "Food and Drink",
      "subcategory": "Contact Us",
      "key_points": [
        "Customer service is a priority",
        "Feedback is important to improve service"
      ]
    }
  },
  {
    "content": "Home, Administration and support services, Food and drink, Contact us, Feedback form",
    "metadata": {
      "title": "Feedback form",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/contact-us/feedback",
      "category": "Administration",
      "subcategory": "Feedback"
    }
  },
  {
    "content": "Home Admin and support services Food and drink Daily menus Update: 'Daily Menus' paused, changes to Food and Drink website coming soon.",
    "metadata": {
      "title": "Daily menus",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/daily-menus",
      "category": "administration",
      "subcategory": "food and drink",
      "key_points": [
        "Daily menus page currently under construction",
        "Daily menus feature paused",
        "Changes coming to Food and Drink website"
      ]
    }
  },
  {
    "content": "The new Dill app allows you to pre-order, pre-pay, and pick up food from various catering outlets on campus. To use Dill, you need to download the app, register with your Imperial email, choose your desired outlet and menu items, and pre-pay before picking up your order at the designated time. Currently, Dill is available at The College Cafe, Eastside, SCR, The Bakery, and Wolfson.",
    "metadata": {
      "title": "Dill",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/dill",
      "category": "Food and Drink",
      "subcategory": "Catering",
      "key_points": [
        "Pre-order and pre-pay for food using the Dill app",
        "Choose from various catering outlets on campus",
        "Pick up your order at the designated time",
        "Dill is currently available at 5 outlets"
      ]
    }
  },
  {
    "content": "The MI Cup Initiative is a new reusable cup scheme at Imperial College London to reduce the use of disposable cups across campus. Customers can purchase a MI Cup for £5 and receive a free drink. The MI Cup is environmentally-friendly, as it reduces the use of disposable cups and stops single-use plastic cups from going to landfill. The initiative aims to promote sustainable solutions and generate a positive impact for the environment.",
    "metadata": {
      "title": "MI Cup Initiative",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/mi-cup-initiative",
      "category": "sustainability",
      "subcategory": "reusable cups",
      "key_points": [
        "New reusable cup scheme at Imperial College London",
        "Customers can purchase a MI Cup for £5 and get a free drink",
        "MI Cup is environmentally-friendly, reducing disposable cup waste",
        "Initiative promotes sustainable solutions and environmental impact"
      ]
    }
  },
  {
    "content": "Home Administration and support services Food and drink Opening hours. Each of our outlets operate on different opening hours, as well as changing hours between term time and vacation. Some of our outlets will close during the summer vacation or operate on changed opening hours. The table below outlines our opening hours from Friday 28 June until Monday 30 September.",
    "metadata": {
      "title": "Opening hours",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/opening-hours",
      "category": "Food and Drink",
      "subcategory": "Opening Hours",
      "key_points": [
        "Outlets have different opening hours during term time and vacation",
        "Some outlets will close or have changed hours during the summer vacation",
        "The table provides the summer vacation opening hours from June 28 to September 30"
      ]
    }
  },
  {
    "content": "Yoyo Wallet is working with Imperial to make campus payments easier, faster, and more rewarding. The Yoyo app allows you to pay for goods and earn points on every purchase. You'll get digital loyalty cards and receipts, and can reach out to the support team with any questions.",
    "metadata": {
      "title": "Yoyo",
      "url": "https://www.imperial.ac.uk/admin-services/food-and-drink/yoyo",
      "category": "Administration and support services",
      "subcategory": "Food and drink",
      "key_points": [
        "Yoyo Wallet partners with Imperial for campus payments",
        "Easy, fast payments with QR code scanning",
        "Earn points on every purchase to redeem rewards",
        "Digital loyalty cards and receipts, no paper",
        "Support team available for any queries or concerns"
      ]
    }
  }
]