[
  {
      "content": "Take responsibility for your learning and shape your experience. Make it what you want it to be.",
      "metadata": {
          "title": "1. University study is about independence",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },
  {
      "content": "The more you ask, the more you will learn. No one knows everything.",
      "metadata": {
          "title": "2. Participate and ask questions",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },
  {
      "content": "Results show that those who attend classes get better marks than those who do not. This goes for remote classes too!",
      "metadata": {
          "title": "3. Don’t skip your classes",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },
  {
      "content": "They can help with any problems. You might not need them right away, but you might need them later.",
      "metadata": {
          "title": "4. Keep in touch with your personal tutor",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },
  {
      "content": "Organise your time around lectures, reading, tutorials, the library and Clubs & Societies. Make time for you to dance, swim, walk, sing and relax.",
      "metadata": {
          "title": "5. Learn to manage your time",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },
  {
      "content": "Everyone is new. Speak to classmates, form study groups and try a new sport. Step outside your comfort zone.",
      "metadata": {
          "title": "6. Make friends",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },
  {
      "content": "It’s given to help you improve your work and your grades. Give feedback, we like to improve too.",
      "metadata": {
          "title": "7. Use feedback",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },
  {
      "content": "Don’t just stick to the lecture notes. Expand your knowledge.",
      "metadata": {
          "title": "8. Read around your subject",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },
  {
      "content": "Feed your brain with thinking fuel. Can’t cook? Learn. Whether you’re a night owl, or an early bird, make sure you sleep. While you sleep, your body is working to maintain your health.",
      "metadata": {
          "title": "9. Eat, sleep and look after yourself",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },
  {
      "content": "You are living in one of the greatest, most diverse, cities in the world. Explore, discover, and experience the city, it’s all part of being an Imperial student.",
      "metadata": {
          "title": "10. Enjoy London",
          "category": "Success Guide",
          "main_title": "Ten top tips",
          "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/"
      }
  },

  {
    "content": "For different theories or methodologies: Use a table to record information – it's much easier to look at the information quickly and do a quick comparison. For procedures and processes: Use a flow chart to record the different stages, and the decision-making process that you will need to work through. For summarising different documents or sources: Make a list of the key points and use prose or linear notes to add any of your own commentary. You could then record how these points link up using a 'mind map' or a diagram. For recording how a piece of equipment works: Use an image or diagram to record details of each part. It doesn't matter if you can't draw well, as long as you understand it.",
    "metadata": {
      "title": "Note-taking advice",
      "category": "Success Guide",
      "main_title": "Effective note-taking",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/in-class-and-in-lectures/effective-note-taking/",
      "key_points": [
        "Use tables for comparing theories or methodologies",
        "Use flow charts for procedures and processes",
        "Use lists and mind maps for summarizing documents",
        "Use diagrams for equipment details"
      ],
      "quotes": [
        {
          "text": "You should try and write up your notes as soon as possible after your lectures and seminars. It will reinforce the knowledge you've learnt, and a little bit of work each day will save you time come revision.",
          "author": "Lloyd James, ICU President 2021-22"
        },
        {
          "text": "Make sure you're taking good notes because they're invaluable at revision times. You can use colour or other visual aids to enhance notes - especially if you're a person that finds it hard to learn from these. Shorter note cards can be really effective for some people; but try to produce these early as they take a long time to make during a revision period",
          "author": "Daniel Lo, ICU Deputy President (Education) 2021-22"
        }
      ]
    }
  },
  {
    "content": "Imperial College primarily uses Blackboard as its Virtual Learning Environment (VLE) for most departments. Blackboard hosts course materials, discussions, tests, and allows assignment submissions. The Business School uses a custom platform called The Hub. Other digital tools used include Microsoft Teams, Zoom, Panopto, and various online resources provided by the Library. The college also employs specialized technologies like learning laboratories, 'responsive mannequins' in medicine, 3D simulation in geosciences, and interactive whiteboards.",
    "metadata": {
      "title": "Virtual Learning Environments at Imperial",
      "category": "Success Guide",
      "main_title": "Virtual Learning Environments",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/working-by-yourself/learning-online/virtual-learning-environments/",
      "key_points": [
        "Blackboard is the primary VLE for most departments",
        "The Business School uses a custom platform called The Hub",
        "Various digital tools and specialized technologies are used across different programs"
      ]
    }
  },
  {
    "content": "Imperial College offers a wide range of short online courses across various disciplines. These include A-level Mathematics preparation courses, business-related courses (e.g., Accounting Essentials, Finance Essentials), technology courses (e.g., Advanced App Development in Android, TensorFlow 2), public health and medical courses (e.g., Epidemiology for Public Health, Infectious Disease Modelling), and courses related to climate change and renewable energy. These courses cater to different levels, from pre-university preparation to professional development.",
    "metadata": {
      "title": "Short Online Courses Overview",
      "category": "Success Guide",
      "main_title": "Online courses",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/working-by-yourself/learning-online/online-courses/",
      "key_points": [
        "Diverse range of courses covering mathematics, business, technology, health, and environmental topics",
        "Courses available for different levels, from pre-university to professional development",
        "Includes both academic preparation and practical skill development courses"
      ]
    }
  },
  {
    "content": "University life differs from school in several key ways. Grading is different, with a pass mark typically at 40% and first-class honors at 70% or above. There's a heavy emphasis on online learning, using platforms like Blackboard and Microsoft Teams. Students have more responsibility for their own learning, requiring independent study and time management skills. The learning environment is diverse, with various teaching methods including lectures, tutorials, and practical classes. University also offers more flexibility in study hours and locations. The student body is more diverse, with people from many different countries and backgrounds. Living independently may require developing new skills like cooking.",
    "metadata": {
      "title": "Key Differences in University Life",
      "category": "Success Guide",
      "main_title": "What to expect",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-expect/how-is-university-different/",
      "key_points": [
        "Different grading system with lower percentage thresholds for passing and excellence",
        "Greater emphasis on independent learning and online resources",
        "More diverse learning environments and student body"
      ]
    }
  },
  {
    "content": "Personal Tutors are allocated to students for the duration of their course to offer help and support with academic or personal issues. They follow your progress and help keep you on track. It's beneficial to develop a good relationship with your tutor, meeting at least twice a term and keeping in touch via email. If your department doesn't allocate a tutor, there will be a Senior Tutor or program manager available for support.",
    "metadata": {
      "title": "Personal Tutors",
      "category": "Success Guide",
      "main_title": "Tutors",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-expect/tutors/",
      "key_points": [
        "Personal Tutors offer academic and personal support",
        "Meet your tutor at least twice a term",
        "Develop a good relationship with your tutor"
      ]
    }
  },
  {
    "content": "Senior Tutors are academic staff members responsible for the pastoral care of students in a department. They support Personal Tutors and Supervisors and provide additional guidance in complex situations. If you're uncomfortable talking to your Personal Tutor about a problem, you can speak to your Senior Tutor. Each Faculty also has a Faculty Senior Tutor for additional support.",
    "metadata": {
      "title": "Senior Tutors",
      "category": "Success Guide",
      "main_title": "Tutors",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-expect/tutors/",
      "key_points": [
        "Senior Tutors oversee pastoral care in departments",
        "They provide support in complex situations",
        "Faculty Senior Tutors offer additional guidance"
      ]
    }
  },
  {
    "content": "Personal Tutors can discuss any aspect of university life, including course matters, financial worries, personal problems, or any concerns. They advise on academic progress, identify strengths and weaknesses, and suggest improvements. They're also the first point of contact for welfare, financial, or pastoral issues and can provide academic references. If they can't help with a specific issue, they'll suggest appropriate resources or contacts.",
    "metadata": {
      "title": "Role of Personal Tutors",
      "category": "Success Guide",
      "main_title": "Tutors",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-expect/tutors/",
      "key_points": [
        "Discuss any aspect of university life with Personal Tutors",
        "They provide academic advice and support",
        "Personal Tutors can refer to other support services if needed"
      ]
    }
  },
  {
    "content": "Lectures are a primary learning method at university, where staff explain core subject material to large groups of students. Lecturers use various styles, including presentations, writing on boards, and demonstrations. Many employ interactive teaching methods, such as asking questions or using tools like Mentimeter. Resources like slides or handouts are often provided online through Blackboard, and lectures are recorded on Panopto for later review.",
    "metadata": {
      "title": "Lectures",
      "category": "Success Guide",
      "main_title": "How we teach",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-expect/how-we-teach/",
      "key_points": [
        "Lectures explain core subject material to large groups",
        "Various teaching styles and interactive methods are used",
        "Resources and recordings are available online"
      ]
    }
  },
  {
    "content": "Tutorials involve learning in small groups, allowing for detailed exploration of topics and discussions with tutors and peers. They encourage active learning, improve self-expression, and provide hands-on practice. Students are often expected to prepare work in advance or read about lecture topics for discussion. Tutorials work best when everyone contributes, helping develop confidence in public speaking and using discipline-specific language.",
    "metadata": {
      "title": "Tutorials",
      "category": "Success Guide",
      "main_title": "How we teach",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-expect/how-we-teach/",
      "key_points": [
        "Small group learning for detailed topic exploration",
        "Encourages active participation and discussion",
        "Helps develop public speaking and subject-specific language skills"
      ]
    }
  },
  {
    "content": "Practicals provide hands-on learning opportunities to apply knowledge from lectures and tutorials. They may be lab-based, computer-based, involve clinical practice, or fieldwork. Staff, including laboratory tutors, demonstrators, and Graduate Teaching Assistants, provide advice on the working environment and practical skills. Students often need to capture results and notes in a lab book, which may be used for writing assessed lab reports.",
    "metadata": {
      "title": "Practicals",
      "category": "Success Guide",
      "main_title": "How we teach",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-expect/how-we-teach/",
      "key_points": [
        "Hands-on application of knowledge from lectures and tutorials",
        "Various forms including lab work, computer work, and fieldwork",
        "Results and notes often captured in lab books for later assessment"
      ]
    }
  },
  {
    "content": "Depending on the course, students may participate in fieldwork, problem classes, or placements. Fieldwork allows application of classroom knowledge to real-world situations. Problem classes provide opportunities to work through questions with support from staff or Graduate Teaching Assistants. Placements, such as Year Abroad or Year in Industry, offer experiences outside the college that count towards the degree. The Careers Service provides support for finding and applying for placement opportunities.",
    "metadata": {
      "title": "Other Teaching Methods",
      "category": "Success Guide",
      "main_title": "How we teach",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-expect/how-we-teach/",
      "key_points": [
        "Fieldwork applies classroom knowledge to real-world situations",
        "Problem classes offer support for working through questions",
        "Placements provide off-campus experiences counting towards the degree"
      ]
    }
  },
  {
    "content": "Reading lists provide recommended resources for courses and lectures. The library offers print and e-versions of textbooks. When deciding what to read, consider the purpose, author's key points, publication date, and how to approach the material critically. Evaluate texts and determine how much you need to remember.",
    "metadata": {
      "title": "Reading Lists",
      "category": "Success Guide",
      "main_title": "Reading lists",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-before-you-arrive/reading-lists/",
      "key_points": [
        "Check library resources before buying textbooks",
        "Consider the purpose and relevance of reading materials",
        "Approach texts critically and evaluate their content"
      ]
    }
  },
  {
    "content": "Essential study equipment includes pens, notepads, and highlighters for organizing notes. While not mandatory, most students find having a personal computer beneficial for studying and completing assignments. Laptops offer flexibility for working in various locations. Recording lectures requires permission, and some are recorded via Panopto. Printers are available on campus, but consider what truly needs printing to save costs.",
    "metadata": {
      "title": "Study Equipment and Technology",
      "category": "Success Guide",
      "main_title": "Study equipment and technology",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-before-you-arrive/study-equipment-and-technology/",
      "key_points": [
        "Basic stationery is essential for note-taking",
        "Personal computers, especially laptops, are beneficial but not mandatory",
        "Consider campus resources like printers and lecture recordings"
      ]
    }
  },
  {
    "content": "The transition to university involves new freedoms and responsibilities. Students are expected to develop as independent learners, working autonomously outside of lectures and tutorials. This includes preparing for sessions, engaging actively in learning, and exploring areas of interest beyond the curriculum. Seeking support when needed is a key attribute of an independent student.",
    "metadata": {
      "title": "Adjusting to University Study",
      "category": "Success Guide",
      "main_title": "Adjusting to university study",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/adjusting-to-university-study/",
      "key_points": [
        "Develop independence in learning and time management",
        "Engage actively in your studies and explore beyond the curriculum",
        "Seek support when needed - it's a sign of a good student"
      ]
    }
  },
  {
    "content": "Plan your route to campus, considering walking, cycling, or public transport. Attend course induction activities to understand your course structure and meet tutors and classmates. Identify key contacts for your program, including course organizers and administrators. Participate in events organized by Imperial College Union to experience life outside studies and meet other students.",
    "metadata": {
      "title": "Your First Week",
      "category": "Success Guide",
      "main_title": "Your first week",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/your-first-week/",
      "key_points": [
        "Plan your route to campus",
        "Attend course induction activities",
        "Identify key program contacts",
        "Participate in extracurricular events"
      ]
    }
  },
  {
    "content": "Imperial has multiple campuses in London and the South East. Use online maps and mobile applications to navigate. Be aware of personal safety and follow Transport for London for updates on public transport. Explore the city's attractions, museums, and parks in your free time. Don't worry about getting lost during the day, as it can help you learn the area, but take safety precautions.",
    "metadata": {
      "title": "Finding Your Way Around Imperial",
      "category": "Success Guide",
      "main_title": "Finding your way around Imperial College London",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/finding-your-way-around-imperial-college-london/",
      "key_points": [
        "Use online maps and apps to navigate multiple campuses",
        "Be aware of personal safety, especially when exploring",
        "Take advantage of London's attractions and public transport"
      ]
    }
  },
  {
    "content": "Imperial offers over 340 Clubs, Societies & Projects (CSPs) covering academic, arts, charitable, cultural, and sports interests. Joining CSPs helps maintain a work-life balance, continue hobbies or try new activities, and meet people outside your course. CSPs are run by student volunteers, with opportunities to join committees and gain leadership skills. Joining is easy; attend the Welcome Fair or contact CSPs directly throughout the year.",
    "metadata": {
      "title": "Student Clubs and Societies",
      "category": "Success Guide",
      "main_title": "Student Clubs and Societies",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/student-clubs-and-societies-/",
      "key_points": [
        "Over 340 diverse CSPs available",
        "Helps maintain work-life balance and meet new people",
        "Opportunities for leadership and skill development"
      ]
    }
  },
  {
    "content": "Studying at Imperial makes you part of a diverse community of students, staff, and alumni. Engage in various activities to enhance your experience, such as joining clubs, attending events, using facilities like the Makerspace, participating in research institutes' activities, exploring South Kensington, and taking advantage of support services. These opportunities help you enjoy your time at Imperial, make friends, and build knowledge and skills for the future.",
    "metadata": {
      "title": "Getting Involved with the Imperial Community",
      "category": "Success Guide",
      "main_title": "Getting Involved with the Imperial Community",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/getting-involved-with-the-imperial-community/",
      "key_points": [
        "Engage in diverse activities and events",
        "Take advantage of Imperial's facilities and resources",
        "Participate in community activities to enhance your experience"
      ]
    }
  },
  {
    "content": "This glossary provides definitions for key terms used in university life at Imperial. It includes explanations of academic concepts (like abstracts, bibliographies, and literature reviews), teaching methods (lectures, tutorials, practicals), support systems (Academic Representatives, Personal Tutors), assessment types (essays, lab reports), and important policies (plagiarism). Understanding these terms will help students navigate their academic journey more effectively.",
    "metadata": {
      "title": "What's what? (glossary)",
      "category": "Success Guide",
      "main_title": "What's what? (glossary)",
      "source_url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/whats-what-glossary/",
      "key_points": [
        "Defines key academic and university-specific terms",
        "Covers teaching methods, assessment types, and support systems",
        "Helps students understand important policies and procedures"
      ]
    }
  }
]