[
  
  {
    "content": "To continue to develop your communication skills during your doctorate, you have access to a range of College expertise: Your Supervisor will provide feedback on your work, particularly on the scientific aspect of your writing. The Centre for Academic English provides extensive support to develop academic STEMM communication competence. The Library offers support on information management, optimising search criteria, managing references, preparing thesis for open access, and selecting copyright licence for your work. The Graduate School will support you through the process of producing a thesis, grant application, or publication, focusing on their structure and audience.",
    "metadata": {
      "title": "Communicating your research",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/developing-your-skills/communicating-your-research/",
      "category": "postgraduate research",
      "subcategory": "Developing Skills",
      "key_points": [
        "Various College resources for developing communication skills",
        "Support available for scientific writing and STEMM communication",
        "Assistance with information management and thesis preparation"
      ]
    }
  },
  {
    "content": "The primary responsibility for supervision of your postgraduate studies lies with your supervisor. They are responsible for overseeing your progress, ensuring you undertake appropriate training courses, follow safety guidelines, and making funds available for your studies. Postdocs play an important role in helping to supervise many postgraduate students on a day-to-day basis. The Director of Postgraduate Studies (DPS) is responsible for implementing postgraduate education policy. Your department will have at least one Senior Tutor (PGR) who has overall responsibility for the academic and pastoral care of postgraduate students.",
    "metadata": {
      "title": "Key People",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/preparing-for-your-phd/joining-imperial-/know-your-faculty-department-and-programme/key-people/",
      "category": "postgraduate research",
      "subcategory": "Preparing for Your PhD",
      "key_points": [
        "Supervisor is primary responsible for overseeing your studies",
        "Postdocs provide day-to-day supervision support",
        "Various roles exist to support postgraduate students"
      ]
    }
  },
  {
    "content": "A research degree is a very individual experience, more so than an undergraduate degree. While the overarching structure will be identical or similar across the university, individual research projects, research interactions and assessment interactions will differ. This environment can provide a rich learning experience for student cohorts discussing their experiences. Perhaps for the first time, you will be given the opportunity to explore a subject or problem that has not been explored before. This does not mean that you are on your own, but that you are embedded into a local and even global community of like-minded people, who work in a similar area or have a common interest.",
    "metadata": {
      "title": "How is a research degree different?",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/preparing-for-your-phd/what-is-a-research-degree/how-is-a-research-degree-different/",
      "category": "postgraduate research",
      "subcategory": "Preparing for Your PhD",
      "key_points": [
        "Research degree is a highly individual experience",
        "Opportunity to explore novel subjects or problems",
        "Part of a community of like-minded researchers"
      ]
    }
  },
  {
    "content": "Be open about your feelings and recognise when they emerge. It's important to talk to those close to you about your concerns to help you get a sense of perspective. You are likely to discover that you are not alone. Document your achievements as you go along to challenge any feelings of inadequacy. Be proud of your accomplishments and learn to accept compliments from others. Don't forget that you have been accepted onto a research degree at one of the top universities in the world. There may be times when working in a pressurised environment may seem overwhelming, however it's important to remember that you are not alone and there is always support available to help you to manage these feelings.",
    "metadata": {
      "title": "You Belong Here",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/transitioning-to-a-research-degree-/you-belong-here/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Be open about feelings and talk to others",
        "Document achievements to combat impostor syndrome",
        "Remember your accomplishments and available support"
      ]
    }
  },
  {
    "content": "The Student Counselling Service provides individual counselling for registered students at the College for any personal issues that may be affecting your wellbeing. We also offer some Life Skills workshops and online support groups. The Disability Advisory Service is committed to providing the best possible support for all students at Imperial. We understand that each person's disability or impairment can affect them in different ways and therefore the support offered is flexible and tailored.",
    "metadata": {
      "title": "Health and Wellbeing",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/support/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Student Counselling Service available for personal issues",
        "Life Skills workshops and online support groups offered",
        "Disability Advisory Service provides tailored support"
      ]
    }
  },
  {
    "content": "The Imperial College Union supports a variety of student-led activities that you can get involved in. Be a volunteer at different Imperial events such as Graduation or Welcome Week. Join to start exercising, take part in classes or become an Imperial athlete. One common challenge for PhD students is to maintain a work-life balance. Check what you can do to keep this balance.",
    "metadata": {
      "title": "Life outside of your PhD",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/life-outside-of-your-phd/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Various student-led activities available",
        "Opportunities for volunteering and sports",
        "Importance of maintaining work-life balance"
      ]
    }
  },
  {
    "content": "For some students, different stages of their research can be more challenging and daunting than others. Your supervisor and Senior Tutor as well as other members of your department/group will be there to support you at all times. If you need advice on dealing with stress or pressure during your research degree, visit the Student Support Zone.",
    "metadata": {
      "title": "Main stages of the PhD",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/main-stages-of-the-phd/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Different stages can be challenging for some students",
        "Support available from supervisor and department",
        "Student Support Zone for stress and pressure advice"
      ]
    }
  },
  {
    "content": "Test yourself by doing some practice questions. Ask your supervisor to provide you with a list of questions that they would anticipate may be asked. Identify areas that you are uncertain about and discuss further with your supervisor if you have concerns about what you could be questioned on. You may find your supervisor or department will automatically organise a mock viva. If not, ask your supervisor if they will conduct a mock viva with you, perhaps including another member of the research team who is familiar with your research work and could ask you relevant questions.",
    "metadata": {
      "title": "The Viva",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/main-stages-of-the-phd/the-viva/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Practice with anticipated questions",
        "Identify and discuss uncertain areas with supervisor",
        "Participate in mock viva for preparation"
      ]
    }
  },
  {
    "content": "You can access support in your academic department from a number of different sources and you can choose the one that is right for you. Student Services is made up of a range of specialist student facing support services, including Careers, the Chaplaincy, the Counselling and Mental Health Advice Service, the Disability Advisory Service and the Sexual Violence Liaison Team. The ICU Advice Centre is a free, confidential, non-judgemental and independent service for all students studying at Imperial College.",
    "metadata": {
      "title": "Support",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/support/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Multiple sources of support available in academic department",
        "Student Services offers specialist support services",
        "ICU Advice Centre provides independent support"
      ]
    }
  },
  {
    "content": "Developing a research identity will be personal to you, involve self-reflection and happen through a variety of ways. Impostor syndrome feelings are common among doctoral students, but it can be addressed in different ways and support is available.",
    "metadata": {
      "title": "Transitioning to a research degree",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/transitioning-to-a-research-degree-/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Research identity development is personal and reflective",
        "Impostor syndrome is common among doctoral students",
        "Support available for addressing impostor syndrome"
      ]
    }
  },
  {
    "content": "Your supervisor should be supportive of you both intellectually and personally, set up a viable project, provide an adequate work space, be available to talk about research problems, help and guide you throughout your PhD journey, help develop your skills, enable you to attend conferences, provide resources, and read your thesis thoroughly. As a student, you are expected to display initiative, develop your skills, keep up with your field, provide regular reports, be aware of safety, understand your funding, process expenses claims, be self-critical, collaborate with others, and share your findings.",
    "metadata": {
      "title": "Working with your supervisor",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/working-with-your-supervisor/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Supervisor provides intellectual and personal support",
        "Students expected to show initiative and develop skills",
        "Mutual expectations for successful PhD journey"
      ]
    }
  },
  {
    "content": "A research degree is likely to be very different to any other training or degree you may have undertaken previously. There is key information that you need to know before starting doctoral study at Imperial. There is guidance to support you.",
    "metadata": {
      "title": "Preparing for your PhD",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/preparing-for-your-phd/",
      "category": "postgraduate research",
      "subcategory": "Preparing for Your PhD",
      "key_points": [
        "Research degree differs from previous academic experiences",
        "Important information needed before starting doctoral study",
        "Guidance available to support new PhD students"
      ]
    }
  },
  {
    "content": "The primary responsibility for supervision of your postgraduate studies lies with your supervisor. Your supervisor is responsible for overseeing your progress during your studies, ensuring that you undertake appropriate training courses, follow safety guidelines and making funds available for you to successfully undertake your studies. Further supervision may also be provided by one or more co-supervisors - typically where your research involves collaboration with another research group, or where your primary supervisor is a new member of academic staff.",
    "metadata": {
      "title": "Key People",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/preparing-for-your-phd/joining-imperial-/know-your-faculty-department-and-programme/key-people/",
      "category": "postgraduate research",
      "subcategory": "Preparing for Your PhD",
      "key_points": [
        "Supervisor is primary responsibility for postgraduate studies",
        "Supervisor oversees progress, training, and funding",
        "Co-supervisors may be involved in collaborative research"
      ]
    }
  },
  {
    "content": "Find out more information about types of funding for doctoral studies. Find out more about the College expectations with respect to paid work during your studies and what to do if you have financial concerns. You can also access Blackbullion, which is free to all Imperial students and gives access to a full range of online learning pathways and tools to help you manage your finances and build yourself a better financial future.",
    "metadata": {
      "title": "Know your finances",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/preparing-for-your-phd/joining-imperial-/know-your-finances-/",
      "category": "postgraduate research",
      "subcategory": "Preparing for Your PhD",
      "key_points": [
        "Information available on doctoral funding types",
        "College expectations on paid work during studies",
        "Access to Blackbullion for financial management tools"
      ]
    }
  },
  {
    "content": "The MRes is a postgraduate qualification, awarded on the results of examinations following a course of advanced study, normally taking one year full-time to complete. The PhD is the most common kind of doctoral programme. Normally it takes at least three years full time to complete, the majority of which is spent carrying out original research. To complete the PhD you will need to submit a thesis of up to 100,000 words. You will also be examined orally (known as a viva voce examination) by two or more examiners, both internal and external to the College.",
    "metadata": {
      "title": "What is a research degree?",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/preparing-for-your-phd/what-is-a-research-degree/",
      "category": "postgraduate research",
      "subcategory": "Preparing for Your PhD",
      "key_points": [
        "MRes is a one-year postgraduate qualification",
        "PhD typically takes at least three years full-time",
        "PhD requires thesis submission and oral examination"
      ]
    }
  },
  {
    "content": "Undertaking a research degree is part of a training, professional and personal development process, which will be life-long. There will be little or no set timetable of lectures and there are no formal term dates. Research degrees can start at any time of the academic year, although the majority of Imperial students tend to commence their studies in October. You will acquire a high degree of self-management, which will be required for you to succeed in managing your day, your research, your degree and its requirements.",
    "metadata": {
      "title": "How is a research degree different?",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/preparing-for-your-phd/what-is-a-research-degree/how-is-a-research-degree-different/",
      "category": "postgraduate research",
      "subcategory": "Preparing for Your PhD",
      "key_points": [
        "Research degree is a lifelong development process",
        "No set timetable or formal term dates",
        "High degree of self-management required"
      ]
    }
  },
  {
    "content": "The Imperial College Union supports a variety of student-led activities that you can get involved in. Be a volunteer at different Imperial events such as Graduation or Welcome Week. Join to start exercising, take part in classes or become an Imperial athlete. One common challenge for PhD students is to maintain a work-life balance. Check what you can do to keep this balance.",
    "metadata": {
      "title": "Life outside of your PhD",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/life-outside-of-your-phd/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Various student-led activities available",
        "Opportunities for volunteering and sports",
        "Importance of maintaining work-life balance"
      ]
    }
  },
  {
    "content": "For some students, different stages of their research can be more challenging and daunting than others. Your supervisor and Senior Tutor as well as other members of your department/group will be there to support you at all times. If you need advice on dealing with stress or pressure during your research degree, visit the Student Support Zone.",
    "metadata": {
      "title": "Main stages of the PhD",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/main-stages-of-the-phd/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Different stages can be challenging for some students",
        "Support available from supervisor and department",
        "Student Support Zone for stress and pressure advice"
      ]
    }
  },
  {
    "content": "Test yourself by doing some practice questions. Ask your supervisor to provide you with a list of questions that they would anticipate may be asked. Identify areas that you are uncertain about and discuss further with your supervisor if you have concerns about what you could be questioned on. You may find your supervisor or department will automatically organise a mock viva. If not, ask your supervisor if they will conduct a mock viva with you, perhaps including another member of the research team who is familiar with your research work and could ask you relevant questions.",
    "metadata": {
      "title": "The Viva",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/main-stages-of-the-phd/the-viva/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Practice with anticipated questions",
        "Identify and discuss uncertain areas with supervisor",
        "Participate in mock viva for preparation"
      ]
    }
  },
  {
    "content": "You can access support in your academic department from a number of different sources and you can choose the one that is right for you. Student Services is made up of a range of specialist student facing support services, including Careers, the Chaplaincy, the Counselling and Mental Health Advice Service, the Disability Advisory Service and the Sexual Violence Liaison Team. The ICU Advice Centre is a free, confidential, non-judgemental and independent service for all students studying at Imperial College.",
    "metadata": {
      "title": "Support",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/support/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Multiple sources of support available in academic department",
        "Student Services offers specialist support services",
        "ICU Advice Centre provides independent support"
      ]
    }
  },
  {
    "content": "Developing a research identity will be personal to you, involve self-reflection and happen through a variety of ways. Impostor syndrome feelings are common among doctoral students, but it can be addressed in different ways and support is available.",
    "metadata": {
      "title": "Transitioning to a research degree",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/transitioning-to-a-research-degree-/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Research identity development is personal and reflective",
        "Impostor syndrome is common among doctoral students",
        "Support available for addressing impostor syndrome"
      ]
    }
  },
  {
    "content": "Your supervisor should be supportive of you both intellectually and personally, set up a viable project, provide an adequate work space, be available to talk about research problems, help and guide you throughout your PhD journey, help develop your skills, enable you to attend conferences, provide resources, and read your thesis thoroughly. As a student, you are expected to display initiative, develop your skills, keep up with your field, provide regular reports, be aware of safety, understand your funding, process expenses claims, be self-critical, collaborate with others, and share your findings.",
    "metadata": {
      "title": "Working with your supervisor",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/progressing-through-your-phd-/working-with-your-supervisor/",
      "category": "postgraduate research",
      "subcategory": "Progressing Through Your PhD",
      "key_points": [
        "Supervisor provides intellectual and personal support",
        "Students expected to show initiative and develop skills",
        "Mutual expectations for successful PhD journey"
      ]
    }
  },
  {
    "content": "Throughout your doctoral journey you will develop your disciplinary knowledge and skills, and also many research and other professional, transferable skills. These skills will help you to navigate successfully through your PhD research challenges, and contribute towards building a strong professional and academic profile for your future career. Imperial College offers you many options and opportunities to develop your skills and broaden your outlook.",
    "metadata": {
      "title": "Developing your Research and Professional Skills",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/developing-your-skills/",
      "category": "postgraduate research",
      "subcategory": "Developing Skills",
      "key_points": [
        "Develop disciplinary knowledge and transferable skills",
        "Skills help navigate PhD challenges and build professional profile",
        "Imperial offers various opportunities for skill development"
      ]
    }
  },
  {
    "content": "During your PhD you will be expected to produce many written documents, such as your initial research plan, ESA report, LSR report, funding applications, conference papers, journal articles and abstracts, posters, and your Thesis. You will have many opportunities to communicate and discuss your research verbally with your peers, the public, and other academics and experts, when presenting in conferences, building networks, running public engagement activities, explaining your research decisions, and at the Viva.",
    "metadata": {
      "title": "Communicating your research",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/developing-your-skills/communicating-your-research/",
      "category": "postgraduate research",
      "subcategory": "Developing Skills",
      "key_points": [
        "Produce various written documents throughout PhD",
        "Verbal communication opportunities in conferences and networking",
        "Develop skills for public engagement and research explanation"
      ]
    }
  },
  {
    "content": "Be aware that disabilities, health conditions, mental health difficulties and specific learning difficulties can have an impact on the thinking skills associated with organisation and time management. If you would like to discuss issues around these matters, please book an appointment with the disability advisory service where you can get support for an existing condition or help in securing a possible diagnostic assessment. The Graduate School offers courses to develop your skills to better manage your time and your research project.",
    "metadata": {
      "title": "Managing time",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/developing-your-skills/managing-time/",
      "category": "postgraduate research",
      "subcategory": "Developing Skills",
      "key_points": [
        "Health conditions can impact organization and time management skills",
        "Disability advisory service available for support",
        "Graduate School offers courses on time management"
      ]
    }
  },
  {
    "content": "The Library offers you more information and links to courses available across Imperial in the Open research education to doctoral students page, as well as ways to connect with the Imperial open research community.",
    "metadata": {
      "title": "Practicing open research",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/developing-your-skills/practicing-open-research/",
      "category": "postgraduate research",
      "subcategory": "Developing Skills",
      "key_points": [
        "Library provides information on open research education",
        "Courses available across Imperial for open research",
        "Connect with Imperial open research community"
      ]
    }
  },
  {
    "content": "The Graduate School's Research Computing and Data Science Programme (RCDS) teaches short, hands-on courses ranging from introductory to advanced topics. All Graduate School tutors have research backgrounds and will help you to develop new skills to underpin your research project. There is also a Useful Resources section to further support you. This group manages and supports the high performance computing (HPC) cluster. Specialised training, user support via ASK Imperial and weekly Teams clinics are available.",
    "metadata": {
      "title": "Research Computing and Data Skills",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgr/developing-your-skills/research-computing-and-data-skills/",
      "category": "postgraduate research",
      "subcategory": "Developing Skills",
      "key_points": [
        "Graduate School offers hands-on courses in research computing",
        "High performance computing (HPC) cluster available",
        "Specialized training and support provided"
      ]
    }
  }
]