[
  {
    "content": "During your Master's degree, you will be expected to explore new perspectives, pursue your own research and add your own voice to the community in your field. Master a new skill, take up a new sport or embrace a new challenge – never again are you likely to have such freedom to learn about yourself and what you enjoy. The benefits of studying and researching at Imperial go beyond the lecture theatre. When you are planning how to make the most of your Imperial experience, consider how to use the resources at the College to your advantage.",
    "metadata": {
      "title": "Beyond academic life",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/beyond-academic-life/",
      "category": "postgraduate taught",
      "subcategory": "Beyond Academic Life",
      "key_points": [
        "Explore new perspectives and pursue own research",
        "Opportunity to learn new skills and embrace challenges",
        "Utilize College resources beyond academics"
      ]
    }
  },
  {
    "content": "During your time at university, it is important to maintain a healthy work-life balance, specifically knowing when to work and when to rest. Clubs, Societies & Projects (CSPs) can be an important part of this balance. Imperial offers over 340 CSPs in various categories. The list of CSPs is very diverse, allowing you to continue a long-loved hobby or try something new. You can meet new people outside your course and from all around the world. You can also join a committee by running for a leadership position in October elections.",
    "metadata": {
      "title": "Your Social Life",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/beyond-academic-life/a-crash-course-to-student-life/",
      "category": "postgraduate taught",
      "subcategory": "Beyond Academic Life",
      "key_points": [
        "Maintain a healthy work-life balance",
        "Over 340 Clubs, Societies & Projects available",
        "Opportunity to meet new people and develop leadership skills"
      ]
    }
  },
  {
    "content": "Imperial works in partnership with institutions all over the world. This gives students the opportunity to get involved in high-profile international research projects, or experience university life in a completely different country. Make yourself aware of the notable projects in your field, and the overseas partners that you may be able to work with. By building up your personal networks, you will be able to discover and secure job opportunities that are not advertised elsewhere. Many Imperial researchers and staff in your field will have attractive contacts at high-profile universities and companies.",
    "metadata": {
      "title": "Using the Imperial community as a resource",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/beyond-academic-life/using-the-imperial-community-as-a-resource/",
      "category": "postgraduate taught",
      "subcategory": "Beyond Academic Life",
      "key_points": [
        "Opportunities for international research projects",
        "Build personal networks for job opportunities",
        "Utilize Imperial's partnerships and staff connections"
      ]
    }
  },
  {
    "content": "The College's Careers Service is a good port of call for support and guidance. You will be able to attend a variety of careers fairs and events throughout the year, where you will meet potential employers. Staff within your department will also be able to provide advice on careers, and you can book appointments with specialist consultants and placement advisors. The Careers Service also provides resources such as careers libraries, case studies, publications, guides to pursuing further study, and advice on CV writing, interviewing and networking.",
    "metadata": {
      "title": "Careers",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/beyond-academic-life/what-next/careers/",
      "category": "postgraduate taught",
      "subcategory": "Beyond Academic Life",
      "key_points": [
        "Careers Service offers support and guidance",
        "Attend careers fairs and events to meet potential employers",
        "Resources available for CV writing, interviewing, and networking"
      ]
    }
  },
  {
    "content": "During your Master's degree, you will be required to communicate in a variety of different ways. Strong communication and influencing skills are essential, not only as skills for education and studying, but also beyond into the workplace and the research environment. Learning how to communicate effectively with different audiences is hugely important in everything we do. This applies whether we are delivering a presentation, having a conversation, or writing something for a wider audience. In studying for a Master's degree, you will become something of an expert in your field. You will be expected to go beyond merely consuming knowledge and information, and start contributing to the understanding of the subject yourself.",
    "metadata": {
      "title": "Communicating and influencing",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/communicating-and-influencing/",
      "category": "postgraduate taught",
      "subcategory": "Communicating and Influencing",
      "key_points": [
        "Develop strong communication skills for various contexts",
        "Learn to communicate effectively with different audiences",
        "Contribute to the understanding of your field"
      ]
    }
  },
  {
    "content": "In writing tasks, you will usually need to demonstrate clear critical thinking skills to earn high marks. Weaker writing is more descriptive, and tends to describe a number of facts, figures and definitions without using this information to support a greater conclusion or hypothesis. While some description is beneficial, the reader will expect you to go somewhere with it. You will be expected to draw your own conclusions in your work, rather than simply parrot others. You will select the data and sources, and decide which evidence is stronger than others. As a result, you should not be afraid to make statements and judgements in your writing, regardless of whether you use the pronoun 'I' or not.",
    "metadata": {
      "title": "Academic writing",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/communicating-and-influencing/academic-writing/",
      "category": "postgraduate taught",
      "subcategory": "Communicating and Influencing",
      "key_points": [
        "Demonstrate critical thinking skills in writing",
        "Draw your own conclusions and make judgements",
        "Use evidence to support your arguments"
      ]
    }
  },
  {
    "content": "The key to giving a good presentation is preparation. Consider what you're trying to achieve, who your audience is, how you want to engage with them, and the venue where you'll be presenting. Structure your presentation clearly, including main points, supporting information, and linking sections. Practice your presentation with your supervisor, other research team members, or friends. To calm nerves, get a good night's sleep, take deep breaths, and remember that your audience wants to see you succeed. During the presentation, make eye contact, pace your delivery, vary your tone of voice, and use body language to emphasize points and appear confident.",
    "metadata": {
      "title": "Delivering presentations",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/communicating-and-influencing/verbal-communication/delivering-presentations/",
      "category": "postgraduate taught",
      "subcategory": "Communicating and Influencing",
      "key_points": [
        "Prepare thoroughly for presentations",
        "Consider audience, venue, and engagement strategies",
        "Practice delivery techniques and manage nerves"
      ]
    }
  },
  {
    "content": "One of the most valuable skills you will learn as a postgraduate student will be to communicate and interact effectively with academics, staff and fellow students. You will have support from our staff, and will be expected to reach out to them if you experience any academic or personal issues. It is important to be aware that academics and researchers have busy schedules and have many competing demands on their time. To contact your lecturer, you could ask in person or send a brief, focused email. If you don't hear within a working day, don't be afraid to send a polite follow up. While you will be expected to demonstrate independence and initiative, postgraduate study is an excellent opportunity to connect with world-renowned experts and explore your professional development.",
    "metadata": {
      "title": "Interacting with academic staff",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/communicating-and-influencing/your-voice/",
      "category": "postgraduate taught",
      "subcategory": "Communicating and Influencing",
      "key_points": [
        "Learn to communicate effectively with academics and staff",
        "Be aware of academics' busy schedules when contacting them",
        "Balance independence with seeking support and connections"
      ]
    }
  },
  {
    "content": "There are certain things you can do before you arrive to help support your studies. We have collected some information to help you plan effectively before you join your course. A Master's degree is undoubtedly a big commitment. It is inevitable that you're going to feel pushed for time sometimes. This is totally normal, but there are ways to make it easier on yourself. Most programmes are designed to be studied full-time, but some can be completed part-time. Both have expectations of attendance and independent study.",
    "metadata": {
      "title": "Getting started",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/getting-started/",
      "category": "postgraduate taught",
      "subcategory": "Getting Started",
      "key_points": [
        "Plan effectively before joining the course",
        "Prepare for time management challenges",
        "Understand expectations for full-time and part-time study"
      ]
    }
  },
  {
    "content": "If coming to Imperial will be the first time you've studied at an English-medium academic institution, you might want to upgrade your academic communication skills before you begin. Imperial's Centre for Academic English runs a 3-week, full-time course in September to help you prepare for your first term. The intensive course gives you practice in, and feedback on, many aspects of academic communication, including report writing and giving presentations. Attributes and Aspirations (AA) is an online short course that supports you to adapt to masters study at Imperial and then decide on, and plan for whatever you want your professional future to be.",
    "metadata": {
      "title": "Before you arrive",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/getting-started/before-you-arrive/",
      "category": "postgraduate taught",
      "subcategory": "Getting Started",
      "key_points": [
        "Consider upgrading academic communication skills",
        "Centre for Academic English offers preparatory courses",
        "Attributes and Aspirations online course available for support"
      ]
    }
  },
  {
    "content": "Some students may decide (for personal, medical or financial reasons) to take a temporary break in their studies. At Imperial, this is called an Interruption of Studies. To take a break in your studies, you need to get clearance from a personal tutor, course organiser or course director. Before you decide to take an interruption, it is vital that you discuss your circumstances with a member of your course team, so that they can provide you with the best possible guidance. If you are an international student and you are in the UK on a Student visa, you need to be aware that any change to your circumstances might impact on your visa and your ability to remain in the UK.",
    "metadata": {
      "title": "Breaks in study",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/getting-started/breaks-in-study/",
      "category": "postgraduate taught",
      "subcategory": "Getting Started",
      "key_points": [
        "Interruption of Studies available for temporary breaks",
        "Discuss circumstances with course team before deciding",
        "International students should be aware of visa implications"
      ]
    }
  },
  {
    "content": "To complete your programme successfully, you will need to commit to studying fairly intensively over a certain period of time. As a result, it may not always be in your best interests to juggle employment with full-time study. The expectation is that no student's paid work should impact negatively on their studies, however, part-time programmes allow some flexibility for students who have other commitments. Before committing to a programme, it is vital that you understand what your fees are, and consider how you will support yourself while studying, including the cost of living in London, accommodation and fees.",
    "metadata": {
      "title": "Finances",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/getting-started/finances/",
      "category": "postgraduate taught",
      "subcategory": "Getting Started",
      "key_points": [
        "Consider impact of employment on full-time study",
        "Part-time programmes offer more flexibility",
        "Understand fees and living costs before committing"
      ]
    }
  },
  {
    "content": "You can access support in your academic department from a number of different sources and you can choose the one that is right for you. Student Services is made up of a range of specialist student facing support services, including Careers, the Chaplaincy, the Counselling and Mental Health Advice Service, the Disability Advisory Service and the Sexual Violence Liaison Team. The ICU Advice Centre is a free, confidential, non-judgemental and independent service for all students studying at Imperial College. The Student Counselling Service provides individual counselling for registered students at the College for any personal issues that may be affecting your wellbeing.",
    "metadata": {
      "title": "Support",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/getting-started/support/",
      "category": "postgraduate taught",
      "subcategory": "Getting Started",
      "key_points": [
        "Various support services available in academic departments",
        "Student Services offers specialist support",
        "ICU Advice Centre and Counselling Service available"
      ]
    }
  },
  {
    "content": "Part-time courses involve committing yourself to study for a period of two to three years. Master's students are expected to take responsibility for their studies. However, we recognise that juggling a career and family with your academic life can be challenging. We have plenty of extra advice and support for part-time students, on issues such as working with others, making the most of the College community, and working remotely.",
    "metadata": {
      "title": "Part-time study",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/part-time-study/",
      "category": "postgraduate taught",
      "subcategory": "Part-Time Study",
      "key_points": [
        "Part-time courses typically last 2-3 years",
        "Students must balance career, family, and academic life",
        "Support available for various aspects of part-time study"
      ]
    }
  },
  {
    "content": "Part-time students with a group work project will need to master effective ways of working remotely as a team. You may be assigned to a group by your tutor, or be asked to form one yourselves based on your shared interests. You will need to assign roles and responsibilities when you convene the group, and agree how you will work together and communicate to achieve the task at hand. There are a variety of social activities, clubs, and open lectures at Imperial. Make sure you take the time to enjoy everything that the College has to offer.",
    "metadata": {
      "title": "Advice for part-time students",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/part-time-study/advice-for-part-time-students/",
      "category": "postgraduate taught",
      "subcategory": "Part-Time Study",
      "key_points": [
        "Develop effective remote teamwork skills",
        "Assign roles and responsibilities in group projects",
        "Engage in social activities and clubs at Imperial"
      ]
    }
  },
  {
    "content": "Imperial's part-time programmes are designed to combine fixed teaching modules with online study that you can complete remotely in your own time. Some courses feature more extensive online learning than others. Your programme administrator will advise you of the dates of face-to-face teaching modules before the beginning of the academic year to enable study leave to be booked. A list of local hotels that offer Imperial students and visitors accommodation at reduced rates is available for when you need to attend on-campus modules.",
    "metadata": {
      "title": "Getting started for part-time students",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/part-time-study/getting-started-for-part-time-students/",
      "category": "postgraduate taught",
      "subcategory": "Part-Time Study",
      "key_points": [
        "Programs combine fixed modules with remote online study",
        "Face-to-face teaching dates provided in advance",
        "Accommodation options available for on-campus modules"
      ]
    }
  },
  {
    "content": "You will be able to draw on plenty of support at Imperial as you complete your research project. Your department will ensure that you have an Imperial-based co-supervisor for your project, provide advice on identifying suitable projects, provide a monitoring framework to help you keep track of your progress, and produce regular reports. Some part-time students undertake their Master's research project at their workplace. In these cases, you will need to identify a suitable project that can comfortably be conducted in this setting, and find an appropriate local supervisor to support you.",
    "metadata": {
      "title": "Support for part-time students",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/part-time-study/support-for-part-time-students/",
      "category": "postgraduate taught",
      "subcategory": "Part-Time Study",
      "key_points": [
        "Extensive support available for research projects",
        "Imperial-based co-supervisor provided",
        "Option to conduct research project at workplace"
      ]
    }
  },
  {
    "content": "Part-time Master's students at Imperial usually enrol for either a two or three year period. If you enrol for a two-year Master's programme but discover that you will be unable to complete within two years, you may request to be moved across to the three year programme. It is possible to take a one year Interruption of Study if major professional or personal difficulties arise. This allows you to return to the programme exactly one year later. Up to two years of interruption may be requested. When on interruption you do not have access to College facilities.",
    "metadata": {
      "title": "Breaks in part-time study",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/part-time-study/support-for-part-time-students/",
      "category": "postgraduate taught",
      "subcategory": "Part-Time Study",
      "key_points": [
        "Option to extend from two to three-year programme",
        "Interruption of Study available for up to two years",
        "No access to College facilities during interruption"
      ]
    }
  },
  {
    "content": "Studying for a Master's degree is a step up from undergraduate work. At Master's level, your own learning and development is carried out in partnership with your lecturer. As your level of study increases, it is important to think more critically and reflectively about the information you encounter. Employers increasingly view inter-personal, team-working and communication skills as crucial when selecting new recruits. At the Master's level, you will be examined on a range of complex material that you will have learned from lecturers and your own independent study.",
    "metadata": {
      "title": "Study and research skills",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/study-and-research-skills/",
      "category": "postgraduate taught",
      "subcategory": "Study and Research Skills",
      "key_points": [
        "Master's study is more advanced than undergraduate work",
        "Critical thinking and reflection are crucial",
        "Interpersonal and communication skills are highly valued"
      ]
    }
  },
  {
    "content": "While each course is different, here are some general suggestions for pursuing your research: Take the initiative with your project, and think of your supervisor as an adviser, not a boss. Be ambitious. This is your chance to really hone and demonstrate your research skills. Prepare a timeline or timetable to help you plan your work and confirm that you can finish in time. Be orderly, precise and detailed, for example, in lab notebooks or when referencing. Look at examples of past projects, especially any that have been recommended to you. If you are collecting data, work out how you will analyse it before collecting it.",
    "metadata": {
      "title": "Choosing your project",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/study-and-research-skills/choosing-your-project/",
      "category": "postgraduate taught",
      "subcategory": "Study and Research Skills",
      "key_points": [
        "Take initiative and be ambitious with your project",
        "Plan your work with a timeline or timetable",
        "Be organized and detailed in your research process"
      ]
    }
  },
  {
    "content": "Critical thinking compels us to ask questions at several stages, such as: The formulation of the question - 'Am I asking the right questions?', Methods and evidence used - 'Is this a good way to investigate the question?', Any conclusions that are developed - 'Do these conclusions really reflect the evidence?' Critical thinking not only concerns evidence, but also challenges bias and ideology. Our own upbringing and environment can lead us to think in certain ways about things, but we can ask questions that tease these biases out.",
    "metadata": {
      "title": "Critical thinking and critical ability",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/study-and-research-skills/critical-thinking-and-critical-ability/",
      "category": "postgraduate taught",
      "subcategory": "Study and Research Skills",
      "key_points": [
        "Ask questions at various stages of research",
        "Challenge bias and ideology in thinking",
        "Evaluate methods, evidence, and conclusions critically"
      ]
    }
  },
  {
    "content": "Reflect regularly on whether your study techniques are effective and be aware of the best times in the day for your study. It may be the case that you work better in the mornings but have planned lots of evening work therefore you will have to adjust your schedule. What is your overall goal? This can sometimes be a daunting question, especially when you are starting out in your degree, so it may help to divide your goals into manageable tasks. Establishing the difference between your short-term and long-term goals is a good start and can help you to visualise the steps to achieving them.",
    "metadata": {
      "title": "Time management",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/study-and-research-skills/time-management-/",
      "category": "postgraduate taught",
      "subcategory": "Study and Research Skills",
      "key_points": [
        "Regularly reflect on study techniques and timing",
        "Divide overall goals into manageable tasks",
        "Establish short-term and long-term goals"
      ]
    }
  },
  {
    "content": "Lecturers may do a number of things, including: Organise and teach on the course, give you reading lists/recommendations and practice opportunities, provide support material, either on paper or online, set practical work for you, set formal and less formal assessments, suggest research projects or help you to identify projects that you can complete in your workplace based on your professional environment and circumstances, give you feedback through discussion or via comments written on your work. You will be expected to spend much of your time studying independently or with your peers, but your lecturers will be available if you need support.",
    "metadata": {
      "title": "What your teaching team expect from you",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/study-and-research-skills/what-your-teaching-team-expect-from-you/",
      "category": "postgraduate taught",
      "subcategory": "Study and Research Skills",
      "key_points": [
        "Lecturers provide various forms of support and guidance",
        "Independent study is a significant part of the program",
        "Seek support from lecturers when needed"
      ]
    }
  },
  {
    "content": "Take advantage of learning and development opportunities beyond your programme. Keep in touch with what's going on. Being a member of Imperial gives you privileged access to the Imperial community – use it.",
    "metadata": {
      "title": "1. Soak up Imperial",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/ten-top-tips/",
      "category": "postgraduate taught",
      "subcategory": "Ten Top Tips",
      "key_points": [
        "Utilize learning opportunities beyond your program",
        "Stay informed about Imperial activities",
        "Take advantage of Imperial community access"
      ]
    }
  },
  {
    "content": "Make lasting contact with students and staff across Imperial. Say yes to events and invitations – you never know who you might meet and what you might learn. And look out for opportunities to make links with professionals and alumni beyond Imperial.",
    "metadata": {
      "title": "2. Connect and network",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/ten-top-tips/",
      "category": "postgraduate taught",
      "subcategory": "Ten Top Tips",
      "key_points": [
        "Build connections with students and staff",
        "Attend events and accept invitations",
        "Seek opportunities to network with professionals and alumni"
      ]
    }
  },
  {
    "content": "Question, critically analyse, think, build evidence–based arguments, create, be original, find your own voice and take ownership of your study and research.",
    "metadata": {
      "title": "3. Think Master's level",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/ten-top-tips/",
      "category": "postgraduate taught",
      "subcategory": "Ten Top Tips",
      "key_points": [
        "Develop critical thinking and analysis skills",
        "Build evidence-based arguments",
        "Be original and find your own voice in research"
      ]
    }
  },
  {
    "content": "A Master's is very intense, but plan your time so that you can live, think, have fun, be sociable and develop alongside your study and research.",
    "metadata": {
      "title": "4. Balance your time",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/ten-top-tips/",
      "category": "postgraduate taught",
      "subcategory": "Ten Top Tips",
      "key_points": [
        "Recognize the intensity of Master's study",
        "Plan time for personal life and socializing",
        "Maintain balance between study and personal development"
      ]
    }
  },
  {
    "content": "Did you know that many PhDs and UK employers start to recruit master's students as early as October (to start work a year later)? Visit the Careers Service early on in your time at Imperial for advice and support in developing your future plans.",
    "metadata": {
      "title": "7. Consider what's next",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/ten-top-tips/",
      "category": "postgraduate taught",
      "subcategory": "Ten Top Tips",
      "key_points": [
        "Be aware of early recruitment timelines for PhDs and jobs",
        "Visit the Careers Service early in your studies",
        "Start planning your future career path early"
      ]
    }
  },
  {
    "content": "Life has its ups and downs and if you're struggling on any level, Imperial has a range of support services and systems in place. Don't struggle on alone – speak to someone, perhaps a friend, your personal tutor, someone from the programme team or any of the College's student support services.",
    "metadata": {
      "title": "9. If you need help, ask",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/ten-top-tips/",
      "category": "postgraduate taught",
      "subcategory": "Ten Top Tips",
      "key_points": [
        "Recognize that challenges are normal",
        "Utilize Imperial's support services when needed",
        "Don't hesitate to ask for help from friends, tutors, or support staff"
      ]
    }
  },
  {
    "content": "During your Master's degree, you will be expected to explore new perspectives, pursue your own research and add your own voice to the community in your field. Master a new skill, take up a new sport or embrace a new challenge – never again are you likely to have such freedom to learn about yourself and what you enjoy. The benefits of studying and researching at Imperial go beyond the lecture theatre. When you are planning how to make the most of your Imperial experience, why not consider how to use the resources at the College to your advantage?",
    "metadata": {
      "title": "Beyond academic life",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/beyond-academic-life/",
      "category": "postgraduate taught",
      "subcategory": "Student Life",
      "key_points": [
        "Explore new perspectives and pursue own research",
        "Take advantage of opportunities for personal development",
        "Utilize Imperial's resources beyond academics"
      ]
    }
  },
  {
    "content": "During your Master's degree, you will be required to communicate in a variety of different ways. Strong communication and influencing skills are essential, not only as skills for education and studying, but also beyond into the workplace and the research environment. Learning how to communicate effectively with different audiences is hugely important in everything we do. This applies whether we are delivering a presentation, having a conversation, or writing something for a wider audience.",
    "metadata": {
      "title": "Communicating and influencing",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/communicating-and-influencing/",
      "category": "postgraduate taught",
      "subcategory": "Skills Development",
      "key_points": [
        "Develop strong communication skills for various contexts",
        "Learn to communicate effectively with different audiences",
        "Essential for education, workplace, and research environment"
      ]
    }
  },
  {
    "content": "There are certain things you can do before you arrive to help support your studies. We have collected some information to help you plan effectively before you join your course. A Master's degree is undoubtedly a big commitment. It is inevitable that you're going to feel pushed for time sometimes. This is totally normal, but there are ways to make it easier on yourself. Most programmes are designed to be studied full-time, but some can be completed part-time. Both have expectations of attendance and independent study.",
    "metadata": {
      "title": "Getting started",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/getting-started/",
      "category": "postgraduate taught",
      "subcategory": "Preparation",
      "key_points": [
        "Prepare effectively before joining the course",
        "Understand the commitment required for a Master's degree",
        "Be aware of full-time and part-time study expectations"
      ]
    }
  },
  {
    "content": "Part-time courses involve committing yourself to study for a period of two to three years. In this section, we explain the options open to you, and advise you on how to get the right support. Master's students are expected to take responsibility for their studies. However, we recognise that juggling a career and family with your academic life can be challenging. Here, we outline the support available to you.",
    "metadata": {
      "title": "Part-time study",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/part-time-study/",
      "category": "postgraduate taught",
      "subcategory": "Study Options",
      "key_points": [
        "Part-time courses typically last 2-3 years",
        "Students must balance career, family, and academic life",
        "Support available for part-time students"
      ]
    }
  },
  {
    "content": "Studying for a Master's degree is a step up from undergraduate work. At Master's level, your own learning and development is carried out in partnership with your lecturer. As your level of study increases, it is important to think more critically and reflectively about the information you encounter. Employers increasingly view inter-personal, team-working and communication skills as crucial when selecting new recruits. At the Master's level, you will be examined on a range of complex material that you will have learned from lecturers and your own independent study.",
    "metadata": {
      "title": "Study and research skills",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/study-and-research-skills/",
      "category": "postgraduate taught",
      "subcategory": "Academic Skills",
      "key_points": [
        "Master's study requires more critical thinking than undergraduate",
        "Develop partnership with lecturers for learning",
        "Focus on interpersonal and communication skills"
      ]
    }
  },
  {
    "content": "Reflect regularly on whether your study techniques are effective and be aware of the best times in the day for your study. It may be the case that you work better in the mornings but have planned lots of evening work therefore you will have to adjust your schedule. What is your overall goal? This can sometimes be a daunting question, especially when you are starting out in your degree, so it may help to divide your goals into manageable tasks. Establishing the difference between your short-term and long-term goals is a good start and can help you to visualise the steps to achieving them.",
    "metadata": {
      "title": "Time management",
      "url": "https://www.imperial.ac.uk/students/success-guide/pgt/study-and-research-skills/time-management-/",
      "category": "postgraduate taught",
      "subcategory": "Study Skills",
      "key_points": [
        "Regularly assess and adjust study techniques",
        "Identify optimal study times and adjust schedule accordingly",
        "Break down overall goals into manageable tasks"
      ]
    }
  }
]