[
  {
    "content": "University will most likely be different to anything you have experienced before. You will be living with people from all over the world, taking responsibility for your own education, and looking after yourself. Before you arrive, take a look around and ensure that you are aware of what's expected of you, and what you can do to make the most of your time here.",
    "metadata": {
      "title": "Getting started",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/",
      "category": "undergraduate",
      "subcategory": "Getting Started",
      "key_points": [
        "University life is different from previous experiences",
        "You'll live with people from around the world",
        "Take responsibility for your education and self-care",
        "Be aware of expectations and opportunities"
      ]
    }
  },
  {
    "content": "Your department may send you a reading list in advance and you will be able to explore the resources before you even arrive at Imperial on the Library website. Think about what equipment will work best for you. A laptop isn't essential but can be very useful, or you might prefer to stock up on notepads, pens, highlighters and post-it notes and make use of the College computers.",
    "metadata": {
      "title": "What to do before you arrive",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-before-you-arrive/",
      "category": "undergraduate",
      "subcategory": "Getting Started",
      "key_points": [
        "Check for reading lists from your department",
        "Explore library resources in advance",
        "Consider what equipment you'll need (laptop, stationery, etc.)",
        "Familiarize yourself with College computer resources"
      ]
    }
  },
  {
    "content": "For each course, module, lecture or tutorial, the tutor will often refer you to certain text books, articles, videos or resources to prepare. For some courses, a reading list will be provided at the start of the year. This will often be supplemented by recommended reading via a Virtual Learning Environment such as Blackboard.",
    "metadata": {
      "title": "Reading lists",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-before-you-arrive/reading-lists/",
      "category": "undergraduate",
      "subcategory": "Getting Started",
      "key_points": [
        "Tutors provide resources for preparation",
        "Reading lists may be provided at start of year",
        "Additional reading recommendations via Virtual Learning Environment",
        "Library resources available for textbooks and articles"
      ]
    }
  },
  {
    "content": "It is not essential to have your own computer, but most students choose to as it is beneficial to be able to study and write assignments at home rather than just in the library or department. Online learning plays a large part during your time at university so you should expect that there will be lots of online resources and activities for you to complete.",
    "metadata": {
      "title": "Study equipment and technology",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-before-you-arrive/study-equipment-and-technology/",
      "category": "undergraduate",
      "subcategory": "Getting Started",
      "key_points": [
        "Personal computer not essential but beneficial",
        "Online learning is a significant part of university studies",
        "Expect online resources and activities",
        "Consider mobility needs when choosing equipment"
      ]
    }
  },
  {
    "content": "There's a lot to do when you arrive at Imperial. Follow our quick checklist to ensure you don't miss anything important, and that you make the best start you can to your time here. The transition from school to university can be a challenge. Use the resources on this page to find out more about support available to you as you start your degree and for advice on how to manage the transition.",
    "metadata": {
      "title": "What to do when you get here",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/",
      "category": "undergraduate",
      "subcategory": "Getting Started",
      "key_points": [
        "Follow the checklist to ensure you don't miss anything",
        "Transition from school to university can be challenging",
        "Resources available to support your transition",
        "Advice provided on managing the transition"
      ]
    }
  },
  {
    "content": "The transition from school to university is an exciting experience, but it can be challenging at times too. You may feel some uncertainty as you find your place in a new academic community and encounter different forms of learning and teaching than what you may have experienced at school. All of these feelings are very normal.",
    "metadata": {
      "title": "Adjusting to university study",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/adjusting-to-university-study/",
      "category": "undergraduate",
      "subcategory": "Getting Started",
      "key_points": [
        "Transition to university is exciting but can be challenging",
        "Uncertainty is normal when entering new academic community",
        "Learning and teaching methods may differ from school",
        "These feelings are common among new students"
      ]
    }
  },
  {
    "content": "Imperial has a number of campuses in London and the South East and it will take you a little while to find your way around. Don't worry - in your first few weeks and months everyone else will be finding their way around too. You can find out more about each campus below, or take a look at our campus maps.",
    "metadata": {
      "title": "Finding your way around Imperial College London",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/finding-your-way-around-imperial-college-london/",
      "category": "undergraduate",
      "subcategory": "Getting Started",
      "key_points": [
        "Imperial has multiple campuses in London and South East",
        "It takes time to familiarize with all locations",
        "Everyone is in the same situation in the first few weeks",
        "Campus maps are available for reference"
      ]
    }
  },
  {
    "content": "By studying at Imperial, you automatically become part of our Imperial community – a network of students, staff, alumni and supporters who can support you and help you make the most of your time here. There are countless opportunities to get involved in many different ways, all of which will allow you to enjoy your time at Imperial, make friends and quite often, build your knowledge and skills to help you in whatever you choose to do in the future.",
    "metadata": {
      "title": "Getting Involved with the Imperial Community",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/getting-involved-with-the-imperial-community/",
      "category": "undergraduate",
      "subcategory": "Getting Started",
      "key_points": [
        "Become part of the Imperial community as a student",
        "Network includes students, staff, alumni, and supporters",
        "Many opportunities to get involved and make friends",
        "Build knowledge and skills for future endeavors"
      ]
    }
  },
  {
    "content": "During your time at university, it is important to maintain a healthy work-life balance, specifically knowing when to work and when to rest. Clubs, Societies & Projects (CSPs) can be an important part of this balance. Imperial offers over 340 CSPs in the following categories: academic, arts & entertainment, charitable, cultural, departmental, faith, indoor, outdoor, martial arts, media, social and sports.",
    "metadata": {
      "title": "Student Clubs and Societies",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/getting-started/what-to-do-when-you-get-here/student-clubs-and-societies-/",
      "category": "undergraduate",
      "subcategory": "Getting Started",
      "key_points": [
        "Maintain a healthy work-life balance",
        "Clubs, Societies & Projects (CSPs) contribute to balance",
        "Over 340 CSPs available in various categories",
        "Opportunities for academic, social, and personal growth"
      ]
    }
  },
  {
    "content": "Throughout the year, we host a diverse and broad range of workshops and events to enhance your academic skills. Attending these workshops can help you learn new skills, build your confidence in these skills and get feedback from peers and tutors.",
    "metadata": {
      "title": "Academic Skills Workshops",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/workshops-and-support/academic-skills-workshops/",
      "category": "undergraduate",
      "subcategory": "Workshops and Support",
      "key_points": [
        "Diverse range of workshops and events offered",
        "Helps enhance academic skills",
        "Provides opportunity for skill-building and feedback"
      ]
    }
  },
  {
    "content": "The Library Services pages will help you progress through four stages of your assignment: Prepare it, Find it, Use it, and Write it. These pages are designed to allow you to work through them from start to finish, or you can dip in and out of the information depending on which stage you are at in your assignments.",
    "metadata": {
      "title": "Assignment strategies",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/workshops-and-support/assignment-strategies/",
      "category": "undergraduate",
      "subcategory": "Workshops and Support",
      "key_points": [
        "Library Services provides guidance on assignment stages",
        "Covers Prepare it, Find it, Use it, and Write it",
        "Flexible resource for different stages of assignment"
      ]
    }
  },
  {
    "content": "The Careers Service offers a range of workshops to help explore, plan and get the job or postgraduate study option that is right for you. These run throughout the year at a variety of times to help fit around all timetables. Careers Essentials are 1 hour sessions to help you get started on a range of topics including LinkedIn, application tools, interviews, and assessment centers.",
    "metadata": {
      "title": "Careers Workshops",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/workshops-and-support/careers-workshops/",
      "category": "undergraduate",
      "subcategory": "Workshops and Support",
      "key_points": [
        "Careers Service offers various workshops",
        "Helps with job search and postgraduate study planning",
        "Includes topics like LinkedIn, applications, and interviews"
      ]
    }
  },
  {
    "content": "Imposter syndrome can often result in anxiety and self-doubt. To combat this, be open about your feelings, document your achievements, reframe defeats as learning opportunities, and remember that you've been accepted into one of the top universities in the world. Don't forget that there is always support available to help you manage these feelings.",
    "metadata": {
      "title": "Imposter Syndrome",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/workshops-and-support/imposter-syndrome/",
      "category": "undergraduate",
      "subcategory": "Workshops and Support",
      "key_points": [
        "Imposter syndrome can cause anxiety and self-doubt",
        "Strategies include openness, documenting achievements, and reframing defeats",
        "Remember your accomplishments and available support"
      ]
    }
  },
  {
    "content": "Each department has a different system for assigning tutors to students. You may have a personal tutor who can advise you about academic progress and offer guidance on welfare issues. You may have a separate academic tutor for subject-specific information. Make sure you know who your contact is – they will then be able to let you know where to go or who to talk to when you need help.",
    "metadata": {
      "title": "In your department",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/workshops-and-support/in-your-department/",
      "category": "undergraduate",
      "subcategory": "Workshops and Support",
      "key_points": [
        "Tutor assignment systems vary by department",
        "May have personal tutor for academic and welfare guidance",
        "Separate academic tutor may be available for subject-specific help"
      ]
    }
  },
  {
    "content": "There are many sources of support at Imperial College. These include your academic department, Student Services (which includes Careers, Chaplaincy, Counselling, and Disability Advisory Service), the ICU Advice Centre, health services, and various support services like the Library, Careers Service, and Centre for Academic English. Don't hesitate to reach out when you need help.",
    "metadata": {
      "title": "Who to ask for help",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/workshops-and-support/who-to-ask-for-help/",
      "category": "undergraduate",
      "subcategory": "Workshops and Support",
      "key_points": [
        "Multiple support sources available at Imperial",
        "Includes academic department, Student Services, and ICU Advice Centre",
        "Specialized services like Library and Careers Service also offer support"
      ]
    }
  },
  {
    "content": "Take responsibility for your learning and shape your experience. Make it what you want it to be.",
    "metadata": {
      "title": "1. University study is about independence",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "Take responsibility for your own learning",
        "Shape your university experience",
        "Be proactive in your education"
      ]
    }
  },
  {
    "content": "The more you ask, the more you will learn. No one knows everything.",
    "metadata": {
      "title": "2. Participate and ask questions",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "Asking questions leads to more learning",
        "Don't be afraid to seek clarification",
        "Everyone is still learning, even experts"
      ]
    }
  },
  {
    "content": "Results show that those who attend classes get better marks than those who do not. This goes for remote classes too!",
    "metadata": {
      "title": "3. Don't skip your classes",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "Attendance correlates with better marks",
        "Applies to both in-person and remote classes",
        "Regular attendance is crucial for success"
      ]
    }
  },
  {
    "content": "They can help with any problems. You might not need them right away, but you might need them later.",
    "metadata": {
      "title": "4. Keep in touch with your personal tutor",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "Personal tutors can help with various problems",
        "Maintain contact even if immediate help isn't needed",
        "They're a valuable resource for future challenges"
      ]
    }
  },
  {
    "content": "Organise your time around lectures, reading, tutorials, the library and Clubs & Societies. Make time for you to dance, swim, walk, sing and relax.",
    "metadata": {
      "title": "5. Learn to manage your time",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "Organize time for academic and extracurricular activities",
        "Include time for relaxation and hobbies",
        "Balance study with personal interests"
      ]
    }
  },
  {
    "content": "Everyone is new. Speak to classmates, form study groups and try a new sport. Step outside your comfort zone.",
    "metadata": {
      "title": "6. Make friends",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "Everyone is new and in the same situation",
        "Engage with classmates and form study groups",
        "Try new activities to meet people"
      ]
    }
  },
  {
    "content": "It's given to help you improve your work and your grades. Give feedback, we like to improve too.",
    "metadata": {
      "title": "7. Use feedback",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "Feedback helps improve work and grades",
        "Actively use the feedback you receive",
        "Provide feedback to help improve the university"
      ]
    }
  },
  {
    "content": "Don't just stick to the lecture notes. Expand your knowledge.",
    "metadata": {
      "title": "8. Read around your subject",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "Go beyond lecture notes",
        "Expand your knowledge of the subject",
        "Explore additional resources and materials"
      ]
    }
  },
  {
    "content": "Feed your brain with thinking fuel. Can't cook? Learn. Whether you're a night owl, or an early bird, make sure you sleep. While you sleep, your body is working to maintain your health.",
    "metadata": {
      "title": "9. Eat, sleep and look after yourself",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "Maintain a healthy diet",
        "Ensure adequate sleep",
        "Prioritize self-care and health"
      ]
    }
  },
  {
    "content": "You are living in one of the greatest, most diverse, cities in the world. Explore, discover, and experience the city, it's all part of being an Imperial student.",
    "metadata": {
      "title": "10. Enjoy London",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/ten-top-tips/",
      "category": "undergraduate",
      "subcategory": "Top Tips",
      "key_points": [
        "London is a diverse and exciting city",
        "Take time to explore and discover",
        "Experiencing the city is part of being an Imperial student"
      ]
    }
  },
  {
    "content": "An Imperial education is not just about the cutting-edge knowledge you'll gain while studying for your degree. You will experience all kinds of different learning activities in your programme of study, providing you with skills to develop your academic and professional career. You will be required to plan and manage your own workload, organise group work and projects with new people and deliver presentations and projects as a team.",
    "metadata": {
      "title": "Effective study",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "Imperial education goes beyond subject knowledge",
        "Diverse learning activities develop academic and professional skills",
        "Self-management of workload and group projects is required",
        "Presentation and teamwork skills are emphasized"
      ]
    }
  },
  {
    "content": "Thinking critically is one of the most important skills you will develop whilst at university, and at the heart of critical thinking, is questioning. Questioning lecturers, questioning research and information, and questioning ourselves. By asking the right questions, you will find you are closer to the right answers.",
    "metadata": {
      "title": "Asking questions",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/asking-questions/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "Critical thinking is a crucial skill developed at university",
        "Questioning is at the heart of critical thinking",
        "Ask questions of lecturers, research, and yourself",
        "Asking the right questions leads to better answers"
      ]
    }
  },
  {
    "content": "The GROW model offers a learner-centred approach to structuring a conversation or thinking independently about an issue, to help a person move from setting a goal to identifying next steps include a time frame.",
    "metadata": {
      "title": "Coaching",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/coaching/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "GROW model is a learner-centered approach",
        "Helps structure conversations or independent thinking",
        "Assists in moving from goal-setting to action planning",
        "Includes timeframe considerations in planning"
      ]
    }
  },
  {
    "content": "Learning as the process of receiving and storing information in memory. Learning as the process of working together with others to solve a problem or complete a task. Learning as the process of sharing, discussing and debating ideas and concepts with other students or teachers.",
    "metadata": {
      "title": "How will you learn at Imperial?",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/how-will-you-learn-at-imperial/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "Learning involves receiving and storing information",
        "Collaborative problem-solving and task completion",
        "Sharing, discussing, and debating ideas with peers and teachers",
        "Multiple approaches to learning are employed"
      ]
    }
  },
  {
    "content": "Lectures will form a considerable portion of your learning at university. Find out what to expect from lectures and how to make the most of them. Have you ever thought about why or how you take notes? There are lots of different reasons for note-taking and different techniques depending on the purpose.",
    "metadata": {
      "title": "In class and in lectures",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/in-class-and-in-lectures/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "Lectures are a major part of university learning",
        "Understanding lecture expectations is important",
        "Various reasons and techniques for note-taking exist",
        "Effective note-taking enhances learning"
      ]
    }
  },
  {
    "content": "Whilst most of your teaching at Imperial College will be in-person, there may be times when teaching or personal & professional development workshops are delivered online. There are a number of different ways in which your teachers might choose to deliver teaching online, so you should expect that there will be variety in how remote classes will be taught.",
    "metadata": {
      "title": "Learning Online",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/learning-online/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "Most teaching is in-person, but some may be online",
        "Various methods for online teaching delivery",
        "Expect variety in remote class formats",
        "Be prepared for both in-person and online learning"
      ]
    }
  },
  {
    "content": "Reflect regularly on whether your study techniques are effective and be aware of the best times in the day for your study. It may be the case that you work better in the mornings but have planned lots of evening work therefore you will have to adjust your schedule.",
    "metadata": {
      "title": "Time management",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/time-management/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "Regularly reflect on study technique effectiveness",
        "Identify your most productive times of day",
        "Adjust your schedule to match your productivity patterns",
        "Be flexible in your time management approach"
      ]
    }
  },
  {
    "content": "As well as Blackboard, our Virtual Learning Environment, you will find that a lot of resources and information that you need is online. Online tools can be a huge advantage, but they can also be a distraction or a hindrance. Follow our advice for working online.",
    "metadata": {
      "title": "Working by yourself",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/working-by-yourself/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "Blackboard is the primary Virtual Learning Environment",
        "Many resources and information are available online",
        "Online tools can be both advantageous and distracting",
        "Follow advice for effective online work"
      ]
    }
  },
  {
    "content": "Need some help co-ordinating your group activities? We have some useful tools and techniques for you to try. Team work is important in the workplace as well as at university and employers are very keen to see this skill in graduates. Use this time to perfect your skills.",
    "metadata": {
      "title": "Working with others",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/working-with-others/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "Tools and techniques available for group activities",
        "Teamwork is important in university and workplace",
        "Employers value teamwork skills in graduates",
        "University is a time to develop teamwork skills"
      ]
    }
  },
  {
    "content": "When you're working from your desk on a regular basis, it's important that you find a good place to work. Find a quiet place with a good internet connection, access to power sources, and free from any unnecessary distractions.",
    "metadata": {
      "title": "Workspace",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/effective-study/workspace/",
      "category": "undergraduate",
      "subcategory": "Effective Study",
      "key_points": [
        "Finding a good workspace is crucial for regular study",
        "Seek a quiet place with good internet and power access",
        "Minimize unnecessary distractions in your workspace",
        "A proper workspace enhances productivity"
      ]
    }
  },
  {
    "content": "You will be assessed in a number of different ways during your degree, often depending on your subject choice. Find out about the different forms of assessment you'll come across in your time at Imperial. Throughout your course you'll be expected to produce reports, essays and other written assignments. We're here to help you understand what's required and produce clear, original writing.",
    "metadata": {
      "title": "Assessments & feedback",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Various forms of assessment used during your degree",
        "Assessments include reports, essays, and written assignments",
        "Support available to understand requirements",
        "Emphasis on clear and original writing"
      ]
    }
  },
  {
    "content": "Learning how to express your own ideas and discuss those of others in writing is an important academic skill. By planning your writing properly before you start, your writing will be clearer and more effective. 'Academic writing' does not just mean 'formal writing'. Check out these useful writing tips to help write clearly and for the right audience.",
    "metadata": {
      "title": "Academic writing",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/academic-writing/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Expressing ideas in writing is a crucial academic skill",
        "Proper planning leads to clearer, more effective writing",
        "Academic writing is not just formal writing",
        "Tips available for clear writing and audience consideration"
      ]
    }
  },
  {
    "content": "Presentations are a useful way to test your oral communication skills and your ability to prepare information for different audiences. After every assessment, you will get useful feedback. Be reassured by what you've done well, and use the feedback to focus your efforts for your next assignment.",
    "metadata": {
      "title": "Delivering presentations",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/delivering-presentations/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Presentations test oral communication skills",
        "Ability to prepare information for different audiences is assessed",
        "Feedback provided after every assessment",
        "Use feedback to improve future assignments"
      ]
    }
  },
  {
    "content": "Preparing for exams starts much earlier than the night before; we'll help you avoid the last-minute panic. You'll need to make sure you take good and useful notes throughout your course in order to be fully prepared for your exams.",
    "metadata": {
      "title": "Examinations",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/examinations/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Exam preparation should start well before the exam date",
        "Good note-taking throughout the course is essential",
        "Guidance available to avoid last-minute panic",
        "Effective preparation leads to better exam performance"
      ]
    }
  },
  {
    "content": "Your feedback about your experience at Imperial is really important to the institution. Feedback helps us to improve and enhance the experience students have here. There are plenty of ways to give feedback about your experience here. For example, you could: Complete surveys, such as the Student Online Evaluation (SOLE), the Student Experience Survey (SES), or the National Student Survey (NSS).",
    "metadata": {
      "title": "Giving feedback to staff",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/giving-feedback-to-staff/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Student feedback is crucial for improving Imperial",
        "Multiple ways to provide feedback are available",
        "Surveys like SOLE, SES, and NSS are used to gather feedback",
        "Feedback helps enhance student experience"
      ]
    }
  },
  {
    "content": "You will receive feedback in several ways while at university. Feedback may not just come from your tutor – it could come from unexpected sources. Applying feedback is essential to academic development. One of the keys to success at university is making full use of any feedback you receive.",
    "metadata": {
      "title": "Improving through feedback",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/improving-through-feedback/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Feedback comes in various forms and from different sources",
        "Applying feedback is crucial for academic development",
        "Making full use of feedback is key to university success",
        "Be open to feedback from unexpected sources"
      ]
    }
  },
  {
    "content": "If you find yourself rushing through the questions, purposefully slow down. Try and avoid skim-reading or scrolling too quickly. It's common to hold your breath or breathe shallowly when nervous. Purposefully pause regularly to inhale for at least 3 seconds and exhale for longer.",
    "metadata": {
      "title": "Keeping calm in exams",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/keeping-calm-in-exams-/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Slow down if rushing through questions",
        "Avoid skim-reading or quick scrolling",
        "Practice deep breathing to manage nervousness",
        "Regular pauses can help maintain calm"
      ]
    }
  },
  {
    "content": "This method of assessment is similar to a traditional \"test\" that you might have taken at school. They are a highly efficient and targeted way of testing a specific area of knowledge, and they'll let your tutor build up a good picture of how comprehensive your knowledge is.",
    "metadata": {
      "title": "Problem Sheets",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/methods-of-assessment/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Similar to traditional school tests",
        "Efficient for testing specific knowledge areas",
        "Helps tutors gauge comprehensiveness of knowledge"
      ]
    }
  },
  {
    "content": "Working in a laboratory environment requires a special set of skills, and these assessments will examine your ability to handle equipment confidently, competently and safely. Follow-up reports will show how well you have understood the underlying scientific principles behind the work.",
    "metadata": {
      "title": "Laboratory work and lab reports",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/methods-of-assessment/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Tests special skills required for lab work",
        "Assesses ability to handle equipment safely and competently",
        "Follow-up reports evaluate understanding of scientific principles"
      ]
    }
  },
  {
    "content": "Oral presentations test your ability to communicate effectively with others in a clear, concise and interesting way. You may also be asked questions after a presentation, which will assess the depth of your knowledge and your ability to deal with unexpected situations.",
    "metadata": {
      "title": "Presentations",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/methods-of-assessment/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Tests effective communication skills",
        "Assesses ability to present clearly and interestingly",
        "Questions after presentation test depth of knowledge and adaptability"
      ]
    }
  },
  {
    "content": "These test your ability to work with others. Different people bring different strengths to a project, and you will need to develop an understanding of the roles individuals play – as well as your own contribution to the team.",
    "metadata": {
      "title": "Group projects",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/methods-of-assessment/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Tests ability to work collaboratively",
        "Requires understanding of different roles in a team",
        "Assesses individual contribution within a group context"
      ]
    }
  },
  {
    "content": "Essays and reports are an effective way for you to demonstrate many of the desired skills you should be learning on your course - critical analysis, qualitative knowledge, mathematical and logical skills, and written communication capability.",
    "metadata": {
      "title": "Essays and reports",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/methods-of-assessment/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Demonstrates critical analysis skills",
        "Shows qualitative knowledge and logical thinking",
        "Tests mathematical skills and written communication"
      ]
    }
  },
  {
    "content": "Written exams can be used to demonstrate all the skills you use in writing essays and reports, but under a different set of conditions. They also test your ability to use these skills under pressure and without help from anyone else.",
    "metadata": {
      "title": "Written exams",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/methods-of-assessment/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Tests skills similar to essays and reports",
        "Assesses ability to work under pressure",
        "Evaluates independent work without external help"
      ]
    }
  },
  {
    "content": "Formative assessment helps you to improve. It doesn't count towards your final degree, but the lessons you learn through doing this type of assessment will help you to achieve a better final grade. For this reason the feedback you get on formative assessments is very important – this will tell you where your weak points are, and what you need to do to improve.",
    "metadata": {
      "title": "Formative Assessments",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/methods-of-assessment/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Helps improve skills but doesn't count towards final grade",
        "Provides important feedback for improvement",
        "Identifies weak points and areas for development"
      ]
    }
  },
  {
    "content": "Summative assessment measures how well you've done. All summative assessment counts towards your final degree, and is likely to happen at the end of a set period (term, semester, academic year, etc.). The feedback from this work will show you how well you have performed - and what your next steps should be.",
    "metadata": {
      "title": "Summative Assessments",
      "url": "https://www.imperial.ac.uk/students/success-guide/ug/assessments-and-feedback/methods-of-assessment/",
      "category": "undergraduate",
      "subcategory": "Assessments and Feedback",
      "key_points": [
        "Measures overall performance",
        "Counts towards final degree",
        "Typically occurs at the end of academic periods",
        "Provides feedback on performance and future steps"
      ]
    }
  }
]